{"id": "bei-001", "source": "Beitzah 12a", "strength": "prime", "title": "Moving Heavy Furniture on a Public Holiday", "vignette": "Someone wants to rearrange bulky couches on a public holiday, an activity not related to food or festive enjoyment. Is this a legitimate way to improve comfort or is it unnecessary labor forbidden by holiday rules?", "options": [{"id": "A", "text": "Avoid such carrying; it's unnecessary labor on a rest day.", "tags": ["defense-of-values", "self-discipline"]}, {"id": "B", "text": "Permit it if it improves the comfort of the household for the holiday.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "bei-002", "source": "Beitzah 21b", "strength": "okay", "title": "Surprise Guest and Extra Cooking on a Holiday", "vignette": "A holiday host cooked just enough food for the expected guests. A work colleague drops in unannounced. May the host cook more portions mid-holiday for the unexpected guest?", "options": [{"id": "A", "text": "Cook extra portions to be hospitable to the guest.", "tags": ["hospitality", "altruism"]}, {"id": "B", "text": "Refrain from cooking more, as the holiday rules only permit cooking for those planned for in advance.", "tags": ["rule-of-law", "tradition"]}]}
{"id": "bei-003", "source": "Beitzah 2a", "strength": "weak", "title": "Egg Laid on a Holiday", "vignette": "A hen lays an egg on the morning of a public holiday. May it be eaten right away?", "options": [{"id": "A", "text": "Yes; it's fresh food available for the day's meal.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "No; an egg laid on the holiday is considered an 'off-limits' item that wasn't prepared in advance.", "tags": ["rule-of-law", "tradition"]}]}
{"id": "bei-004", "source": "Beitzah 23b", "strength": "prime", "title": "Deer Stuck in Net on Holiday", "vignette": "A hunter discovers a deer already tangled in his net on a public holiday. Securing it requires tying rope, a forbidden act. Should he finish the capture for fresh meat, or leave it until after the holiday?", "options": [{"id": "A", "text": "Secure the deer to have fresh meat for the festival meal.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "Leave it until after the holiday to avoid forbidden labor.", "tags": ["rule-of-law", "self-discipline"]}]}
{"id": "bei-005", "source": "Beitzah 29a", "strength": "weak", "title": "Using Stones as a Grinder on a Holiday", "vignette": "Flour is running low for the holiday meal, and only two heavy rocks are available to crush more grain.", "options": [{"id": "A", "text": "Use them, despite the rule against using 'off-limits' tools.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Wait until after the holiday to grind grain properly.", "tags": ["rule-of-law", "self-discipline"]}]}
{"id": "bei-006", "source": "Beitzah 35b", "strength": "okay", "title": "Carrying Water Through a Neighbor's House", "vignette": "A next-door well is the only water source during the holiday, but the most direct route cuts through the neighbor's private rooms. Should one ask permission and carry, or respect their property and take the long way around?", "options": [{"id": "A", "text": "Ask permission and carry water through their home.", "tags": ["social-cohesion", "reciprocity"]}, {"id": "B", "text": "Avoid cutting through private property on a holiday.", "tags": ["privacy", "rule-of-law"]}]}
{"id": "bei-007", "source": "Beitzah 16b", "strength": "prime", "title": "Delivering Wedding Gifts on a Festival Day", "vignette": "Friends plan to lug heavy household gifts across town to newlyweds during a public holiday. Should they honor the couple now, or postpone the heavy carrying until after the holiday?", "options": [{"id": "A", "text": "Bring the gifts now to honor the new couple during the celebration.", "tags": ["social-cohesion", "utilitarian"]}, {"id": "B", "text": "Wait until after the festival to avoid the extra work.", "tags": ["rule-of-law", "self-discipline"]}]}
{"id": "bei-008", "source": "Beitzah 6b", "strength": "weak", "title": "Egg from a Prepared Bird", "vignette": "A hen was designated for the holiday meal but died unexpectedly before being slaughtered. An egg is now found inside it.", "options": [{"id": "A", "text": "Eat the egg, since the bird was already designated as food.", "tags": ["property-rights", "utilitarian"]}, {"id": "B", "text": "Do not eat it; its status is questionable since it wasn't a separate, intended food item.", "tags": ["rule-of-law", "prudence"]}]}
{"id": "bei-009", "source": "Beitzah 3b", "strength": "okay", "title": "Two-Day Boundary Permit", "vignette": "A 48-hour public holiday spans two consecutive days. Does one pre-set 'travel perimeter' marker cover both days, or must a new one be set for each day?", "options": [{"id": "A", "text": "Prepare separate perimeter agreements for each day.", "tags": ["rule-of-law", "tradition"]}, {"id": "B", "text": "A single agreement may cover both consecutive days.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "bei-010", "source": "Beitzah 22b", "strength": "prime", "title": "Lighting a Cigarette from an Existing Flame", "vignette": "Someone wants to light a cigarette from a pre-existing flame (like a candle) on the holiday. Is this a permitted transfer of fire, or a non-essential activity that is forbidden?", "options": [{"id": "A", "text": "Permitted, since transferring an existing fire is allowed for many purposes.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Prohibited, because smoking is not considered an essential need for the holiday.", "tags": ["defense-of-values", "self-discipline"]}]}
{"id": "bei-011", "source": "Beitzah 14b", "strength": "weak", "title": "Soaking Barley for Animals on a Holiday", "vignette": "Farmers need to soak grain overnight to soften it for their livestock, but doing so on a holiday may look like forbidden weekday labor.", "options": [{"id": "A", "text": "Soak it to ensure the animals are fed properly.", "tags": ["animal-welfare", "responsibility"]}, {"id": "B", "text": "Avoid this type of preparation on the holiday to uphold community standards.", "tags": ["defense-of-values", "rule-of-law"]}]}
{"id": "bei-012", "source": "Beitzah 21b", "strength": "okay", "title": "Opening the Barbershop on a Holiday", "vignette": "A barber thinks giving haircuts helps people feel festive and look their best for the holiday. Should he open his shop, or keep it closed like other businesses?", "options": [{"id": "A", "text": "Allow haircuts for the sake of holiday joy and appearance.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Haircuts are a form of labor and should be forbidden.", "tags": ["rule-of-law", "defense-of-values"]}]}
{"id": "bei-013", "source": "Beitzah 36b", "strength": "prime", "title": "Taking a Produce Tithe on a Holiday", "vignette": "A basket of fresh fruit still needs its mandatory community tithe separated before guests can eat it today. Should one separate it now, or make everyone wait until after the holiday?", "options": [{"id": "A", "text": "Delay separating the tithe until after the holiday, despite the inconvenience.", "tags": ["rule-of-law", "self-discipline"]}, {"id": "B", "text": "Separate it now so that everyone can eat the fruit.", "tags": ["utilitarian", "hospitality"]}]}
{"id": "bei-014", "source": "Beitzah 22a", "strength": "weak", "title": "Heating Bathwater for Infants on a Holiday", "vignette": "Parents wish to warm an entire tub of water for their babies' bath, even though adults are only permitted minimal washing on the holiday.", "options": [{"id": "A", "text": "Permissible, for the health and comfort of the children.", "tags": ["parental-responsibility", "utilitarian"]}, {"id": "B", "text": "Not allowed; only minimal washing is permitted for anyone.", "tags": ["rule-of-law", "proportionality"]}]}
{"id": "bei-015", "source": "Beitzah 33a", "strength": "okay", "title": "Gluing a Cracked Bowl on a Holiday", "vignette": "A clay serving dish cracks during the holiday feast. Can one apply a quick dab of glue to continue using it, or are repairs forbidden?", "options": [{"id": "A", "text": "Fix it quickly to continue using the dish for the meal.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Do not repair dishes on the holiday; that constitutes forbidden labor.", "tags": ["rule-of-law", "tradition"]}]}
