{"id": "rh-001", "source": "Rosh Hashanah 2a", "strength": "prime", "title": "Last-Minute New-Moon Witnesses", "vignette": "Two travelers rush in at dusk claiming they saw the first crescent of the new moon. Officials were ready to stick with the default calendar date. Should they accept the last-minute testimony or keep the preset date?", "options": [{"id": "A", "text": "Accept their testimony and officially declare the new month now.", "tags": ["rule-of-law", "tradition"]}, {"id": "B", "text": "Ignore them and maintain the preset schedule for social convenience.", "tags": ["utilitarian", "defense-of-values"]}]}
{"id": "rh-002", "source": "Rosh Hashanah 4b", "strength": "okay", "title": "Ceremonial Horn Blast on Rest-Day Clash", "vignette": "The annual Day of Renewal's first day falls on the weekly community rest day, when sounding instruments is normally forbidden. Some private groups want to blow the ceremonial horn at home. Should this be permitted or prohibited?", "options": [{"id": "A", "text": "Forbid all horn blowing to honor the weekly rest day rules.", "tags": ["rule-of-law", "defense-of-values"]}, {"id": "B", "text": "Allow it to be blown discreetly so the Day of Renewal's core tradition isn't missed.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "rh-003", "source": "Rosh Hashanah 16a", "strength": "weak", "title": "Interrupting a Silent Observance for a Horn Blast", "vignette": "During a period of silent, personal reflection, a ceremonial horn blast is heard from outside. Should one pause their reflection to listen?", "options": [{"id": "A", "text": "Pause briefly to listen and acknowledge the public call.", "tags": ["defense-of-values", "tradition"]}, {"id": "B", "text": "Continue one's personal reflection without interruption.", "tags": ["personal-agency", "self-discipline"]}]}
{"id": "rh-004", "source": "Rosh Hashanah 26b", "strength": "prime", "title": "Straight Horn vs. Ideal Curved Horn", "vignette": "The community only has a straight antelope horn for the ceremony. The ideal traditional instrument is a curved ram's horn. Should they use what's available or delay the ceremony until the preferred instrument can be found?", "options": [{"id": "A", "text": "Use the available horn; the act of blowing is what matters.", "tags": ["utilitarian", "collective-responsibility"]}, {"id": "B", "text": "Seek a curved horn, even if it delays the service, to meet the ideal.", "tags": ["tradition", "integrity"]}]}
{"id": "rh-005", "source": "Rosh Hashanah 29b", "strength": "okay", "title": "Women Blowing the Ceremonial Horn Themselves", "vignette": "Several women ask to sound the ceremonial horn in the community center. Should this be approved as inspiring participation, or discouraged because it isn't their formal, traditional obligation?", "options": [{"id": "A", "text": "Allow them; it inspires wider participation and connection.", "tags": ["personal-agency", "fairness"]}, {"id": "B", "text": "Discourage it; rely on the traditional designated blowers.", "tags": ["tradition", "rule-of-law"]}]}
{"id": "rh-006", "source": "Rosh Hashanah 22b", "strength": "weak", "title": "Announcing the New Month with Signal Fires", "vignette": "The central council debates whether to announce the new month by lighting signal fires on mountain tops or by sending messengers only. Fires are faster but risk confusion from impostors.", "options": [{"id": "A", "text": "Use fires for quick nationwide notification.", "tags": ["utilitarian", "simplification"]}, {"id": "B", "text": "Rely solely on messengers to avoid any possibility of mistakes.", "tags": ["rule-of-law", "responsibility"]}]}
{"id": "rh-007", "source": "Rosh Hashanah 25a", "strength": "prime", "title": "Punishing False New-Moon Witnesses", "vignette": "Witnesses are caught fabricating their claims of sighting the new moon. Should the council issue a public penalty to deter others, or just quietly dismiss their testimony?", "options": [{"id": "A", "text": "Yes; make a public example of them to deter future false testimony.", "tags": ["deterrence", "rule-of-law"]}, {"id": "B", "text": "No; quietly reject their testimony to avoid public conflict.", "tags": ["proportionality", "social-cohesion"]}]}
{"id": "rh-008", "source": "Rosh Hashanah 9a", "strength": "okay", "title": "Diplomatic Horn Salute Request", "vignette": "A visiting head of state asks for a ceremonial horn salute on the Day of Renewal. Should the community honor the guest with this gesture, or refuse to mix civic pomp with the traditional ceremony?", "options": [{"id": "A", "text": "Agree and blow the horn as a gesture of diplomatic respect.", "tags": ["social-cohesion", "utilitarian"]}, {"id": "B", "text": "Decline; the horn blasts are solely for the day's specific ceremony.", "tags": ["tradition", "defense-of-values"]}]}
{"id": "rh-009", "source": "Rosh Hashanah 30b", "strength": "weak", "title": "Declaring the New Month at Night", "vignette": "Witnesses for the new moon arrive after dark. Traditionally, the council declares the new month by day. May the court make the declaration that night?", "options": [{"id": "A", "text": "Wait until morning, despite the delay, to follow tradition.", "tags": ["tradition", "rule-of-law"]}, {"id": "B", "text": "Declare it immediately by torchlight for efficiency.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "rh-010", "source": "Rosh Hashanah 12a", "strength": "prime", "title": "Counting Regnal Years", "vignette": "A monarch is crowned one month before the civil new year used in contracts. Does the upcoming new year flip the king's reign to 'Year 2' already, or does 'Year 1' continue for twelve full months?", "options": [{"id": "A", "text": "Yes; for legal and contract purposes, a partial year counts as a full year.", "tags": ["rule-of-law", "utilitarian"]}, {"id": "B", "text": "No; start counting Year 2 only after twelve full months have passed.", "tags": ["proportionality", "tradition"]}]}
{"id": "rh-011", "source": "Rosh Hashanah 32b", "strength": "okay", "title": "Added Melodies Between Horn Blasts", "vignette": "The cantor wants to add creative vocal melodies between each traditional horn sequence. Should this be allowed for artistic inspiration, or should they keep to the tight, established order?", "options": [{"id": "A", "text": "Allow the creative melodies for inspiration and beauty.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Stick to the established, unadorned order of the ceremony.", "tags": ["tradition", "rule-of-law"]}]}
{"id": "rh-012", "source": "Rosh Hashanah 11a", "strength": "weak", "title": "Children Hearing the Ceremonial Horn", "vignette": "Young children run around noisily during the ceremonial horn service. Some wonder if it's worth bringing them at all, since they don't listen attentively.", "options": [{"id": "A", "text": "Bring them to accustom them to the tradition from an early age.", "tags": ["parental-responsibility", "defense-of-values"]}, {"id": "B", "text": "Leave them at home to maintain the decorum of the ceremony.", "tags": ["respect", "utilitarian"]}]}
{"id": "rh-013", "source": "Rosh Hashanah 34b", "strength": "prime", "title": "Minimal Horn Set in Small Congregation", "vignette": "A tiny, remote group can only manage ten simple horn blasts instead of the usual, much larger quota. Has their obligation been met, or must they find a way to reach the full count?", "options": [{"id": "A", "text": "Yes; any coherent series of blasts fulfills the basic requirement.", "tags": ["utilitarian", "proportionality"]}, {"id": "B", "text": "No; the full, prescribed number of blasts is required to fulfill the tradition.", "tags": ["rule-of-law", "tradition"]}]}
{"id": "rh-014", "source": "Rosh Hashanah 20b", "strength": "okay", "title": "Distant Witnesses vs. Local Holiday Observance", "vignette": "Villagers will miss celebrating the Day of Renewal at home if they must travel to the capital to testify about seeing the new moon. Should they go anyway to help set the national calendar correctly?", "options": [{"id": "A", "text": "Yes; setting the calendar correctly for the whole nation is paramount.", "tags": ["collective-responsibility", "self-sacrifice"]}, {"id": "B", "text": "They should stay home and celebrate locally with their families.", "tags": ["family-loyalty", "utilitarian"]}]}
{"id": "rh-015", "source": "Rosh Hashanah 6a", "strength": "weak", "title": "Delaying the Horn Blasts for a Bigger Crowd", "vignette": "Some propose delaying the ceremonial horn blasts until later in the service to draw a bigger crowd. Others insist on blowing them at the traditional, earlier time.", "options": [{"id": "A", "text": "Blow the horn early in the service, as is customary.", "tags": ["tradition", "rule-of-law"]}, {"id": "B", "text": "Delay the blasts to maximize the number of people who will hear them.", "tags": ["utilitarian", "fairness"]}]}
