{"id": "bek-001", "source": "Bekhorot 3b", "strength": "prime", "title": "Champion Bloodline Calf Develops Minor Defect", "vignette": "A rancher designated his best bull-calf for a prestigious national breeding program. Before transport, a veterinarian spots a small, disqualifying corneal scar.", "options": [{"id": "A", "text": "Release the animal from the program by paying a set fee, the funds of which support the program.", "tags": ["rule-of-law", "responsibility"]}, {"id": "B", "text": "Ignore the minor defect and send it to the program anyway.", "tags": ["utilitarian", "culpability"]}]}
{"id": "bek-002", "source": "Bekhorot 9a", "strength": "okay", "title": "Selling a Competition Animal Before Official Inspection", "vignette": "A farmer wants to sell a prize-winning lamb before the official program veterinarian has cleared it for competition. May he complete the sale first?", "options": [{"id": "A", "text": "Prohibited until the program official examines it.", "tags": ["rule-of-law", "integrity"]}, {"id": "B", "text": "He may sell it with the stipulation that the buyer pays the program release fee if it's disqualified.", "tags": ["property-rights", "utilitarian"]}]}
{"id": "bek-003", "source": "Bekhorot 12b", "strength": "weak", "title": "Program Official Waives Claim on Designated Animal", "vignette": "The program official declines to accept the designated calf, letting the owner keep it without paying the release fee.", "options": [{"id": "A", "text": "Allowed; the official can use their discretion to waive the fee.", "tags": ["personal-agency", "property-rights"]}, {"id": "B", "text": "Not permitted; the designated animal belongs to the program until the fee is paid.", "tags": ["rule-of-law", "integrity"]}]}
{"id": "bek-004", "source": "Bekhorot 19a", "strength": "prime", "title": "Private Use of a Specially Designated Animal After Disqualification", "vignette": "After a minor disqualifying defect is certified, a hobbyist asks to butcher the calf at home for family meat. Is that allowed once the disqualification paperwork is filed?", "options": [{"id": "A", "text": "It must still be formally released from the program via the standard fee, out of an abundance of caution.", "tags": ["rule-of-law", "integrity"]}, {"id": "B", "text": "It can be treated as a regular animal since its defect was confirmed.", "tags": ["utilitarian", "simplification"]}]}
{"id": "bek-005", "source": "Bekhorot 23b", "strength": "okay", "title": "Commercial Resale of Meat from a Prize-Winning Animal", "vignette": "A chef buys a prize-winning steer that has been properly released from its program. He then plans to slice and sell \"Champion Line\" steaks at a premium. Is this resale appropriate?", "options": [{"id": "A", "text": "Permitted once inspected and formally released from the program.", "tags": ["rule-of-law", "property-rights"]}, {"id": "B", "text": "Forbidden; the special status of the animal means its meat should not be commercially exploited.", "tags": ["integrity", "respect"]}]}
{"id": "bek-006", "source": "Bekhorot 27a", "strength": "weak", "title": "Using a Designated Animal for Labor Before Its Official Release", "vignette": "The owner uses his designated donkey for work before formally releasing it from the program by exchanging it for another animal.", "options": [{"id": "A", "text": "He may work it temporarily.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "He must release it from the program before any use.", "tags": ["rule-of-law", "integrity"]}]}
{"id": "bek-007", "source": "Bekhorot 31a", "strength": "prime", "title": "Official Profiting From a Designated Animal", "vignette": "After processing, a program official wants to sell portions of a designated animal's meat for personal profit.", "options": [{"id": "A", "text": "Allowed; it is part of their compensation.", "tags": ["property-rights", "utilitarian"]}, {"id": "B", "text": "Improper; the meat should be used for program purposes or shared without sale.", "tags": ["integrity", "integrity"]}]}
{"id": "bek-008", "source": "Bekhorot 37b", "strength": "okay", "title": "Lost Records for Specially Designated Animals", "vignette": "Breeding logs were lost; a farmer can't prove which of his animals were designated for the special program. How should he treat the doubtful animals?", "options": [{"id": "A", "text": "Any animal whose status is in doubt is exempt from program rules.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "All potentially designated animals must be treated as if they are in the program.", "tags": ["rule-of-law", "integrity"]}]}
{"id": "bek-009", "source": "Bekhorot 45b", "strength": "weak", "title": "Status of Animal Designated Before Owner Joined Program", "vignette": "A farmer joins a prestigious breeding program after one of his cows gives birth. Does the calf have designated status?", "options": [{"id": "A", "text": "Yes; the quality of the animal is what matters.", "tags": ["integrity", "fairness"]}, {"id": "B", "text": "No; it was born before he was a member of the program.", "tags": ["rule-of-law", "personal-agency"]}]}
{"id": "bek-010", "source": "Bekhorot 51a", "strength": "prime", "title": "Using a Designated Competition Animal for Labor", "vignette": "A heavyweight bull is idle in its pen. The owner wants to hitch it briefly to a plow while waiting for its official entry into a competition. Permitted?", "options": [{"id": "A", "text": "Forbidden until it is either disqualified or released from the program.", "tags": ["rule-of-law", "integrity"]}, {"id": "B", "text": "Allowed if the work is brief and does not risk injury.", "tags": ["utilitarian", "property-rights"]}]}
{"id": "bek-011", "source": "Bekhorot 54a", "strength": "okay", "title": "Delaying a Required Animal Exchange Due to Market Prices", "vignette": "Regulations require that a designated work-donkey must be exchanged for a healthy lamb by the end of the month. Lamb prices are unusually high, so the owner stalls. Is the delay acceptable?", "options": [{"id": "A", "text": "Must exchange it promptly despite the cost.", "tags": ["rule-of-law", "responsibility"]}, {"id": "B", "text": "A delay is acceptable until he can afford it.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "bek-012", "source": "Bekhorot 58b", "strength": "weak", "title": "Profiting From Byproducts of a Designated Animal", "vignette": "After processing a designated animal, the owner sells the hide.", "options": [{"id": "A", "text": "Permissible; only the animal itself had special status.", "tags": ["property-rights", "utilitarian"]}, {"id": "B", "text": "He should not profit from any part of the designated animal.", "tags": ["integrity", "respect"]}]}
{"id": "bek-013", "source": "Bekhorot 60b", "strength": "okay", "title": "Using Funds From Designated Animal Auctions for Public Works", "vignette": "Cash raised from auctioning designated animals now sits in a special account for the breeding program. The local town asks to use the funds to pave roads. Is that an acceptable use?", "options": [{"id": "A", "text": "Yes; spending on community benefits is a proper use of the funds.", "tags": ["collective-responsibility", "utilitarian"]}, {"id": "B", "text": "The funds should only be used to support the breeding program.", "tags": ["integrity", "self-discipline"]}]}
{"id": "bek-014", "source": "Bekhorot 63a", "strength": "weak", "title": "Designated Status for Animal Born via C-Section", "vignette": "A calf delivered surgically is the mother's first. Does it qualify for the prestigious 'firstborn' designation in the breeding program?", "options": [{"id": "A", "text": "Yes; the birth method doesn't matter.", "tags": ["fairness", "fairness"]}, {"id": "B", "text": "No; only animals born naturally qualify.", "tags": ["rule-of-law", "tradition"]}]}
{"id": "bek-015", "source": "Bekhorot 64b", "strength": "prime", "title": "Confusing Two Different Regulatory Animal Programs", "vignette": "A rancher confuses the 'Designated Animal' registry with the 'Annual Herd Tax' levy and tries to process them together. Can one inspection cover both requirements?", "options": [{"id": "A", "text": "Keep them distinct; each program has separate rules and requirements.", "tags": ["rule-of-law", "integrity"]}, {"id": "B", "text": "One process suffices for both for the sake of efficiency.", "tags": ["utilitarian", "simplification"]}]}
