{"id": "tem-001", "source": "Temurah 2a", "strength": "prime", "title": "Downgrading a Pledged Animal for a Youth Program", "vignette": "A farmer promised his best unblemished ewe-lamb to a youth-ag program, then tries to swap in a scarred one instead. Is this acceptable?", "options": [{"id": "A", "text": "Reject the substitution; the original animal remains designated, and the lesser one may also become designated as a penalty.", "tags": ["integrity", "deterrence"]}, {"id": "B", "text": "Allow the swap since both animals belong to him.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "tem-002", "source": "Temurah 4b", "strength": "okay", "title": "Regret After Authorizing a Substitute Donation", "vignette": "Moments after authorizing a replacement animal for a charity auction, the owner has second thoughts and asks to cancel the switch. Can officials void it?", "options": [{"id": "A", "text": "Too late—the substitution is legally binding once declared.", "tags": ["rule-of-law", "deterrence"]}, {"id": "B", "text": "Permit the annulment due to a hasty, unconsidered statement.", "tags": ["personal-agency", "compassion"]}]}
{"id": "tem-003", "source": "Temurah 6a", "strength": "weak", "title": "Program Official Misuses a Designated Animal", "vignette": "A program official exchanges a designated charity ram for a similar one from his own flock and keeps the designated one for a private party.", "options": [{"id": "A", "text": "He must return the designated animal and be sanctioned for misuse of assets.", "tags": ["responsibility", "integrity"]}, {"id": "B", "text": "No harm done if an animal of equal value remains designated for the charity.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "tem-004", "source": "Temurah 7b", "strength": "prime", "title": "Attempting a Second Substitution for a Designated Animal", "vignette": "After one legal replacement of a designated animal, the owner proposes swapping the new animal yet again for a different one. Does the second switch count?", "options": [{"id": "A", "text": "Only the first exchange takes effect. Subsequent swaps are invalid.", "tags": ["rule-of-law", "simplification"]}, {"id": "B", "text": "Each successful swap creates an additional designated animal.", "tags": ["deterrence", "responsibility"]}]}
{"id": "tem-005", "source": "Temurah 8a", "strength": "okay", "title": "Unauthorized Substitution by a Family Member", "vignette": "While feeding the herd, a teenager proclaims a substitute for his father's bull that was pledged to a breeding program. Is this statement binding on the father?", "options": [{"id": "A", "text": "It is void because the teenager lacks the legal authority to manage the assets.", "tags": ["authority", "due-process"]}, {"id": "B", "text": "It should be counted since he spoke sincerely on behalf of the family farm.", "tags": ["personal-agency", "family-loyalty"]}]}
{"id": "tem-006", "source": "Temurah 9a", "strength": "weak", "title": "Substituting a Communal Donation", "vignette": "Members of a town cooperative attempt to exchange their communally-owned prize bull, already designated for a national competition, for a nicer one.", "options": [{"id": "A", "text": "Communally-owned designated assets cannot be swapped.", "tags": ["integrity", "rule-of-law"]}, {"id": "B", "text": "Allow it, to improve the community's chances in the competition.", "tags": ["utilitarian", "collective-responsibility"]}]}
{"id": "tem-007", "source": "Temurah 10b", "strength": "prime", "title": "Attempting to Upgrade a Pledged Animal", "vignette": "A donor buys a stronger bull months after pledging the first one to a charity auction. He now wants the new one to carry the pledge. Does the original remain pledged as well?", "options": [{"id": "A", "text": "Yes, the new bull also becomes designated for the auction in addition to the first one.", "tags": ["responsibility", "deterrence"]}, {"id": "B", "text": "Only the replacement animal becomes designated.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "tem-008", "source": "Temurah 12a", "strength": "okay", "title": "Accidental Swap of Designated Animals Between Two Donors", "vignette": "Two neighbors accidentally swap animals that each had committed to separate agricultural charities. Should the charities cancel the exchanges to avoid confusion?", "options": [{"id": "A", "text": "Both exchanges are binding, creating additional designated animals for each charity.", "tags": ["collective-responsibility", "deterrence"]}, {"id": "B", "text": "Cancel the swaps to avoid the administrative chaos.", "tags": ["utilitarian", "due-process"]}]}
{"id": "tem-009", "source": "Temurah 13b", "strength": "weak", "title": "Status of Offspring from a Substituted Animal", "vignette": "A calf is born from a cow that was substituted for an originally pledged animal. Does the calf also have a designated status?", "options": [{"id": "A", "text": "Yes, the offspring is also considered designated.", "tags": ["tradition", "integrity"]}, {"id": "B", "text": "Only the mother retains the designated status.", "tags": ["rule-of-law", "simplification"]}]}
{"id": "tem-010", "source": "Temurah 15a", "strength": "prime", "title": "Invalid Cross-Species Substitution", "vignette": "An owner tries to replace a pledged steer with a goat of equal market value for a breeding program. Is a cross-species swap valid?", "options": [{"id": "A", "text": "Invalid swap; the program requires a steer.", "tags": ["integrity", "rule-of-law"]}, {"id": "B", "text": "Accept the goat of equal value to fulfill the pledge.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "tem-011", "source": "Temurah 16a", "strength": "okay", "title": "Ambiguous Substitution Declaration", "vignette": "Witnesses hear an owner mumble a replacement declaration for a pledged animal but can't tell which of his other animals he meant. Does any substitution take effect?", "options": [{"id": "A", "text": "Without a clear and unambiguous declaration, it has no legal effect.", "tags": ["due-process", "responsibility"]}, {"id": "B", "text": "Assume a valid intent and apply the substitution to the most likely animal.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "tem-012", "source": "Temurah 17b", "strength": "weak", "title": "Substitution Attempt by a Non-Member", "vignette": "A visiting farmer, who is not a member of the breed association, offers to substitute his animal for a member's designated prize bull.", "options": [{"id": "A", "text": "Disallow; the substitution rule applies only to animals owned by association members.", "tags": ["rule-of-law", "authority"]}, {"id": "B", "text": "Permit the substitution if the member agrees.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "tem-013", "source": "Temurah 18a", "strength": "okay", "title": "Substituting a Superior Animal for Financial Gain", "vignette": "An owner pledges a heifer to a charity, then substitutes a pricier one so he can sell the first for profit. Do both now count as pledged stock?", "options": [{"id": "A", "text": "Both animals become designated and cannot be sold freely for personal gain.", "tags": ["deterrence", "integrity"]}, {"id": "B", "text": "Allow the sale of one to fund the charity.", "tags": ["utilitarian", "collective-responsibility"]}]}
{"id": "tem-014", "source": "Temurah 19b", "strength": "prime", "title": "Effect of an Invalid Cross-Species Swap", "vignette": "An ox designated for a program is swapped for a goat. The rules forbid cross-species swaps. Does the goat also become designated as a penalty for the attempt, or does the invalidity of the swap mean nothing happens?", "options": [{"id": "A", "text": "The goat also becomes designated, in addition to the ox, as a penalty for the attempted illicit exchange.", "tags": ["deterrence", "rule-of-law"]}, {"id": "B", "text": "The substitution fails completely because the species differ; nothing happens.", "tags": ["integrity", "due-process"]}]}
{"id": "tem-015", "source": "Temurah 21a", "strength": "weak", "title": "Error Discovered After Donated Animal is Processed", "vignette": "Only after the charity has processed the meat from a substituted animal does the owner realize he made an improper substitution.", "options": [{"id": "A", "text": "The donation counts, though it was improper.", "tags": ["utilitarian", "culpability"]}, {"id": "B", "text": "It is invalid; a new, proper donation is required.", "tags": ["integrity", "responsibility"]}]}
