{"id": "ker-001", "source": "Keritot 2a", "strength": "prime", "title": "Accidental Violation of a Core Policy", "vignette": "A chef tastes a finished dish and later learns it contained a substance strictly prohibited by their professional code of ethics. What must be done now that the breach is discovered?", "options": [{"id": "A", "text": "A formal corrective action is required once informed of the violation.", "tags": ["responsibility", "integrity"]}, {"id": "B", "text": "No corrective action is needed since it was accidental and harmless.", "tags": ["culpability", "utilitarian"]}]}
{"id": "ker-002", "source": "Keritot 4b", "strength": "okay", "title": "Uncertainty About a Policy Violation", "vignette": "After a dinner party, a guest hears conflicting reports: the entrée 'might' have contained a prohibited ingredient or a permitted substitute. He cannot find out for certain. What should he do?", "options": [{"id": "A", "text": "File a precautionary self-report about the potential violation, just in case.", "tags": ["integrity", "integrity"]}, {"id": "B", "text": "Wait until there is certainty before taking any action.", "tags": ["due-process", "personal-agency"]}]}
{"id": "ker-003", "source": "Keritot 6a", "strength": "weak", "title": "Unable to Afford a Required Sanction", "vignette": "A member of a professional organization commits a violation for which the standard sanction is a fine they cannot afford.", "options": [{"id": "A", "text": "Allow a delayed payment or a non-monetary alternative.", "tags": ["utilitarian", "compassion"]}, {"id": "B", "text": "They must pay the fine promptly, even if it requires borrowing money.", "tags": ["responsibility", "integrity"]}]}
{"id": "ker-004", "source": "Keritot 7a", "strength": "prime", "title": "Entering a Sensitive Area While Unqualified", "vignette": "A visitor enters the core operations wing of a private research lab without realising his access badge had expired. Days later the lapse comes to light. Does he owe a formal penalty?", "options": [{"id": "A", "text": "A formal penalty is required once he is aware of the infraction.", "tags": ["integrity", "rule-of-law"]}, {"id": "B", "text": "No penalty is needed; his ignorance of the expired badge excuses the error.", "tags": ["culpability", "utilitarian"]}]}
{"id": "ker-005", "source": "Keritot 8b", "strength": "okay", "title": "Unintentional Violation Due to a Scheduling Error", "vignette": "Thinking a mandatory 24-hour professional moratorium began later, a person engages in a restricted activity. The official schedule shows the moratorium had already started. What is the corrective step?", "options": [{"id": "A", "text": "He is subject to the standard corrective action for the violation.", "tags": ["responsibility", "deterrence"]}, {"id": "B", "text": "Since he miscalculated, a formal apology suffices.", "tags": ["culpability", "personal-agency"]}]}
{"id": "ker-006", "source": "Keritot 9b", "strength": "weak", "title": "Multiple Violations in a Single Incident", "vignette": "A single action inadvertently violates two distinct rules in a code of conduct.", "options": [{"id": "A", "text": "A separate penalty should be assessed for each rule violated.", "tags": ["responsibility", "absolutism"]}, {"id": "B", "text": "A single penalty should cover the entire incident.", "tags": ["utilitarian", "simplification"]}]}
{"id": "ker-007", "source": "Keritot 10a", "strength": "prime", "title": "Violation Committed Before Becoming a Member", "vignette": "A newcomer engaged in a prohibited activity months before formally joining an organization that bans it. Must he address that earlier act now that he is a member?", "options": [{"id": "A", "text": "No, the rules did not apply to him before he joined.", "tags": ["rule-of-law", "culpability"]}, {"id": "B", "text": "Yes, he must now undergo a corrective action for the past offense.", "tags": ["integrity", "responsibility"]}]}
{"id": "ker-008", "source": "Keritot 11a", "strength": "okay", "title": "Intentional Violation with Later Remorse", "vignette": "Someone knowingly violates a core community standard—considered taboo—then experiences sincere remorse. What is required to make amends?", "options": [{"id": "A", "text": "A formal penalty is still required, even though the act was intentional.", "tags": ["responsibility", "deterrence"]}, {"id": "B", "text": "Sincere repentance and a public apology are sufficient.", "tags": ["personal-agency", "compassion"]}]}
{"id": "ker-009", "source": "Keritot 11b", "strength": "weak", "title": "Uncertainty About the Specific Violation", "vignette": "A person knows they violated a rule during a complex procedure, but is not sure which of two specific rules it was.", "options": [{"id": "A", "text": "File a single, general report of non-compliance to cover the uncertainty.", "tags": ["rule-of-law", "integrity"]}, {"id": "B", "text": "Avoid any report until certainty about the specific violation is achieved.", "tags": ["due-process", "personal-agency"]}]}
{"id": "ker-010", "source": "Keritot 13a", "strength": "prime", "title": "Validity of a Corrective Action Using Borrowed Resources", "vignette": "A person is required to fund a remedial training session as a penalty. They borrow money from a friend to pay for it. The friend later objects to how the money was used. Is the completed remedial action still valid?", "options": [{"id": "A", "text": "Yes, the action is valid. The source of the funds is a separate issue between the friends.", "tags": ["utilitarian", "simplification"]}, {"id": "B", "text": "No, the penalty is invalid if paid for with contested funds. It must be redone with their own resources.", "tags": ["integrity", "property-rights"]}]}
{"id": "ker-011", "source": "Keritot 14a", "strength": "okay", "title": "Equal Sanctions for All Members?", "vignette": "A question arises in a professional organization whether all members should face identical monetary or symbolic penalties for certain violations, regardless of seniority or status.", "options": [{"id": "A", "text": "Yes, obligations and sanctions should be equal for all members.", "tags": ["fairness", "rule-of-law"]}, {"id": "B", "text": "No, sanctions can be adjusted based on factors like seniority or past record.", "tags": ["tradition", "authority"]}]}
{"id": "ker-012", "source": "Keritot 15b", "strength": "weak", "title": "Partial Admission of a Violation", "vignette": "A member admits to one violation but conceals a second, related violation from the same incident.", "options": [{"id": "A", "text": "They must confess fully to have the matter resolved.", "tags": ["responsibility", "integrity"]}, {"id": "B", "text": "Address the admitted violation and keep the rest private.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "ker-013", "source": "Keritot 17a", "strength": "prime", "title": "Funds for a Sanction are Misplaced and Found Late", "vignette": "Money set aside for a mandatory fine disappears and is found after the deadline for payment has passed. May those funds still be used to pay the fine?", "options": [{"id": "A", "text": "Yes, use the funds to pay the fine, even though late.", "tags": ["utilitarian", "responsibility"]}, {"id": "B", "text": "The funds are considered invalid for that purpose; a new fine must be paid with different money.", "tags": ["rule-of-law", "deterrence"]}]}
{"id": "ker-014", "source": "Keritot 18b", "strength": "okay", "title": "Validity of a Corrective Action Using Revoked Resources", "vignette": "Someone borrows a specialized tool to perform a required corrective action. The owner retracts permission only after the action is complete. Does the action stand?", "options": [{"id": "A", "text": "The action still counts; the user's intent was proper at the time.", "tags": ["utilitarian", "culpability"]}, {"id": "B", "text": "It fails; it must be performed with resources that are properly secured.", "tags": ["property-rights", "integrity"]}]}
{"id": "ker-015", "source": "Keritot 19a", "strength": "weak", "title": "Violation Committed by an Agent", "vignette": "A junior employee, following a manager's instructions, inadvertently violates a company policy.", "options": [{"id": "A", "text": "The manager bears responsibility and faces the penalty.", "tags": ["responsibility", "authority"]}, {"id": "B", "text": "The junior employee who performed the action must personally face the penalty.", "tags": ["personal-agency", "deterrence"]}]}
