{"id": "mei-001", "source": "Meilah 2a", "strength": "prime", "title": "Caretaker Uses Facility Supplies for Personal Use", "vignette": "A maintenance worker takes logs from the institution's wood stock to use in his personal fireplace at home. What compensation, if any, is required?", "options": [{"id": "A", "text": "He must repay the value of the wood plus a penalty surcharge for the misuse of institutional property.", "tags": ["responsibility", "integrity"]}, {"id": "B", "text": "No penalty is required because the value was small and it was for personal warmth.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "mei-002", "source": "Meilah 3b", "strength": "okay", "title": "Earmarked Project Funds Accidentally Spent", "vignette": "Money earmarked for a specific charity project falls into a general household wallet and is spent on groceries. Once noticed, what repayment formula applies?", "options": [{"id": "A", "text": "The person must replace the amount plus a penalty surcharge as soon as the error is noticed.", "tags": ["responsibility", "deterrence"]}, {"id": "B", "text": "They only need to repay the principal value that was spent.", "tags": ["utilitarian", "culpability"]}]}
{"id": "mei-003", "source": "Meilah 5a", "strength": "weak", "title": "Unauthorized Use of a Designated Asset", "vignette": "An animal designated for a charity auction was ridden briefly for fun before being brought to the event.", "options": [{"id": "A", "text": "This unauthorized use constitutes a misuse of assets requiring compensation.", "tags": ["integrity", "responsibility"]}, {"id": "B", "text": "Since the animal was unharmed and returned, no additional payment is necessary.", "tags": ["utilitarian", "culpability"]}]}
{"id": "mei-004", "source": "Meilah 6a", "strength": "prime", "title": "Using Surplus Institutional Fabric for Personal Projects", "vignette": "Seamstresses making uniforms use surplus fabric that they believe is scrap but actually belongs to the institution. It was an honest mistake. What must they do?", "options": [{"id": "A", "text": "They must reimburse the institution for the value of the fabric, plus a surcharge.", "tags": ["responsibility", "rule-of-law"]}, {"id": "B", "text": "They should just return the finished clothing without any extra cost.", "tags": ["utilitarian", "culpability"]}]}
{"id": "mei-005", "source": "Meilah 7b", "strength": "okay", "title": "Using a 'Facility-Only' Asset for a Personal Task", "vignette": "A farmer forgets that his ox was pledged for a ceremonial display and uses it briefly to plough a private field. Is a misuse penalty owed?", "options": [{"id": "A", "text": "Yes, he owes a penalty for the unauthorized use of a designated asset.", "tags": ["responsibility", "deterrence"]}, {"id": "B", "text": "No penalty is required if the use was accidental, brief, and caused no harm.", "tags": ["culpability", "utilitarian"]}]}
{"id": "mei-006", "source": "Meilah 8a", "strength": "weak", "title": "Institution's Resources Mistakenly Used for Public Event", "vignette": "An institution's catering supplies are mistakenly distributed at a public town feast.", "options": [{"id": "A", "text": "The community should collectively repay the value of the supplies, plus a fifth.", "tags": ["collective-responsibility", "integrity"]}, {"id": "B", "text": "Repayment should be waived since it benefited the entire community and was a mistake.", "tags": ["utilitarian", "compassion"]}]}
{"id": "mei-007", "source": "Meilah 10a", "strength": "prime", "title": "Using a Canceled Donation", "vignette": "A donor privately cancels a pledged piece of equipment, but the charity's staff—unaware of the cancellation—use it in a public demonstration. Are the staff liable for misuse?", "options": [{"id": "A", "text": "No misuse occurred, since the equipment was no longer formally donated property.", "tags": ["rule-of-law", "personal-agency"]}, {"id": "B", "text": "The staff are liable because they believed it was donated property and used it as such.", "tags": ["responsibility", "culpability"]}]}
{"id": "mei-008", "source": "Meilah 11b", "strength": "okay", "title": "Wages Mistakenly Paid from Restricted Funds", "vignette": "A treasurer accidentally pays contractors from a restricted capital project fund instead of the general payroll account. How is the error rectified?", "options": [{"id": "A", "text": "The workers must return the money so it can be reissued from the correct account to maintain accounting integrity.", "tags": ["integrity", "responsibility"]}, {"id": "B", "text": "Let the workers keep the money; the institution can simply adjust its internal books.", "tags": ["utilitarian", "simplification"]}]}
{"id": "mei-009", "source": "Meilah 12a", "strength": "weak", "title": "Donated Materials Mixed with General Stock", "vignette": "Wood donated for a specific building project gets mixed in with the general lumber supply.", "options": [{"id": "A", "text": "To be safe, the entire pile must be treated as designated for the special project.", "tags": ["integrity", "deterrence"]}, {"id": "B", "text": "Estimate the amount and set aside an equivalent portion for the project.", "tags": ["utilitarian", "responsibility"]}]}
{"id": "mei-010", "source": "Meilah 13b", "strength": "prime", "title": "Personal Use of a Decommissioned Ceremonial Item", "vignette": "Someone legally buys a ceremonial bowl from a museum's decommissioned collection by paying its appraised value, then serves soup in it at home. Is this permitted?", "options": [{"id": "A", "text": "Permitted; once legally purchased and decommissioned, it is personal property.", "tags": ["rule-of-law", "personal-agency"]}, {"id": "B", "text": "It is still disrespectful to use a formerly ceremonial item for a mundane purpose.", "tags": ["respect", "tradition"]}]}
{"id": "mei-011", "source": "Meilah 14a", "strength": "okay", "title": "Partners Profit from Sale of Restricted Asset", "vignette": "Several investors sell an officially restricted historical artifact and split the proceeds. Who owes the misuse penalty—everyone, or only the partner who arranged the sale?", "options": [{"id": "A", "text": "Each partner who profited must pay a penalty according to their share.", "tags": ["collective-responsibility", "fairness"]}, {"id": "B", "text": "Only the partner who initiated the sale is liable for the penalty.", "tags": ["culpability", "personal-agency"]}]}
{"id": "mei-012", "source": "Meilah 15a", "strength": "weak", "title": "Unknowingly Purchasing Restricted Assets", "vignette": "A buyer purchases goods from a seller, unaware that they are restricted assets belonging to a charitable institution.", "options": [{"id": "A", "text": "Once informed, the buyer must return the items or pay their value to the institution, plus a penalty.", "tags": ["responsibility", "integrity"]}, {"id": "B", "text": "The buyer is exempt from any penalty since they acted in good faith.", "tags": ["culpability", "due-process"]}]}
{"id": "mei-013", "source": "Meilah 17b", "strength": "prime", "title": "Continued Misuse After Partial Repayment", "vignette": "A person begins paying back a penalty for misusing a restricted item but continues to use it before the balance is cleared. Is further use allowed?", "options": [{"id": "A", "text": "Further use is prohibited until the penalty is fully paid.", "tags": ["deterrence", "integrity"]}, {"id": "B", "text": "The partial payment allows for continued partial use.", "tags": ["utilitarian", "personal-agency"]}]}
{"id": "mei-014", "source": "Meilah 18a", "strength": "okay", "title": "Staff Pocketing Office Supplies", "vignette": "Office staff take small amounts of premium office supplies (e.g., nice pens, stationery) home for personal use, considering it an informal perk.", "options": [{"id": "A", "text": "They must reimburse the company for the supplies and face disciplinary action.", "tags": ["responsibility", "authority"]}, {"id": "B", "text": "Taking small, inexpensive items as an informal perk is acceptable.", "tags": ["worker-dignity", "utilitarian"]}]}
{"id": "mei-015", "source": "Meilah 19b", "strength": "weak", "title": "Misuse of Institutional Property Discovered Years Later", "vignette": "Years after using a restricted institutional asset for a personal project, someone learns it was never decommissioned and was still considered institutional property.", "options": [{"id": "A", "text": "They must pay the misuse penalty even years later.", "tags": ["rule-of-law", "responsibility"]}, {"id": "B", "text": "It's too late; a statute of limitations should apply to such a minor, unintentional violation.", "tags": ["utilitarian", "culpability"]}]}
