{"id":"az-001","source":"2a","strength":"prime","title":"Business Before a Controversial Regime's National Celebration","vignette":"A regime known for human rights abuses is holding a major national celebration in three days. May a business owner from another country sell goods (e.g., luxury items, technology) to citizens or entities of this regime now, knowing the profits might be used to support the regime or that the goods themselves might be showcased during the celebration, implying endorsement?","options":[{"id":"A","text":"Refuse all dealings until after the celebration to avoid any appearance of support or material contribution.","tags":["ethical-principles","moral-stance","anti-authoritarianism","boycott"]},{"id":"B","text":"Trade anyway to preserve income, maintain business relationships, or fulfill contractual obligations.","tags":["property-rights","utilitarianism","economic-necessity","business-neutrality"]}]}
{"id":"az-002","source":"2a","strength":"okay","title":"Repaying a Debt to an Entity Supporting a Harmful Ideology","vignette":"An individual owes money to an organization that is about to fund a major propaganda campaign for a harmful ideology. The debt is due just before the campaign launch. Paying now will contribute to the campaign's funding; delaying risks breach of contract and personal repercussions.","options":[{"id":"A","text":"Pay on time despite the funds potentially supporting the harmful campaign. Uphold contractual obligations.","tags":["responsibility","property-rights","contractual-obligation","personal-integrity"]},{"id":"B","text":"Attempt to postpone payment until after the campaign, or seek alternative ways to settle the debt that don't directly fund the harmful activity.","tags":["ethical-principles","moral-objection","financial-activism","mitigation-of-harm"]}]}
{"id":"az-003","source":"3a","strength":"prime","title":"Using a Public Facility Displaying Offensive Symbols","vignette":"A public facility (e.g., library, gym, park) prominently features symbols or imagery associated with a historical oppressive regime or a currently controversial political movement (e.g., a statue of a dictator, a flag of a disputed territory). Is using this facility for its intended purpose an acceptable act of utilizing public resources, or does it imply forbidden participation or endorsement of the offensive symbols?","options":[{"id":"A","text":"Use the facility; its incidental features do not constitute personal endorsement or participation in the ideology. Focus on utility.","tags":["utilitarianism","property-rights","freedom-of-thought","practicality"]},{"id":"B","text":"Avoid the facility; any benefit or use in the presence of such symbols feels like a compromise of principles or tacit approval.","tags":["ethical-principles","public-sanctification","moral-disapproval","boycott"]}]}
{"id":"az-004","source":"43a","strength":"okay","title":"Walking Through an Area Dominated by Opposing Ideological Symbols","vignette":"A major public thoroughfare in a city is dominated by monuments and banners of a political regime whose values an individual deeply opposes. To divorce document to work, they must walk through this area daily. Does passing through this space imply any honor or acceptance of the regime's ideology?","options":[{"id":"A","text":"Walk through; one's intent and internal convictions, not mere physical presence or posture, define personal stance. It's a public right of way.","tags":["personal-agency","utilitarianism","freedom-of-movement","internal-conviction"]},{"id":"B","text":"Find a detour, even if inconvenient, to avoid any perceived association or implied reverence for the regime's symbols.","tags":["ethical-principles","moral-expression","avoidance-of-complicity","symbolic-protest"]}]}
{"id":"az-005","source":"15a","strength":"okay","title":"Renting Property to Adherents of a Harmful Ideology","vignette":"A landlord can lease residential property to individuals known to be active members of an extremist group that promotes hate speech and may use the home for group meetings or displaying symbols of their ideology.","options":[{"id":"A","text":"Lease the property; normal commerce and housing rights outweigh concerns about tenants' private beliefs or activities, as long as they are not illegal.","tags":["property-rights","utilitarianism","non-discrimination-in-housing","freedom-of-belief"]},{"id":"B","text":"Refuse to lease; prevent one's property from being used to support or host activities related to a harmful ideology.","tags":["ethical-principles","moral-responsibility","community-safety","no-platforming-hate-groups"]}]}
{"id":"az-006","source":"14b","strength":"okay","title":"Selling General Goods to Those Who Might Misuse Them for Unethical Purposes","vignette":"A customer known to be involved with an organization that undertakes unethical activities (e.g., a corporate lobbyist for a polluting industry, a member of an aggressive political faction) wants to buy generally available goods (e.g., high-quality printing services, powerful computers) days before a major campaign by their organization. These goods are not inherently harmful but will likely be used to support the unethical activities.","options":[{"id":"A","text":"Sell the goods; once the items leave the seller's domain, their use is the buyer's concern and responsibility. Commerce is neutral.","tags":["property-rights","utilitarianism","free-market","seller-neutrality"]},{"id":"B","text":"Refuse the sale; knowingly aiding activities that violate one's ethical principles is forbidden.","tags":["ethical-principles","responsibility","complicity","moral-gatekeeping"]}]}
{"id":"az-007","source":"26b","strength":"weak","title":"Providing Unpaid Service to a Child of Ideological Opponents","vignette":"A skilled professional (e.g., a tutor, a music teacher) is asked to provide their services, without pay, to the child of a prominent figure in a movement whose values they strongly oppose. No compensation is offered.","options":[{"id":"A","text":"Decline the unpaid service; avoid fostering a positive relationship or providing uncompensated benefit to ideological opponents, which might be misconstrued or create future obligations.","tags":["ethical-principles","boundary-setting","principle-of-non-assistance","ideological-conflict"]},{"id":"B","text":"Agree out of compassion for the child, separating the child's needs from the parent's ideology.","tags":["altruism","sanctity-of-life","humanitarianism","child-welfare"]}]}
{"id":"az-008","source":"26b","strength":"okay","title":"Providing Professional Services to an Adherent of a Harmful Ideology","vignette":"An individual who is an active proponent of a harmful or discriminatory ideology seeks necessary professional services (e.g., medical care, legal representation) from a professional who despises that ideology. Refusal might lead to accusations of discrimination or breed hostility; assistance feels like a compromise of values, especially if uncompensated.","options":[{"id":"A","text":"Provide services only if compensated at a standard rate, to avoid any notion of gratuitous favor or endorsement. Maintain professional obligations.","tags":["responsibility","public-safety","professional-ethics","non-discrimination-in-service","financial-neutrality"]},{"id":"B","text":"Provide services even if uncompensated; universal human needs (like health or legal rights) override ideological objections.","tags":["altruism","sanctity-of-life","humanitarian-principle","professional-duty"]}]}
{"id":"az-009","source":"26b","strength":"okay","title":"Saving an Ideological Adversary from Mortal Danger","vignette":"An individual who actively promotes a hateful or dangerous ideology is in a life-threatening situation (e.g., drowning, accident). Must someone who vehemently opposes this ideology attempt a rescue if they are capable?","options":[{"id":"A","text":"Rescue; the value of human life is universal and supersedes ideological differences.","tags":["duty-to-rescue","sanctity-of-life","humanitarianism","moral-imperative"]},{"id":"B","text":"Do not endanger oneself for such an adversary; the obligation to preserve life applies primarily to those who uphold shared societal values, or one is not obligated to risk oneself for an enemy.","tags":["ethical-principles","self-preservation","ideological-conflict","societal-boundaries"]}]}
{"id":"az-010","source":"29b","strength":"prime","title":"Products Contaminated by Association with Harmful Ideology","vignette":"A batch of high-quality wine, intended for sale, is accidentally used in a ceremony by a group promoting a hateful ideology, or is prominently displayed and endorsed by them. Can the original owner still sell this wine for profit, or must it be destroyed due to its "taint" by association?","options":[{"id":"A","text":"Sell or otherwise derive benefit; the physical product is unchanged, and only its direct consumption in a harmful context might be banned. The association does not destroy its market value.","tags":["property-rights","utilitarianism","economic-realism","separation-of-product-and-association"]},{"id":"B","text":"Destroy it; any gain from a product so heavily "tainted" by association with a harmful ideology is forbidden and morally compromising.","tags":["ethical-principles","moral-purity","brand-integrity","symbolic-condemnation"]}]}
{"id":"az-011","source":"35b","strength":"weak","title":"Consuming Food Prepared by Adherents of a Conflicting Lifestyle","vignette":"A neighbor who is part of a community with very different and sometimes conflicting lifestyle choices (e.g., regarding diet, sourcing, or public procedure preparation that the recipient considers unethical or unhealthy) sends over a cooked meal as a friendly gesture. Accept or refuse?","options":[{"id":"A","text":"Accept and eat; promoting harmony and good neighborly relations is important.","tags":["reciprocity","utilitarianism","social-cohesion","tolerance"]},{"id":"B","text":"Refuse politely; adhering to one's own lifestyle or ethical eating principles is paramount, and there are concerns about the food's preparation or source.","tags":["ethical-principles","health-concerns","personal-integrity","boundary-maintenance"]}]}
{"id":"az-012","source":"17b-18a","strength":"prime","title":"Continuing Ethical Work Banned by an Authoritarian Regime","vignette":"An authoritarian regime outlaws public discussions, research, or advocacy concerning topics it deems subversive (e.g., climate change, human rights, historical truths), with severe penalties including death for violations. Should individuals and groups continue this work openly?","options":[{"id":"A","text":"Continue openly; core ethical duties and the pursuit of truth override personal risk and unjust laws.","tags":["ethical-principles","self-offering","civil-disobedience","moral-imperative","freedom-of-speech"]},{"id":"B","text":"Suspend open activities to preserve lives and seek more discreet or less risky methods to continue the work.","tags":["self-preservation","public-safety","strategic-retreat","risk-management"]}]}
{"id":"az-013","source":"18a","strength":"okay","title":"Bribing an Official to Free Someone Jailed by an Unjust Regime","vignette":"A person is imprisoned by an unjust regime for actions that are not true crimes but rather acts of dissent or conscience. A relative can bribe a corrupt official within the regime to secure their release.","options":[{"id":"A","text":"Pay the bribe; family loyalty and the imperative to free someone from unjust imprisonment come first.","tags":["altruism","family-loyalty","utilitarianism","ends-justify-means","anti-authoritarianism"]},{"id":"B","text":"Refuse; bribery supports corruption and undermines the rule of law, even if the regime itself is unjust. Seek legitimate channels or protest.","tags":["rule-of-law","responsibility","anti-corruption","ethical-purity"]}]}
{"id":"az-014","source":"15b","strength":"prime","title":"Selling Dual-Use Technology to Potentially Hostile Entities","vignette":"A company can sell advanced technology (e.g., powerful drones, encryption software, surveillance tools) to foreign entities or governments that, while currently neutral or clients, could potentially become adversaries or use the technology to harm the seller's home country or its allies.","options":[{"id":"A","text":"Refuse the sale; do not provide tools that could endanger one's own community or national security.","tags":["public-safety","self-preservation","responsibility","national-security","arms-control-ethics"]},{"id":"B","text":"Sell; a business may trade any legal goods, and it's not the seller's role to predict future geopolitical shifts or control end-use.","tags":["property-rights","utilitarianism","free-market","economic-benefit","technological-neutrality"]}]}
{"id":"az-015","source":"26b","strength":"prime","title":"Returning Lost Property to an Adherent of a Harmful Ideology","vignette":"You find a lost valuable item (e.g., wallet, phone) belonging to a known, active member of an organization that promotes harmful and discriminatory views. Your ethical code doesn't strictly compel you to return lost items to such individuals, yet not doing so might create conflict or be seen as theft.","options":[{"id":"A","text":"Return it for the sake of peace, personal integrity, or to avoid negative repercussions.","tags":["reciprocity","public-safety","altruism","personal-ethics","de-escalation"]},{"id":"B","text":"Keep it; one's ethical code does not require performing gratuitous acts of kindness or returning property to those who actively work against societal good.","tags":["ethical-principles","moral-objection","no-aid-to-harmful-actors","retributive-justice-lite"]}]}
{"id":"az-016","source":"20a","strength":"okay","title":"Giving Gifts to Officials in a Corrupt or Oppressive System","vignette":"An influential official in a system known for corruption or oppressive practices hints that a personal gift would be appreciated and could smooth future interactions or approvals. Your ethical code generally discourages providing benefits to such individuals, but refusal risks significant disadvantage or hostility from the official.","options":[{"id":"A","text":"Give the gift to maintain goodwill, avoid negative consequences, or navigate a difficult system.","tags":["utilitarianism","public-safety","pragmatism","self-preservation","greasing-the-wheels"]},{"id":"B","text":"Decline; avoid any voluntary act that could be construed as supporting or condoning corrupt or oppressive individuals/systems.","tags":["ethical-principles","anti-corruption","moral-stand","non-participation-in-bribery"]}]}
{"id":"az-017","source":"26a","strength":"okay","title":"Using Services from Someone Whose Practices You Deplore for a Dependent's Urgent Need","vignette":"The only available specialist to provide urgent care for a child (e.g., a unique medical treatment, a critical educational intervention) is someone whose broader professional practices or ethical standards are known to be questionable or exploitative (e.g., overcharges, promotes unproven methods, sources materials unethically).","options":[{"id":"A","text":"Engage their services—the child's immediate, critical need overrides concerns about the provider's other questionable practices.","tags":["sanctity-of-life","altruism","necessity","child-welfare","lesser-of-two-evils"]},{"id":"B","text":"Refuse; seek any alternative, even if costly or significantly delayed, to avoid condoning or supporting unethical practices.","tags":["ethical-principles","public-safety","moral-purity","long-term-consequences"]}]}
{"id":"az-018","source":"27b","strength":"okay","title":"Accepting Risky Medical Treatment from a Mistrusted Source","vignette":"A patient with a life-threatening injury is offered a critical surgical procedure by a medical team or institution whose competence or ethics have been seriously questioned (e.g., past malpractice, experimental unproven techniques, ideological bias in treatment). Declining the surgery is highly risky, but accepting it also carries significant risks due to the provider's reputation.","options":[{"id":"A","text":"Accept treatment—the chance of cure from the procedure, even if risky, outweighs dying without it. Trust in the immediate medical necessity.","tags":["self-preservation","sanctity-of-life","calculated-risk","desperation"]},{"id":"B","text":"Decline; the risk of harm from a mistrusted or potentially malicious/incompetent provider is too great. Seek alternatives or palliative care if possible.","tags":["public-safety","self-defense","patient-autonomy","trust-in-medicine","risk-aversion"]}]}
