{"id": "avot-001", "source": "1:14", "strength": "prime", "title": "Personal Needs vs. Public Duty", "vignette": "A local leader is torn. They have a pressing family need that requires their full attention and resources. At the same time, a community-wide issue has flared up that also demands their leadership. How should they prioritize their efforts?", "options": [{"id": "A", "text": "Prioritize personal and family well-being first; self-protection is primary.", "tags": ["family-loyalty", "self-preservation"]}, {"id": "B", "text": "Prioritize the community's well-being; accept personal costs for the common good.", "tags": ["altruism", "collective-responsibility"]}]}
{"id": "avot-002", "source": "1:6", "strength": "okay", "title": "Judging a Colleague's Motives", "vignette": "A colleague makes a mistake on a team project that creates a setback. Their explanation seems plausible, but you're not entirely sure if it was an honest error or a calculated move to avoid a difficult task. How do you approach the situation?", "options": [{"id": "A", "text": "Presume good intent; risk being occasionally deceived but foster trust.", "tags": ["trust", "fairness", "compassion"]}, {"id": "B", "text": "Take a cautious stance; protect oneself or society from potential negative outcomes of misjudged intent.", "tags": ["prudence", "responsibility", "self-preservation"]}]}
{"id": "avot-003", "source": "1:13", "strength": "weak", "title": "Career Advancement: Self-Promotion vs. Humility", "vignette": "A talented junior employee is advised by a mentor to be more assertive and visible to get promoted. However, they believe their work should speak for itself and are uncomfortable with self-promotion. Should they adopt a more aggressive strategy to advance their career or stick to their principles of humility?", "options": [{"id": "A", "text": "Actively self-promote to climb the career ladder.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Focus on doing great work and trust it will be recognized.", "tags": ["humility", "integrity", "prudence"]}]}
{"id": "avot-004", "source": "2:5", "strength": "okay", "title": "Taking Initiative in a Crisis of Inaction", "vignette": "During a crisis, a bystander notices that no one is taking responsibility or action to help. They are faced with a choice: should they step up and intervene, accepting personal risk to address the situation, or should they remain passive along with the crowd?", "options": [{"id": "A", "text": "Intervene and take action; accept personal risk to address the crisis or help others.", "tags": ["duty-to-rescue", "altruism", "personal-agency"]}, {"id": "B", "text": "Stay passive with the crowd; avoid jeopardizing your own safety or standing out.", "tags": ["self-preservation", "peer-pressure", "prudence"]}]}
{"id": "avot-005", "source": "2:16", "strength": "okay", "title": "Legacy Project vs. Immediate Wins", "vignette": "A city planner can either approve a monumental, multi-generational infrastructure project that will define the city's future but consume the entire budget for years, or they can use the funds for a series of smaller, popular initiatives that provide immediate benefits to citizens. The long-term project's success isn't guaranteed. What is the better use of public funds?", "options": [{"id": "A", "text": "Begin the project anyway; partial progress and laying groundwork are valuable contributions, even if completion is uncertain.", "tags": ["collective-responsibility", "utilitarian", "tradition"]}, {"id": "B", "text": "Decline to start; efforts might be wasted if completion is unlikely, and resources could be used for more achievable goals.", "tags": ["prudence", "simplification", "responsibility"]}]}
{"id": "avot-006", "source": "3:2", "strength": "weak", "title": "Publicly Endorsing a Flawed Government", "vignette": "In a country with a flawed or corrupt government, citizens debate the best course of action. Is it better to publicly support the existing regime to ensure stability and prevent potential chaos, or should one refuse to endorse it to maintain personal integrity, even if it risks social unrest?", "options": [{"id": "A", "text": "Publicly support the government; stability and order are paramount, even if the regime is imperfect.", "tags": ["authority", "public-safety", "utilitarian"]}, {"id": "B", "text": "Refrain from public endorsement; maintain personal integrity and do not legitimize an unjust or flawed authority.", "tags": ["freedom-of-thought", "personal-agency", "integrity"]}]}
{"id": "avot-007", "source": "4:7", "strength": "weak", "title": "Charging for Teaching Valuable Knowledge or Skills", "vignette": "An expert in a critical field is deciding on their business model. Should they charge significant fees for sharing their valuable knowledge and skills, arguing for fair compensation, or should they provide their teachings at little to no cost to ensure the widest possible access?", "options": [{"id": "A", "text": "Yes; educators and experts deserve fair compensation for their labor, time, and expertise.", "tags": ["property-rights", "personal-agency", "fairness"]}, {"id": "B", "text": "No, or minimally; essential or ethically important knowledge should be shared altruistically or at minimal cost to ensure wide access.", "tags": ["altruism", "compassion", "collective-responsibility"]}]}
{"id": "avot-008", "source": "5:10", "strength": "okay", "title": "Attitudes Towards Personal and Communal Property", "vignette": "When considering personal and community property, different philosophies emerge. Should a society prioritize strict individual ownership rights, where people's obligations are minimal? Or should it emphasize sharing and mutual support, where resources are distributed more equitably to foster a stronger community?", "options": [{"id": "A", "text": "Emphasize sharing and mutual support; resources should be distributed equitably to foster a strong community.", "tags": ["altruism", "reciprocity", "compassion"]}, {"id": "B", "text": "Emphasize strict individual ownership; there should be no forced redistribution or expectation of sharing beyond voluntary charity.", "tags": ["property-rights", "self-preservation", "personal-agency"]}]}
{"id": "avot-009", "source": "1:3", "strength": "okay", "title": "Volunteering: Pure Altruism vs. Resume-Building", "vignette": "A recent graduate is considering volunteering at a local charity. They know it's the right thing to do and will help people, but a big part of their motivation is that it will look great on their resume and help them land a job. Is it ethical to volunteer when personal gain is a major factor?", "options": [{"id": "A", "text": "Act only out of intrinsic motivation (e.g., devotion, compassion, duty), without regard for personal reward or recognition.", "tags": ["altruism", "integrity"]}, {"id": "B", "text": "Allow rewards and recognition to motivate good deeds; self-interest can be a powerful and acceptable driver for virtuous or beneficial behavior.", "tags": ["personal-agency", "utilitarian"]}]}
{"id": "avot-010", "source": "1:4", "strength": "okay", "title": "Open Door Policy vs. Personal Boundaries", "vignette": "You've always believed in being there for your friends. Lately, one friend has been taking advantage of your generosity, staying over unannounced for long periods and borrowing money without returning it. Do you set firm boundaries, risking the friendship, or continue to be accommodating in the name of loyalty?", "options": [{"id": "A", "text": "Practice open hospitality; be generous and welcoming to strangers and those in need, even at personal cost.", "tags": ["altruism", "hospitality", "compassion"]}, {"id": "B", "text": "Limit access and sharing; protect family privacy, personal resources, and security. Offer support through other means.", "tags": ["privacy", "self-preservation", "personal-agency"]}]}
{"id": "avot-011", "source": "1:7", "strength": "weak", "title": "Dealing with a Harmful or Unethical Neighbor", "vignette": "A person lives next to someone whose behavior is disruptive and unethical. Should they completely cut off contact to protect their own family's peace and safety, or should they try to maintain a relationship in the hope of being a positive influence and improving the situation?", "options": [{"id": "A", "text": "Cut ties; prioritize the safety, peace, and ethical environment of your own household.", "tags": ["public-safety", "self-preservation", "personal-agency"]}, {"id": "B", "text": "Maintain some contact; try to be a positive influence, mediate, or encourage improvement, without condoning their behavior.", "tags": ["altruism", "reconciliation", "compassion"]}]}
{"id": "avot-012", "source": "1:12", "strength": "weak", "title": "Actively Pursuing Peacemaking vs. Avoiding Conflict", "vignette": "When a dispute breaks out between colleagues or neighbors, a person must decide how to react. Is it better to actively intervene and try to mediate a resolution, even though it may be difficult and thankless? Or is it wiser to stay neutral and avoid getting entangled in other people's conflicts?", "options": [{"id": "A", "text": "Actively intervene to mediate and help reconcile the parties, even if it's challenging or thankless.", "tags": ["altruism", "collective-responsibility", "reconciliation"]}, {"id": "B", "text": "Stay out of it; avoid the personal risks, stress, and potential resentment that can come from getting involved in others' disputes.", "tags": ["self-preservation", "privacy", "prudence"]}]}
