{"id": "avot-001", "source": "1:14", "strength": "prime", "title": "Self-Interest vs. Solidarity", "vignette": "A community leader ponders: “If I do not advocate for my own needs and those of my immediate family, who will? But if my advocacy is *only* for my own, what is my value to the broader community?” Must one prioritize personal/family welfare or the well-being of the community?", "options": [{"id": "A", "text": "Prioritize personal and family well-being first; self-protection is primary.", "tags": ["self-preservation", "family-loyalty"]}, {"id": "B", "text": "Prioritize the community's well-being; accept personal costs for the common good.", "tags": ["altruism", "collective-responsibility", "altruism"]}]}
{"id": "avot-002", "source": "1:6", "strength": "okay", "title": "Benefit of the Doubt in Judgment", "vignette": "An ethical guideline states: “Judge every person favorably.” When evaluating someone's actions where the evidence is ambiguous or incomplete, should one lean towards presuming good intent or take a more cautious stance to guard against potential harm or deception?", "options": [{"id": "A", "text": "Presume good intent; risk being occasionally deceived but foster trust.", "tags": ["due-process", "altruism", "trust", "trust"]}, {"id": "B", "text": "Take a cautious stance; protect oneself or society from potential negative outcomes of misjudged intent.", "tags": ["public-safety", "self-preservation", "prudence", "prudence"]}]}
{"id": "avot-003", "source": "1:13", "strength": "weak", "title": "Seeking Public Honor and Recognition", "vignette": "An ancient saying warns: “One who aggressively seeks fame or honor may ultimately lose it or diminish their accomplishments.” Should a skilled professional or leader actively promote themselves to gain prestige and influence, or should they remain humble and let their achievements speak for themselves, allowing honor to come unsought?", "options": [{"id": "A", "text": "Self-promote actively; influence and impact often grow with public recognition and a strong personal brand.", "tags": ["personal-agency", "self-preservation", "trust"]}, {"id": "B", "text": "Remain humble and focus on the work; true honor and respect are earned and will come naturally if deserved.", "tags": ["altruism", "humility", "integrity", "fairness"]}]}
{"id": "avot-004", "source": "2:5", "strength": "okay", "title": "Taking Initiative in a Crisis of Inaction", "vignette": "An ethical teaching advises: “In a situation where no one is acting with responsibility or moral courage, strive to be the one who does.” If a critical situation arises and everyone else is passive or unwilling to act, should you take a potentially risky initiative?", "options": [{"id": "A", "text": "Intervene and take action; accept personal risk to address the crisis or help others.", "tags": ["duty-to-rescue", "altruism", "authority", "personal-agency"]}, {"id": "B", "text": "Stay passive with the crowd; avoid jeopardizing your own safety or standing out.", "tags": ["self-preservation", "peer-pressure", "prudence"]}]}
{"id": "avot-005", "source": "2:16", "strength": "okay", "title": "Starting a Large, Long-Term Project with Uncertain Completion", "vignette": "A community needs a major, long-term project (e.g., environmental cleanup, building new infrastructure) that will require sustained effort over many years. A leader reflects on the saying: “You are not obligated to complete the work, yet neither are you free to abandon it entirely.” Should one initiate such a large project knowing they personally may never see it finished or that completion is not guaranteed?", "options": [{"id": "A", "text": "Begin the project anyway; partial progress and laying groundwork are valuable contributions, even if completion is uncertain.", "tags": ["responsibility", "collective-responsibility", "trust", "tradition"]}, {"id": "B", "text": "Decline to start; efforts might be wasted if completion is unlikely, and resources could be used for more achievable goals.", "tags": ["self-preservation", "simplification", "responsibility", "prudence"]}]}
{"id": "avot-006", "source": "3:2", "strength": "weak", "title": "Publicly Endorsing a Flawed Government", "vignette": "An ancient teaching suggests: “Pray for the welfare of the government,” implying that stable rule prevents anarchy. In a modern context, should citizens publicly endorse or show support for a government they consider flawed, corrupt, or unjust, for the sake of maintaining social order or stability?", "options": [{"id": "A", "text": "Publicly support the government; stability and order are paramount, even if the regime is imperfect.", "tags": ["authority", "public-safety", "simplification", "public-safety"]}, {"id": "B", "text": "Refrain from public endorsement; maintain personal integrity and do not legitimize an unjust or flawed authority.", "tags": ["freedom-of-thought", "personal-agency", "personal-agency", "freedom-of-thought"]}]}
{"id": "avot-007", "source": "4:7", "strength": "weak", "title": "Charging for Teaching Valuable Knowledge or Skills", "vignette": "A traditional saying warns against profiting from sacred or essential knowledge: “Whoever uses the crown of learning for personal gain will perish.” In a modern context, may a teacher or expert charge fees for transmitting valuable knowledge, specialized skills, or ethical teachings?", "options": [{"id": "A", "text": "Yes; educators and experts deserve fair compensation for their labor, time, and expertise.", "tags": ["property-rights", "personal-agency", "fairness", "fairness"]}, {"id": "B", "text": "No, or minimally; essential or ethically important knowledge should be shared altruistically or at minimal cost to ensure wide access.", "tags": ["altruism", "altruism", "altruism", "altruism"]}]}
{"id": "avot-008", "source": "5:10", "strength": "okay", "title": "Attitudes Towards Personal and Communal Property", "vignette": "There are different attitudes towards property: ‘What's mine is mine, and what's yours is yours’ (strict individualism) versus ‘What's mine is yours, and what's yours is mine’ (extreme communalism) or ‘What’s mine is yours, and what’s yours is yours’ (altruism). When it comes to community resources or personal wealth, should the emphasis be on sharing and mutual support, or on respecting strict individual ownership?", "options": [{"id": "A", "text": "Emphasize sharing and mutual support; resources should be distributed equitably to foster a strong community.", "tags": ["altruism", "reciprocity", "altruism", "compassion"]}, {"id": "B", "text": "Emphasize strict individual ownership; there should be no forced redistribution or expectation of sharing beyond voluntary charity.", "tags": ["property-rights", "self-preservation", "personal-agency", "property-rights"]}]}
{"id": "avot-009", "source": "1:3", "strength": "okay", "title": "Motivation for Good Deeds: Intrinsic vs. Extrinsic Reward", "vignette": "An ancient sage advised: “Be not like servants who serve their master only for the sake of receiving a reward.” Should good deeds or ethical actions be performed purely for intrinsic reasons like love, duty, or compassion, or is it acceptable for them to be motivated by expected benefits, recognition, or rewards?", "options": [{"id": "A", "text": "Act only out of intrinsic motivation (e.g., devotion, compassion, duty), without regard for personal reward or recognition.", "tags": ["altruism", "integrity", "personal-agency", "altruism"]}, {"id": "B", "text": "Allow rewards and recognition to motivate good deeds; self-interest can be a powerful and acceptable driver for virtuous or beneficial behavior.", "tags": ["self-preservation", "personal-agency", "personal-agency", "utilitarian"]}]}
{"id": "avot-010", "source": "1:4", "strength": "okay", "title": "Hospitality and Generosity vs. Personal Privacy and Resources", "vignette": "A traditional teaching encourages extreme hospitality: “Let your house be open wide and let the needy be members of your household.” In modern life, must one open their home and resources freely to anyone in need, or is it more appropriate to guard personal space, family privacy, and resources?", "options": [{"id": "A", "text": "Practice open hospitality; be generous and welcoming to strangers and those in need, even at personal cost.", "tags": ["altruism", "collective-responsibility", "altruism", "altruism"]}, {"id": "B", "text": "Limit access and sharing; protect family privacy, personal resources, and security. Offer support through other means.", "tags": ["privacy", "self-preservation", "responsibility", "personal-agency"]}]}
{"id": "avot-011", "source": "1:7", "strength": "weak", "title": "Dealing with a Harmful or Unethical Neighbor", "vignette": "An old piece of advice says: “Keep away from a bad neighbor and do not associate with the wicked.” If you have a neighbor whose behavior is consistently unethical, disruptive, or harmful, should you sever all ties to protect yourself and your family, or should you try to maintain some contact in an attempt to influence them for the better or foster community?", "options": [{"id": "A", "text": "Cut ties; prioritize the safety, peace, and ethical environment of your own household.", "tags": ["public-safety", "self-preservation", "property-rights", "personal-agency"]}, {"id": "B", "text": "Maintain some contact; try to be a positive influence, mediate, or encourage improvement, without condoning their behavior.", "tags": ["altruism", "duty-to-rescue", "altruism", "reconciliation"]}]}
{"id": "avot-012", "source": "1:12", "strength": "weak", "title": "Actively Pursuing Peacemaking vs. Avoiding Conflict", "vignette": "A wise teacher, Hillel, was known for saying: “Be of the disciples of Aaron—love peace and actively pursue peace.” When disputes arise between others (e.g., colleagues, other community members), should you actively try to mediate and reconcile the parties, or should you remain neutral and avoid entanglement to prevent personal risk or resentment?", "options": [{"id": "A", "text": "Actively intervene to mediate and help reconcile the parties, even if it's challenging or thankless.", "tags": ["altruism", "collective-responsibility", "reconciliation", "reconciliation"]}, {"id": "B", "text": "Stay out of it; avoid the personal risks, stress, and potential resentment that can come from getting involved in others' disputes.", "tags": ["self-preservation", "privacy", "rule-of-law", "prudence"]}]}
