{"id":"bm-001","source":"2a-b","strength":"weak","title":"Simultaneous Claim on Unattended Item","vignette":"Two individuals simultaneously grab an apparently ownerless, valuable item (e.g., a designer coat, a smartphone) left on a seat in a public place, each exclaiming, “It’s mine, I saw it first!” There's no immediate proof of prior ownership or who touched it first.","options":[{"id":"A","text":"The item should be sold, or its value appraised, and the monetary value split equally between the two claimants.","tags":["reciprocity","fairness","compromise","dispute-resolution"]},{"id":"B","text":"The item should be held in escrow by a third party until one claimant can provide credible evidence of prior ownership or a superior claim.","tags":["property-rights","responsibility","evidence-based-decision","due-process"]}]}
{"id":"bm-002","source":"3a-b","strength":"okay","title":"Mixed Anonymous Cash Deposits","vignette":"A busy cashier at an event accepts two sealed, identical envelopes with cash deposits from two different attendees. One envelope was supposed to contain $100 and the other $200 for event fees. The cashier gets distracted and forgets which attendee submitted which envelope, and there are no names on them.","options":[{"id":"A","text":"Return $100 to each attendee who made a deposit. The extra $100 should be held in escrow until more information or clarification emerges. This minimizes immediate overpayment.","tags":["reciprocity","responsibility","risk-mitigation","prudent-distribution"]},{"id":"B","text":"The cashier (or their employer) must assume the worst-case scenario and find a way to compensate both attendees for their maximum potential deposit (i.e., be prepared to pay out $200 to each if claimed, absorbing the $100 loss).","tags":["responsibility","customer-service","worst-case-liability","fiduciary-duty"]}]}
{"id":"bm-003","source":"21b-22a","strength":"weak","title":"Finding an Item Before Owner Realizes It's Lost","vignette":"Someone finds a valuable item (e.g., a high-end smartwatch) on the floor in a public place. It seems likely it was just dropped, and the owner probably hasn't even realized it's missing yet.","options":[{"id":"A","text":"The finder may keep it immediately; the original owner will inevitably give up hope of finding it once they realize it's gone ("despair" - despair of owner). Possession is key.","tags":["property-rights","self-preservation","finders-keepers-early","assumption-of-future-despair"]},{"id":"B","text":"The finder must wait a reasonable period or make some effort to find the owner (e.g., turn it into lost and found) before claiming it. The owner hasn't yet "despaired" or relinquished ownership.","tags":["responsibility","honesty","due-diligence-finders","respect-for-property"]}]}
{"id":"bm-004","source":"30b-31a","strength":"okay","title":"Finding Lost Property While on Duty for Employer","vignette":"An employee, such as a delivery driver or a field technician, spots a lost valuable item (e.g., a wallet, jewelry) on the ground while performing their work duties during paid company time. Picking it up takes only a moment and does not interfere with their work.","options":[{"id":"A","text":"The found item (or its value after attempts to find the owner fail) belongs to the employee; finding lost items is not part of their job description or compensated work.","tags":["self-preservation","property-rights","finders-keepers","scope-of-employment-limits"]},{"id":"B","text":"The found item belongs to the employer; the employee's time and actions during work hours are effectively "owned" by the employer, including such incidental finds.","tags":["responsibility","employer-property-rights","work-time-activities","agent-principal-relationship"]}]}
{"id":"bm-005","source":"62a","strength":"prime","title":"Shared Limited Resource in a Life-or-Death Situation","vignette":"Two hikers are lost in the desert with only enough water for one person to survive the journey to the nearest known water source. One hiker owns the canteen of water.","options":[{"id":"A","text":"They should share the water equally, even though this means both will likely die. Prioritize fairness and equal chance.","tags":["altruism","reciprocity","equality-in-death","shared-fate"]},{"id":"B","text":"The owner of the canteen should drink all the water to ensure at least one life is saved. Prioritize survival of one over certain death of both.","tags":["self-preservation","property-rights","utilitarian-survival","grim-calculus"]}]}
{"id":"bm-006","source":"32a-33b","strength":"prime","title":"Assisting with an Animal Overloaded by Its Owner","vignette":"A passer-by sees a donkey that has collapsed on the road because its owner has clearly overloaded it with cargo far beyond its capacity. The owner is struggling.","options":[{"id":"A","text":"Help unload the donkey and assist the owner, despite the owner's obvious negligence and responsibility for the animal's plight. Show compassion and help alleviate suffering.","tags":["altruism","responsibility","animal-welfare","duty-to-assist-suffering"]},{"id":"B","text":"Decline to help; the owner's negligence caused the problem, and they should bear the full burden of correcting it. Intervening might enable further irresponsibility.","tags":["self-preservation","personal-responsibility","non-intervention-in-negligence","moral-hazard"]}]}
{"id":"bm-007","source":"47a-48a","strength":"weak","title":"Risk of Loss: After Payment but Before Delivery","vignette":"A buyer has paid in full for a specific, identified item (e.g., a custom piece of furniture) but has not yet taken physical possession of it from the seller's workshop. A fire breaks out in the workshop and destroys the item.","options":[{"id":"A","text":"Payment already transferred legal ownership; the loss of the item is the buyer's, even though they never took possession.","tags":["property-rights","transfer-of-title-on-payment","risk-follows-title","constructive-possession"]},{"id":"B","text":"Only physical possession and delivery complete the sale; the loss falls on the seller as the item was still in their custody and control.","tags":["responsibility","transfer-of-risk-on-delivery","physical-possession","seller-s-bailment-duty"]}]}
{"id":"bm-008","source":"49b-50b","strength":"okay","title":"Extent of Price Gouging That Voids a Sale","vignette":"A vendor sells an item to a customer for a price that is later found to be 17% above the established fair market price for that item at that time.","options":[{"id":"A","text":"Any overcharge exceeding a certain strict threshold (e.g., one-sixth, or approximately 16.67%) automatically cancels the sale. The buyer is entitled to a full refund upon returning the item.","tags":["responsibility","consumer-protection","price-gouging-rules","voidable-contract","ona-ah-strict"]},{"id":"B","text":"An overcharge of up to a higher threshold (e.g., one-third) might be tolerated; the buyer keeps the item but is entitled to a refund of the overcharged amount. Only extreme overcharges void the sale.","tags":["property-rights","market-flexibility","partial-refund","caveat-emptor-modified"]}]}
{"id":"bm-009","source":"61a-65a","strength":"okay","title":"Disguised Interest via Reciprocal 'Gifts'","vignette":"A person lends money to another. To circumvent rules against charging interest, the lender gives the borrower a separate, ostensibly unrelated "gift" just before the loan is made. The borrower, in turn, promises or feels obligated to give a similar "gift" back to the lender after the loan is repaid.","options":[{"id":"A","text":"This arrangement should be treated as forbidden interest; the "gifts" are clearly linked to the loan and are not genuinely voluntary. The loan should be repaid without the additional "gift" amounts.","tags":["responsibility","anti-usury","substance-over-form","ethical-lending","circumvention-of-rules"]},{"id":"B","text":"Allowed if the "gifts" are not legally tied to the loan in writing and their timing or amount is not precisely fixed in advance. They can be considered voluntary expressions of goodwill.","tags":["property-rights","freedom-of-contract","gift-giving-autonomy","formalistic-interpretation"]}]}
{"id":"bm-010","source":"78a-b","strength":"okay","title":"Borrowed Asset Conscripted by Authorities","vignette":"Someone borrows a neighbor's utility vehicle (e.g., a pickup truck). While the borrower is using it, the vehicle is lawfully commandeered by government authorities for emergency services (e.g., during a natural disaster). It's uncertain if or when it will be returned, or in what condition.","options":[{"id":"A","text":"The borrower is responsible for the loss or for securing compensation from the authorities and making the owner whole. They had custody.","tags":["responsibility","bailee-liability","duty-to-return-or-compensate","risk-of-loss-on-borrower"]},{"id":"B","text":"The owner bears the loss; conscription by lawful government authority is a force majeure event beyond the borrower's control, absolving them of liability (especially if the seizure wasn't due to the borrower's specific activity or location).","tags":["property-rights","force-majeure","government-seizure","risk-of-loss-on-owner"]}]}
{"id":"bm-011","source":"80a-81b","strength":"okay","title":"Using Hired Equipment on an Unauthorized, Risky Route","vignette":"A construction company hires a piece of heavy equipment (e.g., an excavator) for use on a specific, approved worksite. The hirer, to save time, takes the equipment down a much rougher, unapproved access route that the owner had explicitly forbidden, and the equipment sustains damage. The hirer claims the damage would have occurred even on the approved route due to a hidden defect.","options":[{"id":"A","text":"The court should consider the hirer's claim; if the damage was inevitable due to a pre-existing defect, the choice of route is irrelevant, and there's no liability for the hirer.","tags":["property-rights","proof-of-causation","pre-existing-condition","mitigating-circumstances"]},{"id":"B","text":"The hirer pays for the damage; any unauthorized deviation from agreed usage terms, especially one involving increased risk, makes the hirer strictly liable for resulting damage, regardless of other potential causes.","tags":["responsibility","breach-of-contract","strict-liability-for-misuse","unauthorized-use"]}]}
{"id":"bm-012","source":"92a-93b","strength":"okay","title":"Workers' Right to Consume Produce During Harvest","vignette":"Agricultural laborers are hired to harvest crops (e.g., fruit, vegetables). They are traditionally allowed to eat some of the produce while working. What is a fair and reasonable limit to this on-the-job consumption?","options":[{"id":"A","text":"Virtually unlimited consumption is allowed while actively picking or handling the specific crop they were hired for, as long as they don't take any away. It's a customary perk.","tags":["worker-dignity","employee-benefits","customary-rights","perquisite-of-labor"]},{"id":"B","text":"Consumption should be limited to what is necessary to sustain them during work, or a nominal amount roughly equivalent to the value of their wage for that period, to prevent significant loss to the owner.","tags":["reciprocity","responsibility","fair-usage","limits-on-perks","cost-to-employer"]}]}
{"id":"bm-013","source":"110b-112a","strength":"prime","title":"Timeliness of Wage Payments for Day Laborers","vignette":"A day laborer (e.g., construction worker, event staff) completes their work at the end of the scheduled day (e.g., sunset). The employer is not able to process payroll and pay them until the next morning.","options":[{"id":"A","text":"Payment by the next morning (e.g., within 12 hours or at the start of the next business day) is acceptable; this constitutes a reasonable operational delay.","tags":["property-rights","practical-payroll-processing","reasonable-delay","business-operations"]},{"id":"B","text":"Wages are due by the end of the same calendar day or shift on which the work was completed; any delay beyond that (e.g., "overnight") is a violation of fair labor practice and disrespects the worker's dignity and immediate needs.","tags":["worker-dignity","responsibility","prompt-payment-laws","respect-for-labor","immediate-need"]}]}
{"id":"bm-014","source":"93a-98b","strength":"weak","title":"Liability Standards for Different Types of Custodians","vignette":"An item is lost or destroyed due to an unavoidable accident (e.g., a sudden flood, an earthquake) while in the care of four different types of custodians: an unpaid volunteer guardian, a paid professional guardian/bailee, someone renting the item, and someone who borrowed it for free.","options":[{"id":"A","text":"Only the person who borrowed the item for free is always liable to pay for it; the others (unpaid guardian, paid guardian, renter) are generally exempt from liability for truly unavoidable accidents if they weren't negligent.","tags":["responsibility","degrees-of-liability","bailee-categories","assumption-of-risk-borrower"]},{"id":"B","text":"Liability should vary based on the level of benefit or payment involved; the paid guardian and renter might have higher responsibility than the unpaid guardian, while the borrower for free has the highest. All might be exempt for true "Act of God" events.","tags":["reciprocity","risk-and-reward","proportional-liability","benefit-determines-duty"]}]}
{"id":"bm-015","source":"104a-106a","strength":"weak","title":"Sharecropper's Loss Due to Widespread Blight","vignette":"A tenant farmer (sharecropper) agrees to cultivate land for a percentage of the crop. A widespread, unexpected agricultural blight (e.g., fungal disease, insect infestation) ruins half the expected harvest across the entire region.","options":[{"id":"A","text":"The landowner bears the primary loss from the blight, as the land itself failed to produce; the sharecropper's share should be calculated from the reduced harvest, or rent adjusted.","tags":["property-rights","landowner-risk","force-majeure-agriculture","act-of-god-blight"]},{"id":"B","text":"The tenant farmer (sharecropper) bears the loss proportionate to their share; they accepted the risks of farming in exchange for a percentage of whatever crop is produced, good or bad.","tags":["responsibility","reciprocity","assumption-of-risk-farming","contractual-crop-share"]}]}
{"id":"bm-016","source":"108a","strength":"prime","title":"Responsibility for Clearing a Blocked Communal Irrigation Canal","vignette":"A vital irrigation canal, maintained by a voluntary association of farmers, becomes blocked by silt, affecting water supply to both upstream and downstream farms. Farms further down the canal lose water first.","options":[{"id":"A","text":"The downstream farmers, who are most immediately affected by the water loss, should take the primary initiative and cost to clear the blockage.","tags":["responsibility","direct-impact-motivates","self-help-for-benefit"]},{"id":"B","text":"The upstream farmers have the primary responsibility to clear the blockage; if they don't, no water will reach anyone further down. It is their duty to ensure flow to others.","tags":["reciprocity","upstream-downstream-ethics","collective-water-management","duty-to-ensure-flow"]}]}
{"id":"bm-017","source":"102a-b","strength":"okay","title":"Cost of a Privacy Fence Between Neighbors","vignette":"One homeowner desires to build a tall, solid privacy fence between their property and their neighbor's. The neighbor, while not objecting to the fence, refuses to contribute to the cost, arguing they don't need or want such a substantial fence.","options":[{"id":"A","text":"Both neighbors must share the cost of a standard-quality fence if one party insists on it, as privacy and clear boundaries benefit both properties to some degree.","tags":["privacy","reciprocity","shared-benefit-shared-cost","boundary-improvement"]},{"id":"B","text":"The neighbor who wants the fence must bear the full cost if the other does not consent to share. One cannot compel a neighbor to pay for an upgrade they don't want.","tags":["property-rights","individual-choice","no-forced-contribution-for-unwanted-improvement"]}]}
{"id":"bm-018","source":"118a","strength":"okay","title":"New Window Overlooking Neighbor's Private Yard","vignette":"A homeowner installs a new window in their house that directly overlooks a neighbor's private backyard, compromising the neighbor's sense of privacy.","options":[{"id":"A","text":"The neighbor can legally object and demand the window be removed, altered (e.g., frosted glass), or screened to prevent direct overlooking; loss of privacy is a recognized harm.","tags":["privacy","responsibility","visual-trespass","right-to-private-enjoyment","nuisance"]},{"id":"B","text":"If the window is high enough from the ground or meets local building codes, it is allowed. There is no absolute right to prevent being overlooked in urban/suburban settings.","tags":["property-rights","building-codes","urban-living","no-right-to-unseen-spaces"]}]}
{"id":"bm-019","source":"117b","strength":"okay","title":"Squatter's Liability for Rent When Owner Unaware","vignette":"A person discreetly lives in a vacant apartment or uses an abandoned commercial space without the owner's knowledge. The owner suffers no direct financial loss (e.g., no utility costs incurred by the squatter, no other potential tenant was displaced during that specific time). The owner eventually finds out.","options":[{"id":"A","text":"The squatter owes no rent for the period of unauthorized use, as the owner suffered no actual, demonstrable financial loss from the occupancy. (Benefit to squatter, no cost to owner).","tags":["self-preservation","reciprocity","no-harm-no-foul-rent","unjust-enrichment-defense"]},{"id":"B","text":"The squatter is liable for fair market rent for the period of unauthorized use; using someone's property without consent inherently constitutes a compensable benefit to the user and a technical trespass.","tags":["property-rights","responsibility","unjust-enrichment-claim","constructive-lease"]}]}
{"id":"bm-020","source":"58b-59b","strength":"prime","title":"Comparing Verbal Abuse to Minor Financial Fraud","vignette":"A merchant, during a transaction, deeply humiliates a customer with public insults and disparaging remarks, but the actual financial discrepancy in the transaction (e.g., a slight overcharge or shortchanging) is very small, almost negligible.","options":[{"id":"A","text":"The verbal abuse and public humiliation are a more serious offense than the minor financial impropriety, causing greater harm to dignity.","tags":["worker-dignity","responsibility","emotional-harm-vs-financial","primacy-of-respect"]},{"id":"B","text":"Both wrongs are significant and perhaps equally culpable; ethical codes often condemn both verbal abuse and financial dishonesty strongly.","tags":["reciprocity","equality-of-offenses","holistic-ethics"]}]}
{"id":"bm-021","source":"2a-b","strength":"weak","title":"Attempting to Dedicate Disputed Property to a Public Cause","vignette":"During a heated ownership dispute over a jointly used facility (e.g., a community workshop, a shared piece of equipment), one party unilaterally declares the facility "dedicated to public use" or "donated to charity" in an attempt to resolve the stalemate or gain an advantage.","options":[{"id":"A","text":"The dedication may be valid, instantly changing the status of the property and potentially forcing the other claimant to negotiate with the new public/charitable entity.","tags":["property-rights","strategic-maneuver","forcing-a-resolution","public-good-claim"]},{"id":"B","text":"Such a unilateral dedication or sanctification fails if ownership is actively and legitimately disputed. One cannot give away what is not clearly theirs.","tags":["responsibility","due-process-in-disputes","invalid-unilateral-action","clear-title-needed-for-donation"]}]}
{"id":"bm-022","source":"2b-3a","strength":"weak","title":"Dispute Over a Contested Financial Document","vignette":"A lender and a borrower are both physically holding onto the same original signed loan document. The lender claims the debt is outstanding, while the borrower, also clutching the document, claims to have fully repaid it (and perhaps was about to receive/destroy the note).","options":[{"id":"A","text":"The face value of the loan should be notionally divided, and each party should attest under oath to their claim regarding their portion, leading to a split or partial resolution.","tags":["reciprocity","oath-based-resolution","solomonic-compromise","handling-irresolvable-claims"]},{"id":"B","text":"The document is indivisible and represents a single claim. The court or mediator must decide entirely for one party based on any available evidence, witness testimony, or assessment of credibility. No splitting.","tags":["property-rights","responsibility","all-or-nothing-judgment","evidence-based-decision"]}]}
{"id":"bm-023","source":"10a","strength":"weak","title":"Acquiring Property Through an Uninstructed Agent","vignette":"Person R sees a valuable item (e.g., a rare collectible, a dropped concert ticket) on the ground in a public place and, being unable to reach it immediately, shouts to Person D, a passerby: “Please pick that up for me!” Person D picks it up.","options":[{"id":"A","text":"Person R (who gave the instruction) acquires the item through Person D's action; D acted as R's agent.","tags":["responsibility","law-of-agency","instructed-action","principal-agent-acquisition"]},{"id":"B","text":"Person D (who physically picked it up) keeps the item; agency cannot be established by a mere unsolicited shout without prior agreement or consent from D to act on R's behalf. D is the finder.","tags":["self-preservation","property-rights","finders-keepers","unsolicited-agency-ineffective"]}]}
{"id":"bm-024","source":"10a-b","strength":"weak","title":"Dependent Acquiring Lost Property for a Third Party","vignette":"A minor child, who is legally dependent on their parent, finds a lost coin on the street and says, "I'm picking this up for my grandparent."","options":[{"id":"A","text":"The child can effectively acquire the coin on behalf of their grandparent, even if the child is a legal dependent. Their stated intent is valid for acquisition by the grandparent.","tags":["altruism","responsibility","agency-by-minors","intent-in-acquisition"]},{"id":"B","text":"Whatever a dependent child acquires automatically belongs to their legal guardian (the parent) by default. The coin goes to the parent, regardless of the child's statement about the grandparent.","tags":["property-rights","parental-rights-over-minors-property","legal-dependency-impacts-acquisition"]}]}
{"id":"bm-025","source":"27a","strength":"weak","title":"Are a Few Neatly Stacked Coins an Identifying Mark?","vignette":"Someone finds three coins of the same denomination stacked neatly one on top of the other in a public place where loose coins are common.","options":[{"id":"A","text":"The specific number (three) and their neat arrangement (stacked) constitute a sufficiently unique identifying mark. The finder must announce the find and attempt to locate the owner.","tags":["responsibility","lost-and-found-rules","identifying-marks","due-diligence-finders"]},{"id":"B","text":"A small number of coins, even if stacked, is not a sufficiently distinctive identifying mark. Many people might stack a few coins. The finder may keep them without announcement.","tags":["self-preservation","property-rights","anonymity-of-cash","insufficiently-unique-mark"]}]}
{"id":"bm-026","source":"34a-b","strength":"weak","title":"Who Receives Penalty Payment After Original Loss Reimbursed?","vignette":"A custodian (e.g., a storage facility) was responsible for an item that was stolen. The custodian already fully reimbursed the item's owner for its value. Later, the thief is caught, and under law, the thief must pay a penalty (e.g., double the item's value).","options":[{"id":"A","text":"The original owner receives the penalty payment from the thief; they were the ultimate victim of the theft.","tags":["property-rights","victim-s-rights","punitive-damages-to-owner","original-loss-bearer"]},{"id":"B","text":"The custodian who paid reimbursement receives the penalty payment; they are now the party who suffered the net financial loss and effectively took over the claim.","tags":["responsibility","subrogation","bailee-s-recovery-rights","post-reimbursement-claimant"]}]}
{"id":"bm-027","source":"36a","strength":"weak","title":"Custodian Transfers Deposited Item to Another Custodian Without Permission","vignette":"An unpaid volunteer custodian, who agreed to safeguard an item, silently hands it over for safekeeping to another person (a new custodian) without the owner's knowledge or consent. The item is then lost or damaged while with the new custodian.","options":[{"id":"A","text":"The original custodian is liable for the loss; they breached the terms of the original agreement by transferring the item without authorization.","tags":["responsibility","breach-of-bailment","unauthorized-delegation","strict-liability-for-deviation"]},{"id":"B","text":"The new custodian is liable (if negligent); once they accepted custody, they assumed responsibility. The original custodian is off the hook if they chose the new one with reasonable care.","tags":["property-rights","novation-of-responsibility","liability-follows-custody","due-care-in-transfer"]}]}
{"id":"bm-028","source":"48b-49a","strength":"okay","title":"Validity of Earnest Money Forfeiture Clause","vignette":"A buyer makes a 20% non-refundable deposit ("earnest money") on a purchase, with a contractual clause stating that if they back out of the deal for any reason, this deposit is forfeited to the seller.","options":[{"id":"A","text":"The forfeiture clause is valid and enforceable; the deposit is lost if the buyer retracts. This compensates the seller for the broken deal and opportunity cost.","tags":["responsibility","property-rights","contract-law","liquidated-damages","forfeiture-clause"]},{"id":"B","text":"The forfeiture clause might be void or subject to review as a penalty. The seller may only be entitled to actual damages proven, not the entire deposit if it's disproportionate to the loss. (Based on "asmakhta" - over-optimistic pledge).","tags":["reciprocity","consumer-protection","penalty-clause-unenforceable","actual-damages-vs-penalty"]}]}
{"id":"bm-029","source":"76a-77a","strength":"okay","title":"Who Can Withdraw First from a Daily Work Agreement?","vignette":"At 7:00 AM, a group of freelance workers and a hiring manager verbally agree on a specific scope of work for the day at a set rate. By 7:10 AM, before work has substantially begun, both the workers and the manager have independently found slightly better opportunities elsewhere (workers found a higher-paying gig, manager found cheaper workers).","options":[{"id":"A","text":"The workers may withdraw from the agreement without penalty; their flexibility and reliance on daily income give them more leeway to switch for a better immediate offer.","tags":["worker-dignity","labor-flexibility","at-will-employment-analogy","opportunity-cost-workers"]},{"id":"B","text":"The hiring manager's commitment to the project and potential loss from delay is greater; the workers must stay or compensate the manager for finding replacements if they leave.","tags":["responsibility","employer-s-reliance","contractual-obligation","mitigation-of-employer-loss"]}]}
{"id":"bm-030","source":"70b-71a","strength":"okay","title":"Investment Model Guaranteeing Principal with Profit Share","vignette":"An investor provides capital to an entrepreneur for a business venture. The agreement states that the investor's principal capital is guaranteed against loss (to be repaid by the entrepreneur if the business fails), and the investor will also receive a significant share of any profits. This is known as an "iron-sheep" or "iron-flock" investment.","options":[{"id":"A","text":"This arrangement should be treated as a form of hidden interest if the entrepreneur bears all the risk of loss for the principal. It is a prohibited type of loan.","tags":["responsibility","usury-laws","risk-sharing-requirement","substance-over-form-investment"]},{"id":"B","text":"Allowed if the business has genuine potential for profit and the profit share is not a mere subterfuge for a fixed interest rate. The "guarantee" might be seen as a strong collateralization or personal surety by the entrepreneur.","tags":["property-rights","investment-models","entrepreneurial-risk","profit-sharing-agreements"]}]}
{"id":"bm-031","source":"79a-b","strength":"weak","title":"Deviation from Agreed Route for Hired Transport","vignette":"Someone hires a van and driver to transport goods via a specific agreed-upon main highway. The driver detours via a shorter but notoriously rougher backroad to save time, and some goods are damaged due to vibrations.","options":[{"id":"A","text":"Any unauthorized deviation from the agreed route that leads to damage is negligence; the hirer/driver is liable.","tags":["responsibility","breach-of-contract","deviation-from-instructions","standard-of-care-transport"]},{"id":"B","text":"Liability only if the new path was objectively and significantly rougher AND the damage can be directly attributed to that roughness, not some other factor like poor packing.","tags":["property-rights","proof-of-causation","material-breach-assessment","objective-risk-increase"]}]}
