{"id": "bb-001", "source": "Bava Batra 2a", "strength": "okay", "title": "Mature Tree Shading Neighbor's Solar Panels", "vignette": "A large, mature tree on one property casts a significant shadow over a neighbor's newly installed solar panel array, reducing its efficiency.", "options": [{"id": "A", "text": "The tree owner must trim or remove the tree if it substantially obstructs the panels; shading that significantly reduces energy generation is a form of damage.", "tags": ["responsibility", "property-rights", "environmental-stewardship"]}, {"id": "B", "text": "The tree may stand; the neighbor should have positioned their solar panels to account for existing mature trees. Buyer beware.", "tags": ["property-rights", "prudence"]}]}
{"id": "bb-002", "source": "5a-b", "strength": "prime", "title": "Neighbor's Bid on Adjoining Property", "vignette": "An individual is selling a vacant lot. Their direct neighbor, whose property adjoins the lot, makes an offer to purchase it that matches an offer from an external buyer.", "options": [{"id": "A", "text": "The sale to the external buyer should be paused or annulled in favor of the neighbor's matching offer to promote community cohesion.", "tags": ["reciprocity", "collective-responsibility", "fairness"]}, {"id": "B", "text": "The external buyer keeps the property; an open market transaction should not be voided by a neighbor's later matching offer.", "tags": ["property-rights", "rule-of-law", "fairness"]}]}
{"id": "bb-003", "source": "8a", "strength": "okay", "title": "Intense Odors from Shared Property Area", "vignette": "One resident in a co-housing community sets up a large-scale composting system or a heavy-use barbecue smoker in a shared courtyard; the strong odor frequently annoys other residents.", "options": [{"id": "A", "text": "Allowed; a common area can be used for any activity that is customary for residential living in that city, even if some find it mildly annoying.", "tags": ["property-rights", "personal-agency", "tradition"]}, {"id": "B", "text": "Ban uses that create noxious or pervasive odors without unanimous consent of all residents sharing the space.", "tags": ["responsibility", "reciprocity", "public-safety", "compassion"]}]}
{"id": "bb-004", "source": "12b", "strength": "prime", "title": "Easement for Access to Landlocked Property", "vignette": "The owner of a landlocked parcel of land demands a path or driveway across an adjacent property (owned by someone else) to reach a public road.", "options": [{"id": "A", "text": "The adjacent property owner must grant an easement (right of way) for fair market compensation. Access is essential.", "tags": ["reciprocity", "property-rights", "fairness"]}, {"id": "B", "text": "No forced passage or easement; the landlocked owner must negotiate to purchase a strip of land for access outright, or they remain landlocked if no agreement.", "tags": ["property-rights", "personal-agency"]}]}
{"id": "bb-005", "source": "14a", "strength": "weak", "title": "Boundary Markers: Temporary vs. Permanent", "vignette": "The boundary markers between two large rural properties were temporary stakes (e.g., wooden posts) rather than permanent installations (e.g., concrete monuments, iron rods). One owner accuses the other of shifting the boundary.", "options": [{"id": "A", "text": "The owner who placed the temporary stakes is fully liable if the boundary is found to be incorrect; temporary markers, if agreed upon, are still legally binding.", "tags": ["responsibility", "property-rights", "rule-of-law"]}, {"id": "B", "text": "Partial liability or shared cost for resurvey; using flimsy or easily moved markers invites confusion and disputes. Both share some blame for not ensuring permanent marking.", "tags": ["reciprocity", "responsibility", "fairness"]}]}
{"id": "bb-006", "source": "16a", "strength": "okay", "title": "Leaning Shared Fence Between Properties", "vignette": "An old fence separating two residential yards is leaning significantly into one neighbor's property and risks collapsing.", "options": [{"id": "A", "text": "Both property owners should share the repair or replacement cost equally, as the fence benefits both properties.", "tags": ["reciprocity", "responsibility", "fairness"]}, {"id": "B", "text": "The owner of the property into which the fence is leaning (or from whose side the problem originates, if determinable) should bear the entire repair cost.", "tags": ["responsibility", "property-rights"]}]}
{"id": "bb-007", "source": "20b", "strength": "prime", "title": "New Well Potentially Affecting Neighbor's Existing Well", "vignette": "A property owner plans to drill a new water well very close to their neighbor's existing, productive well. The neighbor is concerned the new well will deplete their water supply or affect its quality.", "options": [{"id": "A", "text": "Must maintain a legally specified minimum distance from the existing well to prevent interference.", "tags": ["responsibility", "property-rights", "environmental-stewardship", "rule-of-law"]}, {"id": "B", "text": "May dig anywhere on one's own land; groundwater access is a property right, and the neighbor can also drill deeper if needed.", "tags": ["property-rights", "utilitarian", "personal-agency"]}]}
{"id": "bb-008", "source": "23a", "strength": "okay", "title": "Opening a High-Traffic Business in a Quiet Residential Cul-de-Sac", "vignette": "A resident in a quiet residential cul-de-sac converts their garage into a client-facing business (e.g., a popular music school, a busy courier dispatch), leading to a significant increase in traffic, parking issues, and noise. Neighbors complain.", "options": [{"id": "A", "text": "Block the business operation; residents have a right to veto commercial activities that significantly disrupt the residential character and peace of their immediate vicinity.", "tags": ["privacy", "responsibility", "public-safety", "collective-responsibility"]}, {"id": "B", "text": "Economic activity should be allowed unless it causes proven, direct physical damage or violates specific noise ordinances. Increased traffic alone is not sufficient to block.", "tags": ["property-rights", "personal-agency", "due-process"]}]}
{"id": "bb-009", "source": "24b", "strength": "okay", "title": "New Upper-Story Windows Overlooking Neighbor's Private Deck", "vignette": "A homeowner adds second-story windows or a balcony that directly overlooks a neighbor's previously private rooftop deck or backyard patio.", "options": [{"id": "A", "text": "The higher floor construction is permissible without consent as long as it meets building codes; views from different eye-lines are a normal part of urban living.", "tags": ["property-rights", "public-safety"]}, {"id": "B", "text": "Any new construction that creates a direct, intrusive view into a neighbor's established private outdoor space requires mitigation (e.g., frosted glass, screening) or the neighbor may object.", "tags": ["privacy", "responsibility"]}]}
{"id": "bb-010", "source": "27b", "strength": "okay", "title": "Dividing a Co-owned, Unique, Indivisible Asset", "vignette": "Two heirs jointly inherit a single, extremely valuable and unique asset (e.g., a famous painting, a rare collectible car, a master recording). One heir wants to physically divide it (if theoretically possible, e.g. cutting a manuscript) to take their share.", "options": [{"id": "A", "text": "Physically divide if possible, so each heir receives their tangible portion of the property.", "tags": ["property-rights", "personal-agency", "fairness"]}, {"id": "B", "text": "Sell the asset as a whole and split the proceeds, or one heir buys out the other; physical division would destroy its unique value or integrity.", "tags": ["responsibility", "reciprocity", "prudence", "utilitarian"]}]}
{"id": "bb-011", "source": "29a", "strength": "weak", "title": "Deathbed Gift vs. Standard Inheritance Rules", "vignette": "A dying parent makes a formal written deed gifting a significant asset (e.g., the family home) to a younger child. After the parent's death, an older child, who would normally receive a larger share under standard inheritance law, contests the deed.", "options": [{"id": "A", "text": "The deed stands; a clear, witnessed gift made while competent, even on a deathbed, overrides standard inheritance distribution rules for that specific asset.", "tags": ["property-rights", "integrity", "personal-agency"]}, {"id": "B", "text": "The standard inheritance rules take precedence for calculating distribution of the overall estate; the deathbed gift might be considered an advance or be subject to clawback if it unfairly disadvantages other heirs with legal claims.", "tags": ["reciprocity", "rule-of-law", "fairness"]}]}
{"id": "bb-012", "source": "32a", "strength": "weak", "title": "Found Contract with Unexplained Blank Spaces", "vignette": "A signed business contract is found, but it contains several skipped lines or blank spaces in critical sections that could potentially be filled in later to alter terms.", "options": [{"id": "A", "text": "Invalidate the contract, or require affirmation from all parties; the gaps create too much uncertainty and risk of fraudulent alteration.", "tags": ["responsibility", "rule-of-law", "integrity"]}, {"id": "B", "text": "Accept the contract as valid if signatures and key terms are present and appear legitimate; assume the spaces are irrelevant or were intentionally left blank.", "tags": ["property-rights", "due-process", "utilitarian"]}]}
{"id": "bb-013", "source": "34b", "strength": "prime", "title": "Protesting Unfair Taxation Methods", "vignette": "A local government imposes a flat per-household service fee for a new public utility. Wealthier residents can easily afford it, while lower-income residents protest that it forms a much larger and unfair percentage of their income. The wealthier residents refuse to support a wealth-tiered fee.", "options": [{"id": "A", "text": "The flat per-household fee stands; it's simple to administer and treats every household as a single unit.", "tags": ["property-rights", "simplification", "fairness"]}, {"id": "B", "text": "Implement a fee based on property value or income tiers; the financial burden for public services must be proportional to ability to pay.", "tags": ["reciprocity", "fairness", "compassion"]}]}
{"id": "bb-014", "source": "36b", "strength": "weak", "title": "Storefront Awning Extending Over Public Sidewalk", "vignette": "A shop owner builds an awning that extends several feet over the public sidewalk, providing shelter for pedestrians but also potentially encroaching on public airspace or municipal codes.", "options": [{"id": "A", "text": "The city may demand removal or modification if it violates codes or obstructs public right-of-way, even if it offers some public benefit.", "tags": ["responsibility", "rule-of-law", "public-safety"]}, {"id": "B", "text": "Allowed if it meets a minimum safe height clearance and there's a precedent of similar structures being tolerated; enhances pedestrian experience.", "tags": ["property-rights", "tradition", "utilitarian"]}]}
{"id": "bb-015", "source": "42a", "strength": "prime", "title": "Guardian Investing a Ward's Funds in a Risky Venture", "vignette": "A trustee managing funds for a minor or incapacitated person (their ward) considers investing a portion of these funds in a high-risk, high-return venture (e.g., a tech startup, speculative real estate).", "options": [{"id": "A", "text": "Invest only in very low-risk, stable assets (e.g., government bonds, insured deposits); the primary duty is to preserve the principal.", "tags": ["responsibility", "prudence"]}, {"id": "B", "text": "Permissible if the guardian personally guarantees to cover any potential loss from the risky investment, and the potential upside for the ward is significant.", "tags": ["reciprocity", "utilitarian", "personal-agency"]}]}
{"id": "bb-016", "source": "44b", "strength": "weak", "title": "Who Pays for Contract Drafting Fees?", "vignette": "In a private sale of a significant asset (e.g., a car, a boat), the seller drafts the sales agreement. The buyer, after agreeing to the terms, refuses to split the fee charged by the lawyer or notary for drafting the document.", "options": [{"id": "A", "text": "The costs should primarily be on the buyer; they are the one receiving title and benefit most from a clear, legally sound document.", "tags": ["responsibility", "fairness"]}, {"id": "B", "text": "Both parties should split the fee equally; both need a valid document to protect their interests and finalize the transaction.", "tags": ["reciprocity", "fairness"]}]}
{"id": "bb-017", "source": "47a", "strength": "weak", "title": "Minor Discrepancy in Land Sale Measurement", "vignette": "A large plot of land is sold as \"100 acres, more or less.\" A later survey reveals it is actually 101 acres (or 99 acres).", "options": [{"id": "A", "text": "The buyer must pay for the extra acre (or be refunded for the missing acre) at a proportionate price. Precision is required.", "tags": ["responsibility", "reciprocity", "integrity", "fairness"]}, {"id": "B", "text": "Such a minor surplus or deficit is forgiven under market custom for \"more or less\" sales; the original price stands.", "tags": ["property-rights", "simplification", "rule-of-law"]}]}
{"id": "bb-018", "source": "49a", "strength": "okay", "title": "Excavating a Tunnel Beneath a Neighbor's Property", "vignette": "A property owner wants to excavate a tunnel (e.g., for utilities, a private passage, resource extraction) that will pass beneath an adjacent residential property.", "options": [{"id": "A", "text": "Digging beneath another's property is forbidden without explicit permission, as it may undermine structural support or infringe on subterranean rights.", "tags": ["responsibility", "property-rights", "public-safety"]}, {"id": "B", "text": "Allowed if the tunnel is significantly deep (e.g., below 50 feet or a depth unlikely to cause any surface impact) and causes no realistic damage or interference.", "tags": ["property-rights", "simplification", "utilitarian"]}]}
{"id": "bb-019", "source": "51a", "strength": "okay", "title": "Rental Property Becomes Uninhabitable Mid-Lease", "vignette": "A tenant prepays rent for a full year on a house. Six months into the lease, the house becomes uninhabitable due to a sudden, major issue not caused by the tenant (e.g., roof collapse from a storm, severe plumbing failure).", "options": [{"id": "A", "text": "The landlord must refund the rent for the remaining period during which the tenant cannot occupy the property; the landlord failed to provide a habitable dwelling.", "tags": ["property-rights", "responsibility", "rule-of-law"]}, {"id": "B", "text": "The contract stands; the collapse was an unforeseen accident (act of God). The tenant bears the loss of unusable prepaid rent unless the lease specifies otherwise.", "tags": ["property-rights", "prudence", "rule-of-law"]}]}
{"id": "bb-020", "source": "55b", "strength": "weak", "title": "Interpreting \"House and Its Contents\" in a Sale", "vignette": "A real estate sale contract states that the sale includes the \"house and everything inside it\" or \"house and all its contents.\" Does this phrasing legally require the seller to include all movable personal property (furniture, appliances not bolted down, decorations) or only items physically attached to the structure (fixtures)?", "options": [{"id": "A", "text": "Movables are included unless specifically itemized as excluded in the contract. \"Everything inside\" means everything.", "tags": ["responsibility", "rule-of-law", "fairness"]}, {"id": "B", "text": "The phrase typically refers only to fixtures and items integral to the house; personal movable property is separate unless explicitly itemized as included.", "tags": ["property-rights", "tradition", "rule-of-law"]}]}
{"id": "bb-021", "source": "60b", "strength": "okay", "title": "Noisy Hobby vs. Neighbor's Peace and Quiet", "vignette": "One resident in a quiet neighborhood sets up a large aviary for doves or parrots; the constant cooing and screeching disturbs the immediate neighbors' ability to enjoy their property peacefully.", "options": [{"id": "A", "text": "Allowed; these are normal sounds associated with keeping pets or enjoying a hobby, within reasonable hours.", "tags": ["property-rights", "personal-agency", "fairness"]}, {"id": "B", "text": "May bar new, persistently noisy installations if they are within a certain proximity and demonstrably reduce neighbors' quality of life or sleep.", "tags": ["privacy", "responsibility", "public-safety"]}]}
{"id": "bb-022", "source": "63b", "strength": "prime", "title": "Planting Hazardous Plants Along a Path Used by Others", "vignette": "A landowner plants thorny bushes or toxic plants along a private path on their property that is nonetheless known to be occasionally used by others (e.g., hikers, local children taking a shortcut) with or without explicit permission. Someone using the path is injured by these plants.", "options": [{"id": "A", "text": "The landowner is liable for injuries caused by hazards they introduced, especially if they were aware the path was sometimes used by others. Must remove or warn.", "tags": ["responsibility", "prudence", "public-safety"]}, {"id": "B", "text": "Not liable; individuals using a private path without explicit, formal permission do so at their own risk. The landowner has no duty to make it safe for trespassers or informal users.", "tags": ["self-preservation", "property-rights", "personal-agency"]}]}
{"id": "bb-023", "source": "65b", "strength": "weak", "title": "Found Treasure on Leased Property", "vignette": "A tenant, while ploughing a field they lease from a landlord, unearths a container of ancient gold coins or other valuables.", "options": [{"id": "A", "text": "The treasure should be split between the tenant and the landlord; the tenant found it through their labor, but the land belongs to the landlord.", "tags": ["reciprocity", "property-rights", "fairness"]}, {"id": "B", "text": "The treasure belongs entirely to the landlord; it was found embedded in their soil and is part of the land's intrinsic value.", "tags": ["property-rights", "rule-of-law"]}]}
{"id": "bb-024", "source": "77a", "strength": "weak", "title": "Duplicate Versions of a Contract, One Registered First", "vignette": "Due to a clerical error, a client signs two identical versions of a contract (e.g., a mortgage, a lease). The counterparty receives both and registers one with the relevant authority immediately. Later, a dispute arises based on the (still identical) unregistered copy.", "options": [{"id": "A", "text": "The earlier registered version of the contract is the controlling legal document; the other identical but unregistered copy is effectively void or secondary.", "tags": ["property-rights", "rule-of-law"]}, {"id": "B", "text": "The error of duplication and potential for confusion taints both documents; the parties should affirm the terms or re-issue a single, clearly designated authoritative contract.", "tags": ["responsibility", "integrity", "rule-of-law"]}]}
{"id": "bb-025", "source": "85a", "strength": "weak", "title": "Retracting a Verbal Promise for a Significant Gift", "vignette": "An individual verbally promises a significant gift (e.g., a piece of land, a sum of money) to a relative or friend. Before any formal written agreement is signed or the gift is transferred, the promisor changes their mind and wishes to retract the promise.", "options": [{"id": "A", "text": "Mere words are not legally binding for such gifts; the promisor may retract their verbal promise without legal consequence.", "tags": ["property-rights", "rule-of-law", "personal-agency"]}, {"id": "B", "text": "There is a strong moral obligation to honor the promise, especially if the recipient made plans based on it. Retraction is unethical.", "tags": ["responsibility", "altruism", "fairness", "integrity"]}]}
{"id": "bb-026", "source": "92b", "strength": "prime", "title": "Using Stolen High-Value Component in a Major Construction", "vignette": "A builder knowingly uses a high-value, stolen major component (e.g., a custom-fabricated steel beam, a unique historic artifact) in the construction of a new luxury building, where removing it would require significant demolition and cost.", "options": [{"id": "A", "text": "The original owner of the component may demand its removal and return, even if it requires partial demolition of the building. Full restitution of property.", "tags": ["property-rights", "responsibility", "retribution"]}, {"id": "B", "text": "The builder must pay the full current market value (or replacement cost plus damages) of the component to the original owner, but the component stays in place to avoid greater economic waste.", "tags": ["reciprocity", "utilitarian", "fairness"]}]}
{"id": "bb-027", "source": "95a", "strength": "okay", "title": "Craftsperson Adds Unauthorized but Valuable Improvement", "vignette": "A client gives raw materials (e.g., plain clay, basic fabric) to a craftsperson for a specific commissioned work (e.g., simple pots, basic garment). The craftsperson, without authorization, adds a costly personal touch (e.g., a unique glaze, intricate embroidery) that significantly increases the item's market value.", "options": [{"id": "A", "text": "The client pays only the originally agreed-upon wage for the commissioned work; the unauthorized improvement is considered a voluntary addition by the craftsperson.", "tags": ["property-rights", "rule-of-law", "fairness"]}, {"id": "B", "text": "The client must pay for the added value of the improvement, or fairly compensate the craftsperson for their extra materials and labor, if they accept the improved item.", "tags": ["worker-dignity", "fairness", "reciprocity"]}]}
{"id": "bb-028", "source": "98a", "strength": "prime", "title": "Guardian Sells Ward's Asset Which Later Skyrockets in Value", "vignette": "A guardian, acting in good faith and with proper authority at the time, sells an asset (e.g., land, stocks) belonging to their minor ward to cover the ward's necessary expenses. Years later, after the ward reaches adulthood, the sold asset has massively increased in value.", "options": [{"id": "A", "text": "The sale stands; the guardian acted prudently and legally based on the circumstances and information available at the time of sale.", "tags": ["responsibility", "prudence", "rule-of-law"]}, {"id": "B", "text": "The now-adult ward may have grounds to void the sale or seek additional compensation, especially if the sale price was merely adequate at the time but not demonstrably excellent, given the lost future potential.", "tags": ["parental-responsibility", "property-rights", "fairness"]}]}
{"id": "bb-029", "source": "101b", "strength": "okay", "title": "Dividing Jointly Owned Land of Unequal Quality", "vignette": "Two partners are dissolving a partnership and need to divide a jointly owned large parcel of land. One side of the parcel is significantly more fertile or has better water access than the other.", "options": [{"id": "A", "text": "Divide the acreage numerically in half, regardless of the quality disparity. Each gets an equal area.", "tags": ["property-rights", "fairness", "simplification"]}, {"id": "B", "text": "Adjust the acreage so each partner receives a portion of roughly equal market value, or one partner compensates the other to equalize the value if exact physical division by value is impossible.", "tags": ["reciprocity", "fairness", "utilitarian"]}]}
{"id": "bb-030", "source": "108b", "strength": "weak", "title": "Selling an Expected Inheritance", "vignette": "An adult child, who expects to receive a significant inheritance from their still-living parent, sells this future inheritance to a third party. The parent then dies.", "options": [{"id": "A", "text": "The sale is void; an expected inheritance cannot be legally sold or transferred before it actually vests upon the parent's death.", "tags": ["property-rights", "rule-of-law", "family-loyalty"]}, {"id": "B", "text": "The sale is valid; the right to the future inheritance, though contingent, was a transferable expectancy. The buyer now claims that share of the estate.", "tags": ["property-rights", "personal-agency", "fairness"]}]}
{"id": "bb-031", "source": "Bava Batra 32b", "strength": "prime", "title": "Conflicting Deeds for the Same Property Issued at Different Times", "vignette": "An elderly property owner gifts their orchard to Cousin A in a valid deed signed and dated in April. In May, perhaps forgetfully or changing their mind, they issue another valid deed for the same orchard to Cousin B. Neither cousin has yet taken physical possession. Both deeds appear legitimate.", "options": [{"id": "A", "text": "The earlier deed (April) wins; the first validly executed document transferring title controls the property rights.", "tags": ["property-rights", "rule-of-law"]}, {"id": "B", "text": "The court should apply judicial discretion to determine which cousin is more deserving or to whom the owner truly intended the property to go, possibly considering other factors beyond the deed dates.", "tags": ["reciprocity", "due-process", "fairness", "integrity"]}]}
{"id": "bb-032", "source": "Bava Batra 28a", "strength": "prime", "title": "Ownership Claim Based on Adverse Possession", "vignette": "Person L has openly farmed a piece of land belonging to Person R for three consecutive years without any challenge from R. Person L now claims ownership based on adverse possession. Person R, who was out of the country for those years, returns and demands the land back.", "options": [{"id": "A", "text": "The possessor (Person L) wins; three years of unchallenged open possession is sufficient proof of presumptive ownership.", "tags": ["property-rights", "rule-of-law", "tradition"]}, {"id": "B", "text": "The original owner (Person R) may reclaim the land; the period of unchallenged possession is only valid if the true owner was present in the region and able to protest but did not. Absence negates the presumption from possession.", "tags": ["property-rights", "rule-of-law", "fairness"]}]}
{"id": "bb-033", "source": "Bava Batra 60a", "strength": "okay", "title": "Balcony Overlooking Shared Courtyard Windows", "vignette": "A resident in an apartment complex builds a new balcony that projects outward, directly overlooking the windows of other apartments that open onto a shared internal courtyard.", "options": [{"id": "A", "text": "Neighbors whose windows are now overlooked may force the removal or alteration of the balcony to protect their privacy.", "tags": ["privacy", "responsibility", "property-rights"]}, {"id": "B", "text": "The balcony is allowed if it meets building codes and does not physically encroach on other units. Overlooking is a normal aspect of co-living.", "tags": ["property-rights", "personal-agency"]}]}
{"id": "bb-034", "source": "Bava Batra 88b", "strength": "okay", "title": "Water Damage from Upstairs Neighbor's Feature", "vignette": "An upper-story apartment resident installs a large planter box or a small decorative pool on their balcony. Due to overwatering or a small leak, water consistently seeps into the ceiling of the lower apartment, causing stains and dampness.", "options": [{"id": "A", "text": "The upper resident is liable for the damage caused by the seepage from their installation, as it represents an abnormal water load not anticipated in standard construction.", "tags": ["responsibility", "public-safety"]}, {"id": "B", "text": "Liability only if the damage exceeds what might be considered normal wear and tear or minor seepage expected in multi-story buildings, or if negligence is proven.", "tags": ["property-rights", "responsibility", "fairness"]}]}
{"id": "bb-035", "source": "Bava Batra 41a", "strength": "weak", "title": "Lost, Unsigned Financial Document Found in Public", "vignette": "An unsigned loan agreement or promissory note is found lying in a public place like a street or marketplace. Much later, someone comes forward claiming to be the intended lender, stating they must have dropped it before it could be signed by the borrower.", "options": [{"id": "A", "text": "The finder should return the note to the claimant; the circumstances suggest the claimant is likely the owner who lost it prematurely.", "tags": ["property-rights", "integrity", "trust"]}, {"id": "B", "text": "The finder may keep or discard the document; an unsigned note has no legal value or clear identifiers of ownership. The claimant's story is unproven.", "tags": ["self-preservation", "prudence", "due-process"]}]}
{"id": "bb-036", "source": "Bava Batra 52a", "strength": "okay", "title": "Selling Airspace Rights Above a Building", "vignette": "A property owner sells their single-story house along with the rights to build \"up to the sky above it.\" The buyer plans to add two more stories, which will significantly reduce sunlight to an adjacent neighbor's existing rooftop solar panels or garden.", "options": [{"id": "A", "text": "The buyer may build to any height allowed by zoning, having purchased the airspace rights. The neighbor's light is not legally protected against such vertical development.", "tags": ["property-rights", "rule-of-law"]}, {"id": "B", "text": "The neighbor may block or demand compensation for construction that newly and substantially harms their existing access to light and air, especially for established uses like solar panels. The sale of airspace doesn't automatically negate nuisance or harm.", "tags": ["responsibility", "property-rights", "public-safety", "fairness"]}]}
{"id": "bb-037", "source": "Bava Batra 75b", "strength": "okay", "title": "Dividing Inherited Plots of Unequal Value", "vignette": "Four siblings inherit four distinct parcels of land from their parent. The parcels are of different sizes and have significantly varying fertility, water access, or development potential, making their market values unequal.", "options": [{"id": "A", "text": "Appraise each parcel and allow each heir to choose or be assigned portions that result in an equal total value for each, possibly involving co-ownership of some parcels or compensatory payments.", "tags": ["reciprocity", "fairness", "utilitarian"]}, {"id": "B", "text": "Divide the parcels by drawing lots; this method is traditional, avoids appraisal costs and disputes over valuation, and treats the outcome as subject to chance or fate.", "tags": ["property-rights", "fairness", "tradition", "simplification"]}]}
{"id": "bb-038", "source": "Bava Batra 93b", "strength": "okay", "title": "Guardian's Unauthorized Expenses for Ward's Benefit", "vignette": "The guardian of a minor's agricultural estate spends their own money on necessary supplies (seeds, tools) before obtaining formal court approval for the expenditure. The subsequent harvest, thanks to these timely purchases, is very successful and benefits the estate.", "options": [{"id": "A", "text": "The guardian should be fully reimbursed for expenses and also receive a fair wage or percentage for their successful management; they acted in the estate's best interest and achieved good results.", "tags": ["worker-dignity", "fairness", "utilitarian"]}, {"id": "B", "text": "The guardian gets reimbursed only for their exact expenses; taking initiative without prior formal consent limits their claim for additional reward or wages, despite the good outcome.", "tags": ["reciprocity", "rule-of-law", "prudence"]}]}
