{"id":"bk-001","source":"2a-b","strength":"okay","title":"Autonomous Delivery Robot Causes Minor Damage – First Incident","vignette":"An autonomous delivery robot, with no prior incident history, collides at low speed with a parked car, causing a dent and scratching paint. This is the first such incident for this model of robot from the operating company.","options":[{"id":"A","text":"The robot's operating company pays half the repair cost; it was an unexpected first-time malfunction (analogous to \"tam\").","tags":["reciprocity","responsibility","emerging-technology-liability","first-incident-leniency"]},{"id":"B","text":"The company pays the full repair cost; owners/operators of autonomous machinery must ensure safety even for first-time incidents.","tags":["responsibility","property-rights","strict-liability-for-ai","public-safety"]}]}
{"id":"bk-002","source":"5a-b","strength":"okay","title":"Autonomous Vehicle Becomes a Known Hazard (Muʿad Equivalent)","vignette":"After three documented incidents of sudden, uncommanded acceleration, an autonomous vehicle model is flagged as a known hazard. Despite software patches, another such incident occurs, causing property damage.","options":[{"id":"A","text":"The vehicle's manufacturer/operator always pays full damages from this point forward for this known issue.","tags":["responsibility","strict-liability","known-defect","consumer-protection"]},{"id":"B","text":"The manufacturer/operator might still pay only partial damages if they had issued warnings to users and implemented all mandated safety measures, arguing contributory negligence or assumption of risk.","tags":["reciprocity","responsibility","shared-liability","warnings-and-mitigations"]}]}
{"id":"bk-003","source":"9a-b","strength":"okay","title":"Damage to a Pregnant Show Animal – Loss of Potential Offspring","vignette":"A prize-winning show dog, while being walked on a leash, is attacked by an off-leash dog, resulting in injuries that cause the pregnant show dog to lose its valuable, anticipated litter of puppies.","options":[{"id":"A","text":"The owner of the attacking dog pays damages for the injuries to the show dog only; the unborn puppies have no standalone legal or market value until birth.","tags":["property-rights","economic-loss-doctrine","definition-of-life-economic"]},{"id":"B","text":"Compensation must cover both the injuries to the show dog and the lost value of the potential offspring, as this was a recognized and insurable aspect of its value.","tags":["responsibility","reciprocity","loss-of-potential-value","animal-breeding-economics"]}]}
{"id":"bk-004","source":"10a","strength":"prime","title":"Automated System Causing Harm: Disparate Impact on Value","vignette":"An autonomous industrial robot malfunctions and destroys a custom, high-value piece of machinery vital for a small business. The same malfunction, if it had damaged a standard, easily replaceable tool, would have resulted in a much smaller financial loss.","options":[{"id":"A","text":"The robot's owner pays a standardized compensation amount for "damaged machinery," regardless of the specific machinery's actual market value or importance (analogous to fixed 30 shekels for a slave).","tags":["property-rights","standardized-compensation","limitation-of-liability","efficiency-in-claims"]},{"id":"B","text":"Compensation should equal the real market value of the specific machinery destroyed and consequential business losses, reflecting the actual harm done.","tags":["responsibility","reciprocity","fair-market-value-compensation","actual-damages"]}]}
{"id":"bk-005","source":"15b-16a","strength":"weak","title":"Unmarked Hole Left by Utility Workers on Sidewalk","vignette":"Utility workers dig a small hole (e.g., six inches deep for a minor repair) on a public sidewalk and leave it unmarked overnight. A pedestrian steps into it and sprains their ankle.","options":[{"id":"A","text":"Liability only if the hazard meets a certain minimum severity threshold (e.g., at least ten inches deep or posing a clear, substantial danger). Minor hazards are an accepted part of urban life.","tags":["property-rights","de-minimis-hazard","reasonable-expectation-of-safety"]},{"id":"B","text":"Any man-made hazard left in a public way that causes injury incurs liability, regardless of its precise dimensions, if not properly marked or cordoned off.","tags":["responsibility","public-safety","negligence","duty-to-warn"]}]}
{"id":"bk-006","source":"22a-b","strength":"okay","title":"Sparks from Controlled Burn Spread by Unexpected Wind","vignette":"A farmer conducts a legal, permitted agricultural burn on their property. A sudden, unusually strong gust of wind carries embers to a neighbor's unprocessed harvest, igniting it.","options":[{"id":"A","text":"The farmer is always liable for fire spreading from their property; fire is inherently dangerous (analogous to "his arrow").","tags":["responsibility","strict-liability-for-fire","inherently-dangerous-activity"]},{"id":"B","text":"If the wind was genuinely unforeseeable and unusually strong (an "act of God"), it's an unavoidable accident, and the farmer may be exempt from liability if they took all standard precautions.","tags":["property-rights","act-of-god-defense","force-majeure","standard-precautions"]}]}
{"id":"bk-007","source":"23b","strength":"weak","title":"Damage from a Portable Heat Source in Public","vignette":"A street food vendor is using a portable charcoal grill. A sudden gust of wind blows sparks from the grill, igniting the flammable awning of an adjacent market stall.","options":[{"id":"A","text":"The vendor is liable; they should have used better shielding or ceased operation in windy conditions when using an open flame in a crowded public area.","tags":["responsibility","duty-of-care-public-space","foreseeable-risk"]},{"id":"B","text":"The stall owner is partly at fault for using a highly flammable awning material in close proximity to other street activities, including food vendors using heat. Shared responsibility.","tags":["reciprocity","contributory-negligence","assumption-of-risk-urban-setting"]}]}
{"id":"bk-008","source":"24b-25a","strength":"weak","title":"Complex Chain Reaction of Damage","vignette":"A negligently parked delivery drone rolls down a hill, causing a startled autonomous lawnmower to swerve and knock over a security camera, which then falls and smashes a valuable garden gnome.","options":[{"id":"A","text":"The drone owner pays for all resulting damages—the drone's initial negligence set the entire chain of events in motion.","tags":["responsibility","proximate-cause","foreseeable-chain-of-events","but-for-causation"]},{"id":"B","text":"Liability stops after the first or second direct consequence (e.g., the lawnmower swerving or hitting the camera). The gnome's demise is too remote.","tags":["property-rights","remoteness-of-damage","intervening-causes","limitation-of-liability"]}]}
{"id":"bk-009","source":"26a","strength":"prime","title":"Injury Caused by Distracted Individual","vignette":"While engrossed in their smartphone, a pedestrian bumps into another person who falls and breaks their arm.","options":[{"id":"A","text":"The distracted pedestrian is liable even if the bumping was purely accidental and not malicious; people have a duty to be aware of their surroundings and foresee potential hazards of their inattention.","tags":["responsibility","negligence","duty-of-care-pedestrian","foreseeable-harm"]},{"id":"B","text":"True accidents with no proven negligence (e.g., if the other person also wasn't paying attention or the bump was minor and the fall freakish) should exempt from liability.","tags":["property-rights","pure-accident-defense","comparative-negligence","proof-of-negligence"]}]}
{"id":"bk-010","source":"27b","strength":"okay","title":"Compensation for Personal Injury","vignette":"An assailant intentionally injures a victim's leg during an altercation, resulting in medical bills, time off work, physical pain, and public humiliation.","options":[{"id":"A","text":"The assailant must pay for all categories of harm: direct financial losses (medical, lost wages), physical suffering (pain), and intangible harms (emotional distress, reputational damage/shame).","tags":["responsibility","full-compensation","pain-and-suffering","restitutive-justice"]},{"id":"B","text":"The assailant is only liable for direct, quantifiable monetary losses (medical costs, lost wages). Other harms like pain or shame are moral issues, not subject to monetary compensation in this system.","tags":["property-rights","limited-liability","quantifiable-damages-only","economic-restitution"]}]}
{"id":"bk-011","source":"28b","strength":"okay","title":"Causing Embarrassment to Close Family Members","vignette":"During a heated argument, someone carelessly (but not maliciously) causes a minor physical injury (e.g., a visible bruise) to their parent or a highly respected elder in their family.","options":[{"id":"A","text":"The same compensation principles (e.g., for medical treatment, any missed work, perhaps minor pain) apply as if the injury were to a stranger.","tags":["responsibility","equality-before-the-law","objective-damages"]},{"id":"B","text":"An additional penalty or higher compensation should be considered; harming a close family member, especially a parent, involves an added dimension of disrespect or emotional harm beyond the physical injury.","tags":["responsibility","aggravated-damages","breach-of-familial-trust","emotional-harm"]}]}
{"id":"bk-012","source":"32a","strength":"okay","title":"Liability of False Witnesses for Attempted Harm","vignette":"Two individuals conspire to give false testimony in court, claiming that Person L owes their associate $100,000. Their perjury is discovered before Person L pays.","options":[{"id":"A","text":"When caught, the false witnesses must pay Person L the full amount they sought to fraudulently extract ($100,000) as a penalty and compensation for the attempted harm and legal costs.","tags":["responsibility","deterrence-of-perjury","lex-talionis-for-false-witness","restitutive-and-punitive-damages"]},{"id":"B","text":"The false witnesses should only be subject to criminal penalties for perjury (e.g., fines paid to the state, jail time); no private monetary compensation is due to Person L since no money was actually lost by them.","tags":["property-rights","criminal-vs-civil-liability","no-harm-no-foul-monetary","state-enforced-penalties"]}]}
{"id":"bk-013","source":"36b-37a","strength":"weak","title":"Penalty for Theft and Resale of Goods","vignette":"A thief steals valuable items (e.g., electronics, jewelry) from a retailer and then sells them online.","options":[{"id":"A","text":"The thief, if caught, must pay a multiple (e.g., four or five times) of the items' value as a punitive measure for both stealing and trafficking in stolen goods.","tags":["responsibility","punitive-damages","deterrence-of-theft-and-fencing","enhanced-penalty-for-trafficking"]},{"id":"B","text":"A standard double payment (kefel equivalent, i.e., value of goods + equal penalty) suffices; the higher multiple should only apply if the thief had destroyed or fundamentally altered the goods (analogous to slaughtering an animal).","tags":["reciprocity","proportional-penalty","distinction-in-thief-s-actions"]}]}
{"id":"bk-014","source":"43a","strength":"weak","title":"Misusing Borrowed Equipment Against Instructions","vignette":"Someone borrows a specialized, sensitive piece of equipment (e.g., a professional camera) and is explicitly told by the owner not to use it in freezing temperatures. The borrower uses it on a ski trip, and it malfunctions due to the cold.","options":[{"id":"A","text":"The borrower is liable for repairs or replacement; they ignored explicit instructions and exposed the equipment to known risk.","tags":["responsibility","breach-of-bailment-terms","negligence","disregard-of-warning"]},{"id":"B","text":"If the malfunction could also be attributed to an unexpected defect or extreme weather beyond normal freezing (an "act of God"), the borrower might be partially or fully exempt.","tags":["property-rights","act-of-god-defense","shared-risk","unforeseeable-circumstance"]}]}
{"id":"bk-015","source":"45b","strength":"okay","title":"Open Robbery vs. Stealthy Theft: Difference in Liability?","vignette":"An individual openly confronts someone on the street and forcibly snatches their laptop.","options":[{"id":"A","text":"The robber owes restitution for the laptop plus additional damages for the trauma and intimidation caused by the use of force or threat.","tags":["responsibility","aggravated-offense","compensation-for-fear","violent-vs-non-violent-crime"]},{"id":"B","text":"The monetary liability is the same as for someone who steals a laptop covertly (e.g., a pickpocket); the method of theft (force vs. stealth) only affects criminal penalties, not civil compensation to the victim.","tags":["reciprocity","equality-of-loss-value","focus-on-property-restitution"]}]}
{"id":"bk-016","source":"53a","strength":"okay","title":"Using Stolen Minor Components in a Public Project","vignette":"Low-value, generic building materials (e.g., common bricks, standard lumber) are stolen from a supplier and then used by a contractor in the construction of a small public amenity, like a park bench or a bus shelter.","options":[{"id":"A","text":"The public entity or contractor must arrange for the removal of the specific stolen materials and their return to the owner, even if it means dismantling the structure.","tags":["responsibility","absolute-property-rights","no-use-of-stolen-goods","deterrence"]},{"id":"B","text":"The contractor or public entity must pay the supplier the value of the stolen materials; tearing down a useful public structure for low-value generic components is economically wasteful.","tags":["reciprocity","property-rights","economic-efficiency","practical-restitution","de-minimis-components"]}]}
{"id":"bk-017","source":"55b","strength":"weak","title":"Cultivating Unused Private Land Without Permission","vignette":"A person, without permission, cultivates a vacant, neglected plot of private land with a food crop (e.g., vegetables). The crop grows successfully. The landowner discovers this at harvest time.","options":[{"id":"A","text":"The landowner keeps the entire crop but must reimburse the cultivator for their actual expenses (seeds, fertilizer). The land is theirs.","tags":["reciprocity","property-rights","unjust-enrichment-landowner","reimbursement-for-inputs"]},{"id":"B","text":"The cultivator keeps the crop but must pay fair market rent to the landowner for the use of the land during that season.","tags":["self-preservation","reciprocity","sweat-equity","fair-rent-for-use"]}]}
{"id":"bk-018","source":"58a","strength":"weak","title":"Unauthorized Use of Property Without Causing Loss to Owner","vignette":"A person, without permission, temporarily stays in a vacant vacation home or uses an empty office space belonging to someone else, without consuming utilities or causing any damage. The owner discovers this and claims compensation for the unauthorized use.","options":[{"id":"A","text":"No compensation is due if the owner suffered no actual financial loss or damage from the temporary, non-damaging use.","tags":["self-preservation","no-harm-no-foul","tangible-loss-required"]},{"id":"B","text":"Any unauthorized benefit derived from using another's property requires fair payment (e.g., equivalent rental value for the period), even if the owner did not suffer a measurable loss from that specific use.","tags":["responsibility","reciprocity","unjust-enrichment-user","constructive-rent"]}]}
{"id":"bk-019","source":"66a-b","strength":"weak","title":"Accidental Damage from an Item Falling from Pocket","vignette":"A small, dense item (like a multi-tool or a large set of keys) accidentally falls out of someone's pocket while they are walking, cracking a glass pane in a low shop window or a car windshield.","options":[{"id":"A","text":"Liable for the damage; individuals have a responsibility to secure personal items that could cause harm if dropped.","tags":["responsibility","negligence","duty-of-care-personal-belongings"]},{"id":"B","text":"Exempt if the item falling was a pure accident and not due to negligence (e.g., a faulty pocket seam suddenly giving way without prior warning).","tags":["property-rights","pure-accident","no-negligence-defense"]}]}
{"id":"bk-020","source":"69b","strength":"okay","title":"Hazard Created by One Partner on Jointly Owned Property","vignette":"Two business partners jointly own an office space. One partner, without consulting the other, has a deep, unmarked trench dug in a common area for a new utility line. The other partner's employee, unaware of the trench, falls in and is injured.","options":[{"id":"A","text":"The partner who had the trench dug is solely liable for the injury; they created a hazard on joint property without ensuring proper consent or safety measures.","tags":["responsibility","negligence","duty-to-warn-partner","unilateral-action-risk"]},{"id":"B","text":"The partnership itself (both partners) is liable, or liability is shared; the property is jointly owned, and both share ultimate responsibility for safety on the premises, regardless of who directly caused the hazard.","tags":["reciprocity","joint-and-several-liability","shared-ownership-duties"]}]}
{"id":"bk-021","source":"72b","strength":"okay","title":"Damage Caused by an Animal Startled by a Third Party","vignette":"A person is calmly riding a horse on a public trail. A mischievous child suddenly jumps out from behind a bush, shouting and waving their arms, causing the horse to bolt and knock over another hiker, injuring them.","options":[{"id":"A","text":"The horse owner is still primarily liable; they are responsible for controlling their animal in public, regardless of common distractions.","tags":["responsibility","strict-liability-for-animals","animal-control"]},{"id":"B","text":"The child (or their parents) shares significant liability for provoking the animal and causing the incident. The horse owner's liability may be reduced.","tags":["reciprocity","contributory-negligence","third-party-causation","provocation"]}]}
{"id":"bk-022","source":"74a","strength":"weak","title":"Pet Animal Causes Fire with Unforeseeable Action","vignette":"A pet dog, left alone but secured in a yard, manages to grab a piece of smoldering BBQ dropped by a passerby near the fence. It drags the ember into a shed containing flammable materials, starting a fire.","options":[{"id":"A","text":"The dog's owner is fully liable for the fire damage; the risk of a pet interacting with external items and causing damage is foreseeable. Secure pets more thoroughly.","tags":["responsibility","foreseeable-risk-pets","duty-to-prevent-pet-damage"]},{"id":"B","text":"The owner pays reduced damages (e.g., half); while a pet can cause damage, this specific chain of events (external ember, dragging to flammables) is highly unusual and less directly foreseeable. (Analogous to compound damage).","tags":["reciprocity","property-rights","unforeseeable-consequence-chain","mitigated-liability"]}]}
{"id":"bk-023","source":"77a","strength":"okay","title":"Obstruction Left in Public Thoroughfare by Contractors","vignette":"A construction crew working on a city street leaves a pile of building materials or equipment partially obstructing the sidewalk or bike lane overnight, without proper warning lights or barriers. A cyclist hits the obstruction and is injured.","options":[{"id":"A","text":"The construction crew/company is liable for creating an unmarked hazard in a public right-of-way.","tags":["responsibility","public-safety","negligence","duty-to-warn-public-hazard"]},{"id":"B","text":"The city is also partly liable for failing to ensure its streets are clear of hazards or that contractors adhere to safety regulations.","tags":["reciprocity","municipal-liability","failure-to-supervise","shared-responsibility-public-space"]}]}
{"id":"bk-024","source":"79b","strength":"okay","title":"Unsecured Object Falls from Property, Injuring Passerby","vignette":"A homeowner leaves a ladder or large tool unsecured on their rooftop or high balcony. A strong gust of wind, not extreme but foreseeable for the season, causes it to fall, injuring a pedestrian below.","options":[{"id":"A","text":"Full liability for the homeowner; items stored in high places must be secured against foreseeable weather conditions like wind. Negligent placement.","tags":["responsibility","negligence","foreseeable-risk","public-safety","premises-liability"]},{"id":"B","text":"Liability might be partial if the gust of wind was truly exceptional and unforeseeable (true force majeure), not just a normal strong wind.","tags":["reciprocity","act-of-god-defense","unforeseeable-event","causation-difficulty"]}]}
{"id":"bk-025","source":"85a","strength":"weak","title":"Professional Damages Client's Property by Mistake","vignette":"A professional dry cleaner mistakenly uses the wrong chemical on an expensive garment, causing irreparable damage to the fabric or color.","options":[{"id":"A","text":"The cleaner must pay the full current market value or replacement cost of the ruined garment.","tags":["responsibility","professional-liability","bailment-duty-of-care","making-customer-whole"]},{"id":"B","text":"The cleaner should return the damaged garment and perhaps offer a refund for the cleaning service, but the customer absorbs some loss for entrusting an item with inherent risks.","tags":["reciprocity","shared-risk","limitation-of-liability-service","inherent-risk-of-service"]}]}
{"id":"bk-026","source":"87a","strength":"okay","title":"Hired Security Guard Found Sleeping on Duty During a Burglary","vignette":"A company hires a security guard to protect their premises overnight. The guard is found to have been asleep in their post during a period when a burglary occurred.","options":[{"id":"A","text":"The guard (or their security company) is liable for the losses from the burglary; sleeping on duty is a clear dereliction of duty and negligence.","tags":["responsibility","negligence","breach-of-contract","failure-to-perform-duty"]},{"id":"B","text":"The guard is liable only if it can be proven that their being awake would have definitely prevented that specific burglary. Their sleeping was negligent, but causation of loss must be direct.","tags":["property-rights","causation-requirement","proof-of-direct-loss","limits-of-liability-for-security"]}]}
{"id":"bk-027","source":"92a","strength":"weak","title":"Courier Loses Important Signed Documents","vignette":"A professional courier service loses a package containing important, signed original documents (e.g., contracts, deeds) en route to their destination. The documents have minimal intrinsic paper value but significant legal or business value.","options":[{"id":"A","text":"The courier service is liable for the consequential damages resulting from the loss of the irreplaceable documents (e.g., cost of recreating them if possible, business delays, legal fees).","tags":["responsibility","consequential-damages","professional-liability","duty-of-care-for-documents"]},{"id":"B","text":"The courier pays only a nominal amount reflecting the physical value of the lost paper, or as per their standard liability limits for lost packages, not the potentially huge, unstated consequential value of the contents.","tags":["property-rights","limitation-of-liability-clause","declared-value","foreseeability-of-consequential-loss"]}]}
{"id":"bk-028","source":"96b-97a","strength":"prime","title":"Employer Delays Agreed-Upon Wages","vignette":"A company owner promises employees payment on a specific day (e.g., end of the work week) but regularly delays these payments by a day or two, causing inconvenience and potential hardship for employees.","options":[{"id":"A","text":"This is a violation of labor agreements/law; wages must be paid promptly on the agreed-upon day. Penalties for late payment may apply.","tags":["worker-dignity","responsibility","labor-law-compliance","prompt-payment","contract-adherence"]},{"id":"B","text":"A very short, occasional delay (e.g., one day) is acceptable if there are administrative reasons and employees are still present and working; not a major breach.","tags":["property-rights","reciprocity","de-minimis-delay","practical-leeway"]}]}
{"id":"bk-029","source":"100a","strength":"weak","title":"Combined Negligence Leading to Damage","vignette":"One person's unattended, free-roaming large dog chases another person's goat, which then falls into an unmarked pit dug by a third person on public land.","options":[{"id":"A","text":"The dog owner and the pit digger share liability for the goat's injury; both contributed to the hazard.","tags":["reciprocity","joint-and-several-liability","multiple-causation","shared-negligence"]},{"id":"B","text":"Only the pit owner is liable; the pit was the ultimate cause of the injury. The dog's chasing did not guarantee harm without the pit.","tags":["responsibility","primary-cause","last-clear-chance-doctrine-analogy"]}]}
{"id":"bk-030","source":"102b","strength":"weak","title":"Negligence Standard for Borrowed Items","vignette":"Someone borrows tools from a neighbor and leaves their garage door unlocked (which is not their usual habit, but they were distracted). The borrowed tools are stolen from the garage.","options":[{"id":"A","text":"The borrower pays for the tools; they failed to guard the borrowed items with the reasonable diligence expected, even if it was a lapse.","tags":["responsibility","bailee-responsibility","duty-of-care-borrowed-items","negligence-standard"]},{"id":"B","text":"The borrower pays only if the theft was highly foreseeable given the specific neighborhood and time, or if they were grossly negligent. A simple unlocked door might not meet the threshold if theft is rare.","tags":["reciprocity","property-rights","gross-negligence-standard","foreseeability-of-crime"]}]}
{"id":"bk-031","source":"19b-20a","strength":"weak","title":"Animal Grazing in Private vs. Public Area","vignette":"A goat escapes its enclosure and eats vegetables in a neighbor's private garden. Later that day, the same goat is found nibbling on discarded vegetable scraps in a public alleyway.","options":[{"id":"A","text":"The goat's owner pays full damages for the vegetables consumed in the private garden, but nothing for the scraps consumed in the public alley, as those were ownerless or waste.","tags":["responsibility","property-rights","distinction-of-locale","damage-to-private-property"]},{"id":"B","text":"The owner must pay for any significant consumption by their roaming animal, regardless of location, if the animal should have been properly secured. Roaming itself is negligence.","tags":["responsibility","animal-at-large-liability","general-negligence"]}]}
{"id":"bk-032","source":"17a","strength":"weak","title":"Minor Indirect Damage from Animal's Movement (Pebbles)","vignette":"A horse being ridden on a gravel path kicks up small pebbles with its hooves. One pebble flies through the open door of a nearby shop and chips a delicate glass item.","options":[{"id":"A","text":"The horse's owner/rider pays partial (e.g., half) damages; this type of damage is indirect and somewhat unforeseeable, though a consequence of the animal's movement.","tags":["reciprocity","responsibility","indirect-damage","mitigated-liability","foreseeability-limit"]},{"id":"B","text":"The owner/rider pays full damages; it's a foreseeable consequence of riding a horse on a gravel path near property that such minor projectiles could cause damage.","tags":["responsibility","direct-foreseeability","strict-liability-for-animal-actions"]}]}
{"id":"bk-033","source":"15a","strength":"weak","title":"Animal Causing Damage on Owner's Property vs. Victim's Property","vignette":"An ox, not previously known for aggression ("tam"), causes minor damage while on its owner's property (e.g., knocks over a fence post). The next day, the same ox wanders onto a neighbor's property and causes similar minor damage.","options":[{"id":"A","text":"The owner pays a reduced amount (e.g., half damages) for the incident on their own property (if at all, depending on specifics of 'damage') AND for the first-time incident on the victim's property. The "tam" status applies.","tags":["responsibility","reciprocity","location-of-damage-less-relevant","first-offense-rule"]},{"id":"B","text":"The owner pays full damages when their animal causes damage on the victim's private property, even if it's a first-time offense by an animal not known to be dangerous. Trespass with damage.","tags":["responsibility","property-rights","trespass-and-damage","stricter-liability-on-victim-s-land"]}]}
{"id":"bk-034","source":"50a","strength":"weak","title":"Inadequate Cover for a Hazard in Public Space","vignette":"A utility company digs a hole in the sidewalk and places a standard, but somewhat flimsy, wooden board over it as a temporary cover. The board breaks when a pedestrian steps on it, causing injury.","options":[{"id":"A","text":"The company is liable; the cover was inadequate for pedestrian traffic in a public space. They should have used a stronger, more secure cover.","tags":["responsibility","public-safety","negligence","inadequate-safety-measure"]},{"id":"B","text":"If the cover met minimal, commonly accepted standards for temporary covers, and there was no prior indication of its flimsiness, the collapse might be deemed an unforeseeable accident, exempting the company.","tags":["property-rights","industry-standards","unforeseeable-failure","accident-defense"]}]}
{"id":"bk-035","source":"41b","strength":"okay","title":"Employee Damages Property During Work Errands","vignette":"An employee of a company, while making a delivery using a company vehicle, negligently breaks an expensive item belonging to a third party (e.g., knocks over a valuable statue while maneuvering the vehicle).","options":[{"id":"A","text":"The employer (company) is liable for the damage; the employee was acting within the scope of their employment. (Respondeat Superior).","tags":["responsibility","vicarious-liability","respondeat-superior","scope-of-employment"]},{"id":"B","text":"The employee is personally liable for the damage caused by their direct negligence. The company is not liable unless it directly sanctioned the negligent act.","tags":["property-rights","personal-liability","direct-negligence","corporate-shield-from-employee-torts"]}]}
{"id":"bk-036","source":"22b","strength":"okay","title":"Entrusting a Dangerous Item to an Irresponsible Person","vignette":"An adult gives a child a lit firework or a powerful laser pointer to play with. The child, not understanding the danger, causes a fire or eye injury to a neighbor.","options":[{"id":"A","text":"The adult who entrusted the dangerous item to the child is liable for the damage; it's like their own action ("fire is like his arrow"), even via an intermediary.","tags":["responsibility","negligent-entrustment","foreseeable-harm-by-intermediary","adult-supervision-failure"]},{"id":"B","text":"Liability is reduced or shared; the child's own unpredictable actions or lack of understanding partially breaks the chain of causation from the adult's initial act.","tags":["property-rights","intervening-cause-child","mitigated-liability-for-intermediary"]}]}
{"id":"bk-037","source":"33a","strength":"weak","title":"Unauthorized Re-Lending of Borrowed Item","vignette":"Sarah borrows a high-quality bicycle from her friend. Without her friend's permission, Sarah lends the bicycle to her cousin, Dina. Dina crashes the bicycle, causing significant damage.","options":[{"id":"A","text":"Sarah, the original borrower, is liable to her friend for the damage; she violated the terms of the bailment by re-lending without authorization.","tags":["responsibility","breach-of-bailment","unauthorized-transfer","strict-liability-of-original-borrower"]},{"id":"B","text":"Dina, the end-user who actually damaged it, is primarily liable to the owner. Sarah may only be secondarily liable if Dina defaults.","tags":["property-rights","direct-causation-of-damage","end-user-liability","apportionment-of-blame"]}]}
{"id":"bk-038","source":"6b","strength":"weak","title":"Source of Funds for Paying Court-Ordered Compensation","vignette":"After a court rules that a debtor owes compensation for damages, the debtor owns several assets of varying quality and liquidity (e.g., prime real estate, average investments, low-quality speculative assets).","options":[{"id":"A","text":"The creditor entitled to compensation may demand payment from the debtor's highest-quality, most liquid assets ("best land") to ensure the full value of the judgment is easily recovered.","tags":["responsibility","property-rights","creditor-rights","enforcement-of-judgment","quality-of-assets-for-payment"]},{"id":"B","text":"The debtor may choose to pay from their average-quality assets ("medium land"); the best assets might be reserved for other specific, pre-existing obligations or personal sustenance. Creditor gets fair value, not necessarily prime assets.","tags":["reciprocity","property-rights","debtor-protections","orderly-payment-from-assets","fair-value-not-best-asset"]}]}
