{"id": "edu-001", "source": "1:12", "strength": "prime", "title": "Conflict of Interest: Individual vs. Associate", "vignette": "A company policy prohibits employees from participating in projects where their close relatives have a significant financial interest. An employee's sibling has such an interest in Project A. Does this restriction automatically extend to the employee's close colleague and office-mate, barring the colleague also from Project A, due to their association with the conflicted employee? (This is analogous to a daughter being forbidden to her uncle in levirate marriage, and whether that bars the co-wife too).", "options": [{"id": "A", "text": "Bar the colleague as well; the principle of avoiding perceived conflict of interest or favoritism extends to close associates of the primarily conflicted party. Maintain team integrity.", "tags": ["integrity", "integrity", "integrity", "rule-of-law"]}, {"id": "B", "text": "Permit the colleague to participate; assess each individual's conflict of interest status separately. The colleague has no direct familial/financial conflict.", "tags": ["personal-agency", "responsibility", "due-process", "rule-of-law"]}]}
{"id": "edu-002", "source": "2:7", "strength": "okay", "title": "Using a Non-Standard Tool in a Public Professional Demonstration", "vignette": "A professional is giving a public demonstration on a day with strict industry rules about tool usage (e.g., only officially sanctioned software during a certification exam). They wish to use a slightly non-standard but visually impressive piece of equipment (e.g., \"ornate\" diadem) which is technically not forbidden but might lead them to casually violate a minor handling rule if they're not careful (e.g., putting it down on a non-approved surface - \"carrying offence\").", "options": [{"id": "A", "text": "Forbid using the non-standard equipment; prevent the likely minor breach of rules and maintain utmost professional decorum during the public event.", "tags": ["public-safety", "integrity", "prudence", "rule-of-law"]}, {"id": "B", "text": "Permit its use; trust the professional's competence and dignity not to commit the minor handling violation. The visual impact is beneficial.", "tags": ["personal-agency", "responsibility", "trust", "prudence"]}]}
{"id": "edu-003", "source": "5:6-7", "strength": "prime", "title": "Principled Stance vs. Organizational Conformity", "vignette": "A respected senior researcher maintains several minority scientific opinions/interpretations of data that contradict the established consensus of their institution's review board. The board offers the researcher a prestigious leadership position on the condition they retract these dissenting opinions and conform to the majority view. The researcher refuses and is subsequently marginalized (ostracized) by the institution. On their deathbed, they advise their child, also a researcher, to generally align with the majority for career harmony.", "options": [{"id": "A", "text": "The researcher should stand firm by their dissenting opinions if they believe them to be true, even at the cost of career advancement and collegial harmony. Truth outweighs conformity.", "tags": ["freedom-of-thought", "personal-agency", "integrity", "freedom-of-thought"]}, {"id": "B", "text": "The researcher should yield to the majority view for the sake of institutional unity, career advancement, and the greater perceived good of the organization. Authority and consensus come first.", "tags": ["authority", "rule-of-law", "reconciliation", "simplification"]}]}
{"id": "edu-004", "source": "5:6 (case 2)", "strength": "okay", "title": "Sanctioning Public Disrespect of Organizational Norms", "vignette": "A mid-level manager publicly mocks a long-standing, common company practice (e.g., a particular quality assurance step like \"hand-washing before meals,\" which they deem pointless). Should the company's leadership formally sanction or discipline the manager for this public display of contempt for established norms?", "options": [{"id": "A", "text": "Yes; public contempt for established practices, even if seemingly minor, can undermine morale, discipline, and adherence to important standards.", "tags": ["tradition", "deterrence", "rule-of-law", "integrity"]}, {"id": "B", "text": "No; a formal sanction is too severe for mere verbal disrespect or mockery of a non-critical practice. Allow for some expression of dissent or frustration.", "tags": ["proportionality", "freedom-of-thought", "freedom-of-thought", "freedom-of-thought"]}]}
{"id": "edu-005", "source": "6:3", "strength": "weak", "title": "Public Shaming vs. Private Dignity for a Disgraced Executive", "vignette": "A historical company custom involves a symbolic act of public shaming (e.g., \"placing a massive stone on the coffin\") for a high-level executive dismissed for gross misconduct leading to significant company damage. Should the family be allowed a standard, private departure/funeral without this additional public shaming ritual?", "options": [{"id": "A", "text": "Maintain the public shaming ritual; it serves as a historical deterrent and a strong statement of company values against severe misconduct.", "tags": ["deterrence", "collective-responsibility", "fairness", "retribution"]}, {"id": "B", "text": "Omit the ritual; allow the family to grieve and manage the departure with dignity, focusing on private accountability rather than public shaming.", "tags": ["compassion", "privacy", "compassion", "innovation"]}]}
{"id": "edu-006", "source": "7:2", "strength": "weak", "title": "Accepting Late, Critical Data That Disrupts an Established Plan", "vignette": "A research team is about to launch a major public health campaign based on data analysis completed by a set deadline. After the deadline, and as the campaign launch is imminent, a new set of critical data arrives which significantly contradicts the earlier findings (analogous to \"witnesses for new moon arriving late\"). Incorporating this data would require retroactively changing the campaign messaging and materials, causing significant public confusion and logistical costs.", "options": [{"id": "A", "text": "Accept and incorporate the late data; scientific accuracy and the truth of the health risk, however disruptive, must prevail.", "tags": ["integrity", "freedom-of-thought", "innovation", "innovation"]}, {"id": "B", "text": "Reject the late data or defer its consideration to a future campaign; prevent public confusion, adhere to the established schedule, and avoid the immediate costs of a last-minute reversal.", "tags": ["public-safety", "responsibility", "prudence", "trust", "responsibility"]}]}
{"id": "edu-007", "source": "1:12", "strength": "prime", "title": "Uncorroborated Self-Report for Status Change and Financial Claims", "vignette": "A woman returns from a remote, war-torn region without her spouse, claiming he died there. External verification is currently impossible. Based on historical precedents (School A vs. School B), there's a debate: should her uncorroborated testimony be accepted to allow her to remarry AND to claim significant spousal death benefits from his estate or insurance?", "options": [{"id": "A", "text": "Accept her testimony for both remarriage (personal status change) and full financial claims (e.g., insurance payout, inheritance). Her credible self-report is sufficient.", "tags": ["due-process", "property-rights", "trust", "compassion", "simplification"]}, {"id": "B", "text": "Allow remarriage based on her testimony but deny or delay major financial claims until independent corroborating evidence of the death is available. Higher burden of proof for financial matters.", "tags": ["due-process", "responsibility", "integrity", "responsibility"]}]}
{"id": "edu-008", "source": "1:13", "strength": "prime", "title": "Individual with Conflicting Obligations Due to Partial Emancipation", "vignette": "An individual was partially released from a highly restrictive long-term contract (e.g., an indentured servitude agreement, a restrictive non-compete clause with a former monopolistic employer - analogous to \"half-slave, half-free\"). They now have some freedom but also retain some obligations to their former \"master\" or contracting party. This ambiguous status creates complexities, for example, in their ability to enter new contracts or personal relationships freely.", "options": [{"id": "A", "text": "The individual must divide their time or efforts, fulfilling residual obligations to the former party while utilizing their partial freedom as best they can. New significant commitments (like marriage or exclusive contracts) may remain blocked or complicated.", "tags": ["property-rights", "worker-dignity", "rule-of-law", "due-process", "fairness"]}, {"id": "B", "text": "The former \"master\" or contracting party should be compelled by a mediating body to fully release the individual, possibly in exchange for a final financial settlement representing the remaining value of the contract, so the individual can achieve full autonomy.", "tags": ["responsibility", "worker-dignity", "personal-agency", "property-rights", "fairness"]}]}
