{"id":"edu-001","source":"1:12","strength":"prime","title":"Two widows—one is a close relative","vignette":"A man dies childless, leaving two widows. One widow is also the deceased’s adult daughter from an earlier relationship, so his brother may not marry her. Does that ban automatically extend to the unrelated co-widow?","options":[{"id":"A","text":"Yes – if one widow is off-limits, the other stays single as well, keeping the household’s status consistent.","tags":["sexual-ethics","collective-responsibility"]},{"id":"B","text":"No – treat each widow separately; the unrelated woman is free to remarry.","tags":["personal-agency","responsibility"]}]}
{"id":"edu-002","source":"2:7","strength":"okay","title":"Wearing costly jewellery on a no-carry holiday","vignette":"On a city-wide day of rest when carrying items outdoors is prohibited, a woman wants to wear an elaborate gold tiara in public. Friends might ask to examine it, tempting her to remove and carry it by hand.","options":[{"id":"A","text":"Forbid the tiara to prevent an almost certain rule-break.","tags":["public-safety","religious-duty"]},{"id":"B","text":"Permit it; assume a responsible adult can resist showing it off.","tags":["personal-agency","responsibility"]}]}
{"id":"edu-003","source":"5:6-7","strength":"prime","title":"Refusing to retract a minority opinion","vignette":"A respected scholar holds four dissenting views. Offered a prestigious post if he recants, he declines and is formally ostracised. Near death he advises his son to follow the majority view.","options":[{"id":"A","text":"Stand firm; personal conviction outranks social harmony.","tags":["freedom-of-thought","personal-agency"]},{"id":"B","text":"Concede; unity and shared authority matter more.","tags":["authority","rule-of-law"]}]}
{"id":"edu-004","source":"5:6 (case 2)","strength":"okay","title":"Penalising public mockery of tradition","vignette":"A teacher ridicules the long-standing custom of washing hands before meals during a public lecture. Should the community place him under a formal ban?","options":[{"id":"A","text":"Yes – open contempt for tradition endangers communal norms; a strong sanction deters others.","tags":["religious-duty","deterrence"]},{"id":"B","text":"No – excommunication is disproportionate to mere words of disrespect.","tags":["proportionality","freedom-of-thought"]}]}
{"id":"edu-005","source":"6:3","strength":"weak","title":"Grave marker for an executed criminal","vignette":"Local custom places an extra-heavy stone slab on the grave of someone executed for a capital crime as a warning to others. The family asks for a normal headstone instead.","options":[{"id":"A","text":"Keep the heavy slab to serve as a lasting deterrent.","tags":["deterrence","collective-responsibility"]},{"id":"B","text":"Allow a standard burial marker to spare the family further shame.","tags":["sanctity-of-life","worker-dignity"]}]}
{"id":"edu-006","source":"7:2","strength":"weak","title":"Late witnesses change the calendar","vignette":"Official time to declare the new month passes at dusk. Moments later, witnesses arrive claiming they saw the new moon. Accepting them would retroactively turn that day into a holiday, disrupting people’s work plans.","options":[{"id":"A","text":"Accept the testimony; calendar accuracy is paramount.","tags":["religious-duty","authority"]},{"id":"B","text":"Reject it to avoid sudden social and economic confusion.","tags":["public-safety","responsibility"]}]}
{"id":"edu-007","source":"1:12","strength":"prime","title":"Solo testimony of a returning traveller","vignette":"A woman comes back alone from overseas and says, “My husband has died.” Authorities let her remarry, but should she also receive the full marriage-settlement payment based on her single statement?","options":[{"id":"A","text":"Yes – trust her for both remarriage and the settlement money.","tags":["due-process","property-rights"]},{"id":"B","text":"Let her remarry but withhold the money until two witnesses confirm the death.","tags":["due-process","responsibility"]}]}
{"id":"edu-008","source":"1:13","strength":"prime","title":"Worker who is half-free, half-enslaved","vignette":"A labourer jointly owned by two partners is freed by one of them, leaving him half-free. He can’t legally marry while partially enslaved. What should happen next?","options":[{"id":"A","text":"He works alternate days: one day for wages, one day for the remaining owner; marriage stays on hold.","tags":["property-rights","worker-dignity"]},{"id":"B","text":"Force the remaining owner to finish freeing him, while he repays half his value so he can marry.","tags":["responsibility","worker-dignity"]}]}
