{"id":"hor-001","source":"2b","strength":"prime","title":"Following Erroneous Official Guidance When One Suspects It's Wrong","vignette":"A national safety agency mistakenly issues guidance stating a previously banned industrial chemical is now considered safe for certain uses. An experienced factory manager reads the new guidance but, based on their own knowledge and research, suspects the agency's assessment is flawed and the chemical is still dangerous. However, using the chemical would significantly cut costs.","options":[{"id":"A","text":"The manager is liable for any harm if they use the chemical; personal knowledge and due diligence require them to avoid a suspected danger, even if official guidance permits it.","tags":["personal-agency","responsibility","due-diligence","ethical-disobedience"]},{"id":"B","text":"The manager is exempt from liability if they use the chemical according to the official guidance; deference to the regulatory agency absolves them of responsibility for the agency's error.","tags":["authority","rule-of-law","regulatory-compliance","following-orders"]}]}
{"id":"hor-002","source":"3a","strength":"okay","title":"Authority Retracts Erroneous Guidance: Is Atonement Required?","vignette":"A leading industry standards body issues a mistaken technical standard. Some companies adopt it. Later, the standards body discovers the error and formally retracts the standard. Must the standards body still take public corrective action or offer compensation for issues arising from the period the faulty standard was active?","options":[{"id":"A","text":"Yes; responsibility for the error and its consequences remains with the standards body despite the retraction. They must actively mitigate harm caused.","tags":["collective-responsibility","rule-of-law","accountability","corrective-action"]},{"id":"B","text":"No; the formal retraction and correction of the standard are sufficient. Past actions based on the since-retracted standard are no longer the body's liability.","tags":["due-process","authority","error-correction","moving-forward"]}]}
{"id":"hor-003","source":"4a","strength":"weak","title":"Overlapping Errors by Different Authorities","vignette":"Both a company's internal Chief Safety Officer AND an external regulatory agency independently make the same mistaken ruling about a workplace safety procedure, and the company implements it. When the error is found, should the company undertake internal corrective measures AND report the agency's error for external correction, or is one level of correction sufficient?","options":[{"id":"A","text":"Each authority (company leadership and regulatory agency) should implement its own corrective actions and reviews; leaders at different levels are individually answerable for their domain of responsibility.","tags":["responsibility","authority","multi-level-accountability","independent-review"]},{"id":"B","text":"A single, comprehensive corrective action, perhaps led by the higher or more encompassing authority, suffices to address the error and prevent future occurrences. Avoid redundant efforts.","tags":["collective-responsibility","proportionality","efficiency-in-correction","streamlined-response"]}]}
{"id":"hor-004","source":"6a","strength":"prime","title":"Liability When Following Flawed Local vs. National Guidance","vignette":"A local branch of a federal agency (e.g., a regional EPA office) gives specific environmental compliance advice to local businesses. This advice is later found to contradict stricter national EPA guidelines. Are businesses that followed the local office's erroneous advice liable for violations of national standards?","options":[{"id":"A","text":"Businesses are liable; they should ideally verify local advice against national standards, especially in critical compliance areas. Ignorance of the higher standard is not a full excuse.","tags":["personal-agency","responsibility","due-diligence","supremacy-of-national-law"]},{"id":"B","text":"Businesses are exempt or face reduced penalties; they acted in good faith relying on guidance from their authorized local regulatory officials.","tags":["authority","rule-of-law","good-faith-reliance","local-vs-national-authority"]}]}
{"id":"hor-005","source":"10a","strength":"okay","title":"Key Mentor Imprisoned Remotely: Access for Students","vignette":"A brilliant and unique university professor is convicted of a crime (e.g., accidental manslaughter, financial misconduct) and is imprisoned in a facility in a very remote location. Their graduate students, who rely heavily on this professor for their specialized research, are now without direct guidance. Should the university pay to relocate the students to the remote town near the prison to continue some form of supervised learning, or should they expend resources to arrange for the professor to be transferred to a local facility or provide teaching under guard?","options":[{"id":"A","text":"Relocate the students to the mentor; the priority is continuing their unique education if they are willing.","tags":["altruism","self-sacrifice","education-continuity","student-needs"]},{"id":"B","text":"Attempt to move the mentor or provide secure remote access; minimize disruption and cost to the broader student body and institution. Prioritize safety and institutional stability.","tags":["institutional-stability","public-safety","cost-effectiveness","alternative-solutions"]}]}
{"id":"hor-006","source":"13a","strength":"prime","title":"Rescue Priority: CEO vs. Leading Ethics Scholar","vignette":"Both the CEO of a major corporation vital to the local economy and a highly influential ethics scholar/spiritual leader are trapped in a disaster (e.g., earthquake, fire) with limited rescue resources. Only one can be saved immediately.","options":[{"id":"A","text":"Save the ethics scholar first; their wisdom and moral guidance are irreplaceable for society's long-term well-being.","tags":["moral-values","societal-guidance","long-term-impact","wisdom-over-power"]},{"id":"B","text":"Save the CEO first; their leadership is critical for the immediate economic stability and employment of many in the community.","tags":["public-safety","collective-responsibility","economic-impact","pragmatic-leadership"]}]}
{"id":"hor-007","source":"13a","strength":"prime","title":"Rescue Priority: Leading Scientist vs. Head of State","vignette":"A renowned scientist on the verge of a world-changing discovery and the nation's political Head of State are both in immediate mortal peril (e.g., on a crashing plane). You can only provide aid to save one of them.","options":[{"id":"A","text":"Save the scientist first; their potential discovery holds immense long-term value for humanity.","tags":["defense-of-values","scientific-progress","long-term-benefit-humanity","knowledge-over-politics"]},{"id":"B","text":"Save the Head of State first; their leadership is crucial for national stability and governance in the immediate term.","tags":["public-safety","authority","national-stability","political-leadership"]}]}
{"id":"hor-008","source":"13a","strength":"okay","title":"Rescue Priority: Individual A vs. Individual B from Imminent Danger","vignette":"Two individuals, Person A and Person B, are captured by a hostile group, or are otherwise in imminent danger (e.g. burning building). Funds or resources are only sufficient to rescue one immediately. Person A is perceived as being more vulnerable or at greater risk of harm in that specific situation.","options":[{"id":"A","text":"Rescue Person A first, due to their greater perceived vulnerability in this context.","tags":["altruism","sanctity-of-life","vulnerability-assessment","mitigation-of-greatest-harm"]},{"id":"B","text":"Rescue Person B first, perhaps due to a traditional rule, random chance (coin toss), or other non-vulnerability-based criteria if vulnerability is equal or disputed.","tags":["authority","collective-responsibility","traditional-rules","equality-of-chance"]}]}
{"id":"hor-009","source":"13b","strength":"okay","title":"Priority in Returning Lost Valuable Items: Parent vs. Mentor","vignette":"You simultaneously find two lost valuable items of roughly equal sentimental and monetary worth. One belongs to your elderly parent, and the other belongs to your deeply respected former academic mentor who significantly shaped your career and values. You can only return one immediately.","options":[{"id":"A","text":"Return the mentor's item first; the debt owed for wisdom and guidance is profound.","tags":["respect-for-mentors","intellectual-debt","moral-priority","gratitude"]},{"id":"B","text":"Return the parent's item first; filial responsibility and the bond of family take precedence.","tags":["parental-responsibility","reciprocity","family-ties","personal-obligation"]}]}
{"id":"hor-010","source":"14a","strength":"weak","title":"Whom to Help First: Starting a Task vs. Averting a Crisis","vignette":"You encounter two colleagues simultaneously needing help. One needs assistance to begin a critical, time-sensitive project (e.g., "loading a pack animal" - getting started). The other is dealing with an ongoing minor crisis where things are currently going wrong and need to be stabilized (e.g., "unloading a fallen load" - immediate problem). You can only help one right away.","options":[{"id":"A","text":"Help the colleague deal with the immediate crisis first (unloading); alleviating current suffering or preventing further loss takes precedence.","tags":["altruism","responsibility","crisis-intervention","damage-control"]},{"id":"B","text":"Help the colleague start the critical project first (loading); fulfilling a prior commitment or enabling a critical new task might be more important in the long run.","tags":["reciprocity","proportionality","strategic-priority","long-term-vs-short-term"]}]}
{"id":"hor-011","source":"13a","strength":"okay","title":"Rescue Priority: Brilliant Expert from Marginalized Group vs. Less Competent Establishment Figure","vignette":"A brilliant scientific researcher who comes from a historically marginalized and often stigmatized social group (analogous to "scholar mamzer") and a high-ranking government official who is known to be of mediocre competence but holds a socially important position (analogous to "ignorant High Priest") are both in mortal danger. Only one can be rescued first.","options":[{"id":"A","text":"Rescue the brilliant researcher first; their knowledge and potential contributions are of greater objective value to society, irrespective of their social background or official standing.","tags":["defense-of-values","personal-agency","meritocracy","intellectual-contribution-priority"]},{"id":"B","text":"Rescue the high-ranking official first; their official position and the stability of the institution they represent demand priority, regardless of personal competence.","tags":["authority","social-order","institutional-stability","rank-has-privilege"]}]}
{"id":"hor-012","source":"13a","strength":"weak","title":"Aid Priority: Person A vs. Person B for Basic Necessity","vignette":"A relief organization has only enough funds to provide a basic necessity (e.g., a warm coat, a food parcel) for one person. Two individuals, Person A and Person B, are in equal need. Person A's public exposure or circumstances might lead to subjectively greater public embarrassment or immediate distress if unassisted.","options":[{"id":"A","text":"Provide the aid to Person A, whose potential for public humiliation or immediate distress is considered greater.","tags":["altruism","sanctity-of-life","mitigating-public-shame","vulnerability-assessment-social"]},{"id":"B","text":"Provide the aid based on a non-preferential criterion (e.g., first-come-first-served, random lot) as both are in equal basic need.","tags":["proportionality","collective-responsibility","equality-in-need","impartial-aid"]}]}
{"id":"hor-013","source":"13a","strength":"okay","title":"Rescue Priority: Senior Professional vs. Junior Professional in Same Field","vignette":"A senior, highly experienced professional (e.g., "Priest") and a junior but qualified professional (e.g., "Levite") in the same critical field (e.g., medicine, engineering) are both trapped in a collapsed building during an earthquake. Rescuers can only pull out one alive immediately.","options":[{"id":"A","text":"Rescue the senior professional first, due to their higher rank, greater experience, and potentially more critical role or knowledge.","tags":["authority","rank-based-decision","experience-value","leadership-priority"]},{"id":"B","text":"Rescue whichever one is easier or quicker to access, or decide by lot; all professional lives are valuable. Prioritize speed of rescue for any life.","tags":["collective-responsibility","proportionality","equality-of-life","rescue-logistics"]}]}
{"id":"hor-014","source":"13a","strength":"okay","title":"Charity Allocation: Person from Mainstream Group vs. Person from Stigmatized Group","vignette":"A charity has one last food parcel to distribute. Two people request it, both equally destitute. One is from the mainstream, generally accepted societal group ("Israelite"). The other is from a socially stigmatized or outcasted group (e.g., due to birth status, past offenses - analogous to "mamzer").","options":[{"id":"A","text":"Give the food parcel to the person from the mainstream group, perhaps due to unconscious bias, perceived social standing, or rules that prioritize this group.","tags":["authority","public-safety","social-hierarchy-bias","traditional-preference"]},{"id":"B","text":"Give it to the person from the stigmatized group, or decide by a fair, neutral criterion (e.g., coin toss), recognizing that all humans are equal in their basic need for food.","tags":["altruism","proportionality","equality-in-need","anti-discrimination","social-justice"]}]}
{"id":"hor-015","source":"13b","strength":"weak","title":"Ransom Priority: New Community Member vs. Formerly Oppressed Individual","vignette":"A new immigrant who has voluntarily joined a community (a "convert") and an individual who was recently freed from a situation of long-term forced labor or unjust imprisonment ("freed slave") are both taken hostage by criminals. The community only has enough funds to ransom one of them.","options":[{"id":"A","text":"Ransom the new immigrant ("convert") first; their full commitment to the community and potentially more stable prior status gives them precedence.","tags":["authority","community-membership-status","integration-priority","formal-standing"]},{"id":"B","text":"Ransom the formerly oppressed individual ("freed slave") first; compassion for their past suffering and potentially greater vulnerability now makes their rescue more urgent.","tags":["altruism","collective-responsibility","compassion-for-vulnerability","restorative-justice-focus"]}]}
