{"id":"mak-001","source":"2b","strength":"prime","title":"Punishing False Witnesses After Irreversible Harm","vignette":"Individuals provide false testimony that leads to a person being convicted of a capital crime and executed. Later, the witnesses' perjury is definitively exposed.","options":[{"id":"A","text":"The false witnesses should also receive the maximum penalty (e.g., life imprisonment or equivalent severe sentence, if not capital punishment itself, depending on jurisdiction); the principle of "an eye for an eye" applies to the irreversible harm they caused.","tags":["retribution","deterrence","sanctity-of-life","justice-for-perjury"]},{"id":"B","text":"Do NOT apply the maximum penalty (e.g., execution or life sentence); legal codes often state that the reciprocal penalty applies only if the original sentence was not carried out. Other severe penalties for perjury would still apply.","tags":["due-process","rule-of-law","limits-on-lex-talionis","statutory-interpretation"]}]}
{"id":"mak-002","source":"3a","strength":"prime","title":"Penalty for Perjury Leading to Non-Standard Sanction","vignette":"Witnesses falsely testify that someone committed an act for which the actual penalty is a significant, non-standard sanction (e.g., mandatory relocation to a remote work camp for several years, or "remote location" equivalent). What penalty should the perjurers receive when exposed?","options":[{"id":"A","text":"They should be sentenced to the same non-standard sanction (e.g., relocation to the work camp); the penalty should mirror the specific harm they tried to impose.","tags":["retribution","culpability","lex-talionis-specific","proportional-punishment"]},{"id":"B","text":"They should receive a standard severe penalty for perjury (e.g., significant jail time or heavy fines) rather than the specific non-standard sanction they tried to impose on another.","tags":["deterrence","proportionality","standardized-penalties","judicial-discretion"]}]}
{"id":"mak-003","source":"3b","strength":"okay","title":"Multiple Groups of Perjurers for Same Falsehood","vignette":"Three separate pairs of witnesses independently (or seemingly independently) give the exact same false testimony against a defendant. All are later discredited. Must all groups be punished for the perjury, or only the first group that testified?","options":[{"id":"A","text":"Punish every pair; each individual conspired and delivered false testimony, regardless of others.","tags":["collective-responsibility","deterrence","individual-accountability","conspiracy-charges"]},{"id":"B","text":"Punish only the first pair that testified; subsequent perjurers might have been influenced or their testimony was cumulative and less decisive. Focus on the initiators.","tags":["culpability","due-process","chain-of-influence","mitigation-for-followers"]}]}
{"id":"mak-004","source":"5b","strength":"okay","title":"Perjury Affecting Professional or Social Status","vignette":"Witnesses falsely testify that an individual does not meet the established professional qualifications for their job (e.g., "is not a senior professional's daughter," thus disqualifying her from certain roles or benefits associated with that status). This false testimony, if believed, would lead to loss of professional standing and opportunities. What sanction appropriately mirrors this intended harm?","options":[{"id":"A","text":"Impose a standard severe sanction for perjury (e.g., significant fines, community service); a direct equivalent status change for the perjurers is often impossible or impractical.","tags":["proportionality","due-process","standardized-sanctions","impracticality-of-exact-mirroring"]},{"id":"B","text":"Bar the perjurers from specific professional privileges or benefits similar to those they tried to deny the victim; aim for symmetry in the type of harm or loss.","tags":["retribution","deterrence","symbolic-justice","poetic-justice"]}]}
{"id":"mak-005","source":"7a","strength":"prime","title":"Vigilante Justice Against Negligent Individual in Protective Custody","vignette":"An individual who caused an accidental death through negligence (a "offender") is placed in a form of protective custody or a restricted living program ("safe zone") to prevent retaliation from the victim's family. A relative of the victim ("avenging relative") bypasses security and kills the negligent individual there.","options":[{"id":"A","text":"The retaliator is guilty of murder and should be prosecuted accordingly; the negligent individual was under legal protection, and their life was inviolable within that program.","tags":["sanctity-of-life","rule-of-law","no-vigilante-justice","due-process-for-all"]},{"id":"B","text":"The retaliator is exempt from murder charges or receives a significantly lesser charge; their right or overwhelming urge for vengeance, given the original death, is considered a profound mitigating factor, even if illegal.","tags":["retribution","personal-agency","mitigating-circumstances","blood-feud-mentality"]}]}
{"id":"mak-006","source":"7b","strength":"prime","title":"Negligent Individual Leaves Protective Custody Prematurely","vignette":"The individual in the restricted living program ("offender in custody") for causing an accidental death leaves the designated safe zone before their term is complete. A relative of the victim ("avenging relative") encounters them outside the zone.","options":[{"id":"A","text":"The avenging relative may use force against the individual (potentially lethal) with legal impunity or significantly reduced liability; the individual forfeited their protection by leaving the safe zone.","tags":["self-defense","retribution","assumption-of-risk","forfeiture-of-protection"]},{"id":"B","text":"The avenging relative is still liable for any assault or homicide; the individual's breach of program rules doesn't grant others a license to harm them. Legal channels must still be pursued.","tags":["sanctity-of-life","rule-of-law","no-license-to-kill","due-process"]}]}
{"id":"mak-007","source":"9b","strength":"okay","title":"Defining the Gradient of Negligence in Accidental Death","vignette":"During a construction project, a heavy tool accidentally slips from a worker's grasp due to fatigue and a poorly maintained safety harness, resulting in a fatal injury to someone below. Is this gross negligence approaching intentional harm (liable for severe criminal charges), or a tragic accident qualifying for a lesser charge like involuntary manslaughter or entry into a restorative justice program ("remote location")?","options":[{"id":"A","text":"Treat as near-intentional due to multiple safety lapses (fatigue, harness); leads to higher criminal liability (e.g., manslaughter with gross negligence).","tags":["culpability","deterrence","workplace-safety-standards","gross-negligence"]},{"id":"B","text":"Treat as primarily accidental, albeit with contributing negligence; qualifies for a less severe charge or a restorative program, focusing on amends rather than severe punishment.","tags":["proportionality","sanctity-of-life","restorative-justice","accidental-death-mitigation"]}]}
{"id":"mak-008","source":"10a","strength":"weak","title":"Financial Restitution Instead of Restrictive Sanction for Accidental Death","vignette":"May an individual who caused an accidental death through negligence offer significant financial restitution to the victim's heirs/family to avoid a mandatory restrictive sanction like temporary relocation, extensive community service, or loss of professional license ("remote location")?","options":[{"id":"A","text":"Yes; a mutually agreed monetary settlement can be more beneficial to the victim's family and less socially costly than the restrictive sanction.","tags":["property-rights","utilitarianism","restorative-justice-financial","victim-compensation"]},{"id":"B","text":"No; the value of a life and the societal need for accountability for negligence cannot be purely commuted into a monetary payment. The non-monetary sanction serves a different purpose.","tags":["sanctity-of-life","rule-of-law","non-commodification-of-life","accountability-beyond-money"]}]}
{"id":"mak-009","source":"11a","strength":"okay","title":"Amnesty Program Tied to an Unpredictable Event","vignette":"A justice system has a peculiar rule: individuals serving sentences in a specific restorative program ("exiles for accidental killing") are granted full amnesty upon the death of a certain long-serving, high-ranking public official (e.g., "high official"). Victims' families are aware of this and sometimes wish for the official's demise to either hasten or prevent the amnesty. Is such a system fair or prone to perverse incentives?","options":[{"id":"A","text":"The amnesty upon the official's death stands; it's a symbolic societal reset or form of collective atonement that, while arbitrary, is part of the established legal framework.","tags":["collective-responsibility","legal-tradition","symbolic-justice","amnesty-rules"]},{"id":"B","text":"This system is flawed and should be reformed to avoid perverse incentives and ensure release is based on individual progress or fixed terms, not arbitrary events. Appoint officials for fixed terms or change amnesty rules.","tags":["public-safety","proportionality","justice-reform","perverse-incentives","fairness-in-sentencing"]}]}
{"id":"mak-010","source":"12b","strength":"weak","title":"Retaliation Outside Safe Zone: Injury vs. Killing","vignette":"An "avenging relative" (victim's relative) encounters the "offender" (who caused accidental death) outside the latter's designated safe zone. The avenging relative attacks and injures the offender, but does not kill them.","options":[{"id":"A","text":"The avenging relative has no legal liability for the injury; the license to retaliate against a offender outside their safe zone covers any level of harm, not just lethal force.","tags":["self-defense","retribution","forfeiture-of-rights-by-offender","implied-license-to-harm"]},{"id":"B","text":"The avenging relative is liable for assault and injury; any license to retaliate (if it exists at all) is strictly limited to lethal force under specific conditions and does not permit general assault.","tags":["responsibility","sanctity-of-life","limits-on-self-defense","rule-of-law"]}]}
{"id":"mak-011","source":"13a","strength":"prime","title":"Single Act Violating Multiple Regulations: Cumulative Sanctions?","vignette":"A single act of industrial negligence (e.g., improper disposal of waste) simultaneously violates two distinct environmental regulations, each of which carries a significant penalty (e.g., "lashes" equivalent - like a large fine or temporary operational shutdown). Should the company receive both penalties, or only one?","options":[{"id":"A","text":"Impose only one penalty, likely the more severe one, or a consolidated penalty; the principle is to avoid excessive or "stacked" punishment for a single act of wrongdoing.","tags":["proportionality","due-process","no-double-jeopardy-analogy","consolidation-of-penalties"]},{"id":"B","text":"Impose both penalties (or sanctions equivalent to both); each regulation was distinctly breached, and each breach carries its own accountability.","tags":["deterrence","retribution","strict-liability-per-violation","cumulative-offenses"]}]}
{"id":"mak-012","source":"16a","strength":"okay","title":"Sanction vs. Fine for the Same Offense: Which Prevails?","vignette":"An individual commits an offense (e.g., a specific type of fraud, a serious professional misconduct) for which the law stipulates both a direct personal sanction (e.g., "lashes" - like a license suspension or mandatory community service) AND a monetary fine (e.g., "double-payment" to victim or state). Which penalty should be administered if both cannot reasonably be applied or if one is seen as superseding the other?","options":[{"id":"A","text":"The direct personal sanction (license suspension, community service) should take precedence and might cancel out the monetary fine; the principle is that a more severe or direct personal penalty absorbs the lesser financial one ("kam lei bid'rabah minei").","tags":["rule-of-law","proportionality","hierarchy-of-penalties","avoiding-double-punishment"]},{"id":"B","text":"Impose the monetary fine first or ensure it is paid; financial redress for the victim or state is a primary concern. The personal sanction can be applied additionally or if the fine cannot be paid.","tags":["property-rights","responsibility","victim-compensation-priority","financial-accountability"]}]}
{"id":"mak-013","source":"22b","strength":"weak","title":"Applying Severe Sanctions to a Vulnerable Offender","vignette":"An offender is found guilty of an offense for which the standard penalty is severe (e.g., "lashes" - like mandated strenuous community service or significant business disruption). However, the offender is elderly, in poor health, or extremely financially vulnerable, and imposing the full standard sanction might have a disproportionately devastating or even life-threatening effect.","options":[{"id":"A","text":"Administer the full standard sanction as mandated by law; the court's role is to apply the law, and the risk to the offender, while regrettable, was a consequence of their actions.","tags":["deterrence","authority","equality-under-law","strict-application-of-law"]},{"id":"B","text":"Reduce or modify the sanction to a level that still punishes the offense but does not disproportionately harm the vulnerable offender, preserving their life or basic well-being.","tags":["sanctity-of-life","proportionality","judicial-mercy","individualized-justice"]}]}
{"id":"mak-014","source":"24a","strength":"weak","title":"Interpreting Strong Rhetoric About Penalties","vignette":"A respected legal scholar or judge, commenting on adherence to laws, states emphatically: “Whoever transgresses even the lightest, most minor regulation deserves the most severe sanction (e.g., 'scourging')!” Is this intended as a literal legal principle for sentencing, or as strong rhetoric emphasizing the importance of respecting all laws?","options":[{"id":"A","text":"Treat as rhetoric; actual penalties should remain proportionate to the severity of the specific offense. This is an expression of ideal, not a practical guideline.","tags":["proportionality","freedom-of-thought","judicial-interpretation","rhetoric-vs-law"]},{"id":"B","text":"Read literally or as a guiding principle towards stricter enforcement; even small infractions can undermine the entire system and thus merit strong deterrence to send a message.","tags":["deterrence","legal-philosophy","strict-enforcement","slippery-slope-argument"]}]}
