{"id": "san-001", "source": "74a", "strength": "prime", "title": "Coerced Harm: Kill or Be Killed", "vignette": "An armed captor tells Person A: “Kill Person B (another captive), or I will kill you (Person A).”", "options": [{"id": "A", "text": "Refuse to kill Person B; accept one's own death rather than commit murder.", "tags": ["life", "sanctity-of-life", "self-sacrifice", "absolutism", "absolutism"]}, {"id": "B", "text": "Comply; kill Person B to preserve one's own life.", "tags": ["self-preservation", "utilitarian", "culpability", "self-preservation"]}]}
{"id": "san-002", "source": "74b", "strength": "prime", "title": "Surrender One Hostage to Save Many", "vignette": "A group of people is taken hostage. The hostage-takers demand: “Hand over one specific person from your group for us to kill, or we will kill all of you.”", "options": [{"id": "A", "text": "Refuse to designate or hand over anyone; all share the same fate together. Do not participate in selecting a victim.", "tags": ["collective-responsibility", "sanctity-of-life", "self-sacrifice", "altruism"]}, {"id": "B", "text": "Choose and hand over one person from the group to save the lives of the rest.", "tags": ["utilitarian", "self-preservation", "prudence", "prudence"]}]}
{"id": "san-003", "source": "72b", "strength": "prime", "title": "Intervening Against an Active Assailant (Rodef)", "vignette": "An individual is actively pursuing another person with the clear intent to murder or commit a similarly violent assault (e.g., rape). May bystanders use lethal force against the pursuer to save the potential victim?", "options": [{"id": "A", "text": "Yes, lethal force is permissible by bystanders immediately to stop the pursuer and save the victim's life or prevent grievous harm.", "tags": ["defense-of-others", "life", "self-defense", "self-defense"]}, {"id": "B", "text": "Lethal force should only be used as a last resort, after attempting other non-lethal means to stop the pursuer (e.g., shouting, physical intervention without weapons), if circumstances permit.", "tags": ["proportionality", "defense-of-others", "proportionality", "self-defense"]}]}
{"id": "san-004", "source": "72a-b", "strength": "okay", "title": "Pre-emptive Force Against a Night-Time Intruder", "vignette": "A homeowner is awakened at night by sounds indicating someone is currently breaking into their house by force (e.g., tunnelling, smashing a window). May the homeowner use lethal force against the intruder pre-emptively, assuming imminent danger?", "options": [{"id": "A", "text": "Yes; in such circumstances, it's reasonable to assume the intruder poses a lethal threat if confronted, justifying pre-emptive self-defense. (Castle Doctrine variant).", "tags": ["self-defense", "property-vs-life", "self-defense", "self-defense"]}, {"id": "B", "text": "No; lethal force is only justified if there is an absolute certainty of immediate mortal danger. The intruder's intent is not yet fully known. Try to escape, hide, or use non-lethal warnings first.", "tags": ["sanctity-of-life", "proportionality", "self-defense", "reconciliation"]}]}
{"id": "san-005", "source": "72b", "strength": "prime", "title": "Medical Procedure Endangering Fetus to Save Mother's Life", "vignette": "During a complicated childbirth with a severe obstruction, the fetus's continued presence or attempted delivery poses an immediate and unavoidable mortal threat to the mother's life. May attending medical professionals perform a procedure that will result in the death of the fetus (e.g., \"dismemberment\" if it's partially emerged, or other fetocidal procedure) to save the mother's life?", "options": [{"id": "A", "text": "Yes; the immediate threat to the mother's life makes the fetus tragically classifiable as an aggressor (\"rodef\"); saving the mother's existing life takes precedence.", "tags": ["life", "maternal-health", "integrity", "proportionality", "maternal-health"]}, {"id": "B", "text": "No; intentionally ending the fetus's life is forbidden, even if it's the only way to save the mother's life. Both lives must be valued, or nature must take its course.", "tags": ["sanctity-of-life", "potential-life", "potential-life", "potential-life"]}]}
{"id": "san-006", "source": "75a", "strength": "okay", "title": "Patient Dangerously Ill Due to Unrequited Love; Proposed Unethical 'Cure'", "vignette": "A young adult becomes dangerously ill, potentially fatally, due to an intense, unrequited obsession with a specific person. Doctors are stumped for conventional treatments. One controversial opinion suggests the patient might recover if the object of their affection consents to some form of physical intimacy (ranging from just meeting and talking, to more explicit contact), which that person is currently unwilling to do.", "options": [{"id": "A", "text": "Permit or encourage the person to consent to the requested level of intimacy if it is the only way to save the patient's life, even if it compromises their own comfort or principles regarding such interactions.", "tags": ["self-preservation", "sexual-ethics", "utilitarian", "innovation", "culpability"]}, {"id": "B", "text": "Refuse to permit or encourage such an act; it is unethical to pressure someone into unwanted intimacy, even for life-saving purposes. The patient's illness, however tragic, cannot override another's bodily autonomy or ethical boundaries.", "tags": ["sanctity-of-life", "sexual-ethics", "personal-agency", "integrity", "personal-agency"]}]}
{"id": "san-007", "source": "81b", "strength": "okay", "title": "Vigilante Action Against Publicly Offensive Act", "vignette": "A couple engages in an act that is extremely offensive to public morality and potentially illegal (e.g., public sexual intercourse, or a deliberate, provocative desecration of a revered public symbol). A group of incensed onlookers (\"zealots\") considers taking immediate violent action against the couple on the spot, bypassing law enforcement.", "options": [{"id": "A", "text": "Permissible under specific, rare circumstances, but only if the vigilantes act instantly, in the heat of the moment, without prior planning or consultation, as an expression of overwhelming communal outrage. (Kana'im Pog'im Bo principle).", "tags": ["vigilantism", "defense-of-values", "reconciliation", "vigilantism"]}, {"id": "B", "text": "No; any violent action taken by private citizens without due legal process is murder or assault. Law enforcement and courts must handle all offenses.", "tags": ["rule-of-law", "sanctity-of-life", "due-process", "rule-of-law"]}]}
{"id": "san-008", "source": "73a", "strength": "prime", "title": "Duty to Rescue Others at Significant Personal Risk", "vignette": "You witness someone in immediate mortal danger (e.g., drowning in a raging river, being mauled by a wild animal, under attack by armed assailants). Intervening to save them would involve significant personal risk to your own life or safety.", "options": [{"id": "A", "text": "Yes, you have a moral obligation to attempt a rescue, even if it involves accepting moderate to significant personal danger. Society values bravery and altruism.", "tags": ["duty-to-rescue", "altruism", "personal-agency", "altruism", "prudence"]}, {"id": "B", "text": "No, you are not obligated to endanger your own life or safety to save another. Self-preservation is a primary instinct and right.", "tags": ["self-preservation", "self-preservation", "self-preservation", "prudence"]}]}
{"id": "san-009", "source": "71a", "strength": "okay", "title": "Pre-emptive Extreme Sanction for a \"Future Criminal\" (Problematic Youth)", "vignette": "A juvenile displays extreme, persistent anti-social behavior (e.g., severe gluttony, substance abuse, theft, violence) and all attempts at rehabilitation have failed. Some experts predict they are almost certain to escalate to committing heinous crimes (e.g., murder) in the future. Should a societal body (e.g., court, special committee) have the power to impose an extreme pre-emptive sanction, such as permanent institutionalization or a modern equivalent of \"execution for their future good,\" to prevent these predicted crimes?", "options": [{"id": "A", "text": "Yes, in extreme and exceptionally clear cases, pre-emptive incapacitation is justified to prevent almost certain future harm to society. (Based on \"Ben Sorer U'Moreh\" concept).", "tags": ["preemptive-justice", "parental-responsibility", "public-safety", "preemptive-justice", "preemptive-justice"]}, {"id": "B", "text": "No, one cannot be punished or permanently deprived of liberty for crimes they have not yet committed, only for those they have. Prediction is fallible. Focus on ongoing intervention.", "tags": ["sanctity-of-life", "due-process", "due-process", "due-process"]}]}
{"id": "san-010", "source": "71a", "strength": "okay", "title": "Dealing with a Community Dominated by Criminal Enterprise", "vignette": "An entire district or branch of a city (or a local chapter of a large organization) becomes overwhelmingly controlled by and participatory in organized crime (e.g., drug cartels, human trafficking rings, systemic corruption - analogous to an \"idolatrous city\"). All attempts at reform from within or by normal policing have failed. Should higher authorities take extreme measures, such as complete dissolution of local governance, mass arrests, and large-scale property seizure, effectively \"destroying\" the existing community structure to eradicate the criminal enterprise?", "options": [{"id": "A", "text": "Yes; when a community becomes thoroughly and irredeemably corrupt and poses a danger, drastic collective measures are required to root out the evil, even if it means disrupting innocent lives.", "tags": ["collective-responsibility", "public-safety", "integrity", "rule-of-law"]}, {"id": "B", "text": "No; such total, collective punishment is immoral and impractical. It harms many innocent individuals. Focus on targeted law enforcement and gradual reform, however slow.", "tags": ["sanctity-of-life", "proportionality", "culpability", "proportionality"]}]}
{"id": "san-011", "source": "88a-b", "strength": "weak", "title": "Sanctioning a High-Status Expert for Defying Supreme Authority", "vignette": "A highly respected senior expert (e.g., a former Supreme Court Justice, a Nobel laureate scientist on a government panel) publicly and persistently advocates against a definitive final ruling or policy set by the current highest governing authority (e.g., Supreme Court, National Science Council), potentially undermining public trust in the system. Should this expert face severe sanctions (e.g., disbarment, loss of all official titles, public censure) to preserve the unity and authority of the decision-making body? (Analogous to \"rebellious sage\").", "options": [{"id": "A", "text": "Yes; the authority and finality of the highest decision-making body must be preserved. Public defiance by influential insiders warrants severe sanction to prevent anarchy or loss of confidence.", "tags": ["rule-of-law", "authority", "integrity", "deterrence"]}, {"id": "B", "text": "No; while their dissent may be problematic, imposing such severe sanctions for expressing a contrary opinion, even against a final ruling, chills free speech and intellectual debate. Other forms of rebuttal are more appropriate.", "tags": ["freedom-of-thought", "sanctity-of-life", "freedom-of-thought", "authority"]}]}
{"id": "san-012", "source": "Makot 1:10 cited in Sanhedrin", "strength": "weak", "title": "Frequency of Applying Maximum Penalties", "vignette": "Is a judicial system or regulatory body that frequently imposes the maximum allowable penalty (e.g., life sentences, permanent business shutdowns) seen as praiseworthy for its strong deterrent effect, or is it criticized as overly harsh and destructive?", "options": [{"id": "A", "text": "Such a body should apply maximum penalties very rarely, if ever. The emphasis should be on rehabilitation, lesser sanctions, and avoiding irreversible or overly destructive outcomes.", "tags": ["sanctity-of-life", "reconciliation", "proportionality", "due-process"]}, {"id": "B", "text": "The body should apply maximum penalties whenever technically warranted by the offense, to act as a strong deterrent and uphold the letter of the law. Effectiveness in crime reduction is key.", "tags": ["deterrence", "public-safety", "retribution", "legalism"]}]}
{"id": "san-013", "source": "43b-44b", "strength": "weak", "title": "Admissibility of Defendant's Confession in Cases with Severe Penalties", "vignette": "In legal cases involving the most severe penalties (e.g., life imprisonment, massive business-ending fines), should a court accept the defendant's own confession as sufficient evidence for conviction, or should external corroborating evidence always be required?", "options": [{"id": "A", "text": "A confession alone is inadmissible for conviction in such severe cases; risk of coerced or false confession is too high. Independent proof is necessary.", "tags": ["due-process", "due-process", "due-process", "due-process"]}, {"id": "B", "text": "Allow a voluntary, verified confession to be a basis for conviction, provided the defendant is competent and understands the consequences. People should be able to own their actions.", "tags": ["personal-agency", "freedom-of-thought", "simplification", "freedom-of-thought"]}]}
{"id": "san-014", "source": "32b", "strength": "okay", "title": "Punishing False Witnesses Who Sought Severe Penalty for Another", "vignette": "Witnesses collude to falsely accuse someone of a crime that carries a very severe penalty (e.g., life imprisonment). Their perjury is exposed before the innocent defendant is convicted. Should the false witnesses themselves receive that same severe penalty they sought to inflict?", "options": [{"id": "A", "text": "Yes; they should receive the same severe penalty they tried to impose on an innocent person (lex talionis).", "tags": ["retribution", "deterrence", "retribution", "retribution"]}, {"id": "B", "text": "No; while they should be severely punished for perjury, imposing the *exact same* penalty they sought might be disproportionate if no actual harm (beyond legal costs/stress) was ultimately suffered by the defendant. Intent alone doesn't always equal full consequence.", "tags": ["culpability", "due-process", "proportionality", "culpability"]}]}
{"id": "san-015", "source": "74a-b", "strength": "prime", "title": "Violating Core Principles Under Duress of Death", "vignette": "A person is threatened: \"Publicly renounce your most fundamental moral/ethical principle (e.g., commitment to truth for a scientist, non-violence for a pacifist, loyalty for a soldier) or be killed.\"", "options": [{"id": "A", "text": "Die rather than publicly renounce and violate this core principle. Maintain integrity to the end.", "tags": ["absolutism", "self-sacrifice", "integrity", "self-sacrifice"]}, {"id": "B", "text": "Publicly renounce the principle to stay alive. Survival is paramount, and a coerced statement under duress is not a true reflection of belief.", "tags": ["self-preservation", "utilitarian", "culpability", "simplification"]}]}
{"id": "san-016", "source": "74a-b", "strength": "prime", "title": "Committing a Grave Transgression Under Duress of Death", "vignette": "A person is threatened: \"Commit a specific act you consider gravely immoral and a violation of fundamental societal law (e.g., an act of severe betrayal, participation in a violent crime) or be killed.\" This is not about personal belief, but a specific harmful action.", "options": [{"id": "A", "text": "Die rather than commit the gravely immoral act. One must not transgress certain lines, even to save one's life.", "tags": ["absolutism", "self-sacrifice", "self-sacrifice", "integrity"]}, {"id": "B", "text": "Commit the act to save one's life. The duress absolves or mitigates responsibility for the coerced action.", "tags": ["self-preservation", "due-process", "culpability", "self-preservation"]}]}
{"id": "san-017", "source": "74a-b", "strength": "okay", "title": "Violating a Minor Professional Code Under Coercion: Public vs. Private", "vignette": "An authoritarian regime threatens a professional (e.g., architect, journalist) with severe consequences unless they violate a relatively minor aspect of their professional code of ethics (e.g., use a slightly substandard material in a non-critical part of a design, publish a slightly misleading but not fabricated statement). Does it matter if this violation happens privately (known only to the regime) versus publicly (where it could mislead others or damage the profession's reputation)?", "options": [{"id": "A", "text": "Comply with the regime's demand if the violation can be kept private and is minor, but resist if the violation must be public and could harm others or set a bad precedent.", "tags": ["integrity", "public-sanctification", "prudence", "prudence", "prudence"]}, {"id": "B", "text": "Resist any known violation of professional ethics, whether in private or public; any surrender to coercion on ethical matters is unacceptable and a slippery slope.", "tags": ["absolutism", "integrity", "personal-agency", "prudence"]}]}
{"id": "san-018", "source": "73a-b", "strength": "okay", "title": "Financial Obligation to Facilitate Rescue by Others", "vignette": "You are a bystander to an emergency where someone is in mortal danger. You cannot physically rescue them yourself due to lack of skill or ability, but you could easily hire professional rescuers (e.g., call a private ambulance, fund a specialized extraction team) for a significant but affordable fee. Are you morally obligated to spend your own money to hire these rescuers?", "options": [{"id": "A", "text": "Yes; if you have the means, you are obligated to pay to facilitate the rescue if direct action is not possible. The duty to rescue extends to financial means.", "tags": ["duty-to-rescue", "financial-sacrifice", "altruism", "fairness"]}, {"id": "B", "text": "No; the moral obligation to rescue primarily involves personal action and reasonable personal risk. There is no mandatory duty to incur significant financial loss for a stranger.", "tags": ["property-rights", "fairness", "fairness", "altruism"]}]}
