{"id": "shv-001", "source": "30a", "strength": "prime", "title": "Partial Admission in a Financial Dispute: Sworn Statement on Remainder?", "vignette": "In a civil lawsuit, the plaintiff claims the defendant owes them $20,000. The defendant formally admits to owing $10,000 but denies the remaining $10,000. Must the defendant now make a sworn affidavit specifically addressing the disputed $10,000, or should their admission of owing part of the sum lead to a judgment requiring them to pay the full $20,000 claimed?", "options": [{"id": "A", "text": "The defendant must submit a sworn affidavit concerning the disputed remainder; this formal attestation helps balance their partial admission against the plaintiff's full claim.", "tags": ["due-process", "responsibility", "rule-of-law", "rule-of-law"]}, {"id": "B", "text": "The defendant should be compelled to pay the full claim; a partial admission can be seen as undermining their credibility regarding the entire sum, or as an attempt to negotiate down a valid debt.", "tags": ["property-rights", "deterrence", "trust", "due-process"]}]}
{"id": "shv-002", "source": "31b-32a", "strength": "prime", "title": "False Denial of Witnessing by Key Witnesses", "vignette": "Two individuals are the sole witnesses to an event that would conclusively prove Person A's financial claim against Person B (e.g., they saw Person B accept goods without payment). When formally questioned under oath (e.g., deposition), these witnesses falsely deny any knowledge of the event. Are they liable only for a sanction for perjury/false statement (a \"ritual breach\"), or must they also compensate Person A for the financial loss incurred because their testimony was withheld?", "options": [{"id": "A", "text": "They are primarily liable for sanctions related to making a false statement under oath (e.g., perjury charges, contempt of court). The direct financial restitution is a separate matter for the original defendant.", "tags": ["retribution", "culpability", "integrity", "responsibility"]}, {"id": "B", "text": "They must also pay financial damages to Person A; their deliberate silence and false denial directly caused Person A to lose their rightful claim.", "tags": ["responsibility", "property-rights", "responsibility", "responsibility"]}]}
{"id": "shv-003", "source": "34a-b", "strength": "prime", "title": "Fiduciary's False Denial of Receiving Assets", "vignette": "A fiduciary (e.g., an investment manager, an escrow agent) initially denies under oath having received certain assets deposited by a client. Later, confronted with irrefutable proof, the fiduciary admits to having received the assets but claims they were subsequently lost through no fault of their own. For the initial false oath and denial, should they repay only the principal value of the assets, or should there be additional penalties (e.g., principal + 20% + other sanctions) due to the aggravated breach of trust and false swearing?", "options": [{"id": "A", "text": "Principal + significant penalty (e.g., 20% surcharge) + potential professional sanctions; the false oath concerning entrusted assets constitutes a severe breach of fiduciary duty and aggravated misconduct.", "tags": ["retribution", "deterrence", "responsibility", "responsibility", "fairness"]}, {"id": "B", "text": "Principal only, if they can now prove the assets were indeed lost subsequently without their fault after the (false) oath. The false oath is a separate issue punishable by professional sanctions but doesn't automatically increase the civil liability for the original sum if truly lost.", "tags": ["proportionality", "due-process", "due-process", "due-process"]}]}
{"id": "shv-004", "source": "40a-b", "strength": "okay", "title": "Mutual Sworn Declarations in Partnership Dissolution", "vignette": "Two business partners are dissolving their partnership. There are mutual suspicions that each partner might have discreetly taken more than their fair share of assets or profits before the formal dissolution process. May a mediator or court require both partners to submit a comprehensive sworn declaration of assets and withdrawals before finalizing the distribution of remaining assets?", "options": [{"id": "A", "text": "Yes; requiring reciprocal sworn declarations can help clear suspicions, ensure transparency, and provide a basis for a fair settlement.", "tags": ["reciprocity", "rule-of-law", "integrity", "reconciliation"]}, {"id": "B", "text": "No; such sworn declarations should not be imposed broadly based on mere suspicion. They are burdensome and should only be required if there's a concrete, evidenced claim of wrongdoing by one party against the other.", "tags": ["responsibility", "proportionality", "due-process", "integrity"]}]}
{"id": "shv-005", "source": "41a", "strength": "okay", "title": "Dispute Over Crop Share: Landowner vs. Tenant Farmer", "vignette": "A landowner leases land to a tenant farmer in exchange for a percentage of the crop yield. At the end of the season, the landowner accuses the tenant of under-reporting the total harvest to reduce the landowner's share. Who should be required to make a formal sworn statement about the harvest amount – the landowner (who is making the claim for more) or the tenant farmer (who is currently in possession of the disputed portion of the crop)?", "options": [{"id": "A", "text": "The tenant farmer should swear; they had direct control over the harvesting and current possession of the produce. Their attestation carries more weight regarding the facts on the ground.", "tags": ["property-rights", "responsibility", "responsibility", "prudence"]}, {"id": "B", "text": "The landowner should swear (or provide strong evidence for their claim); the burden of proof typically lies with the party making a claim or demanding an increase beyond what was initially provided.", "tags": ["due-process", "reciprocity", "due-process", "freedom-of-thought"]}]}
{"id": "shv-006", "source": "45a", "strength": "prime", "title": "Wage Dispute: Employees vs. Employer Sworn Statement", "vignette": "A group of hourly workers claims their employer has not paid them for their last week of work. The employer asserts that they have already paid the wages in full. There are no definitive pay stubs or bank records immediately available. To resolve the dispute quickly, should the workers be allowed to make a collective sworn statement to receive their claimed wages, or should the employer be allowed to make a sworn statement to be temporarily absolved of immediate payment pending further investigation?", "options": [{"id": "A", "text": "The workers should make a collective sworn statement and receive their pay; there's a legal and ethical presumption in favor of ensuring timely payment of wages to laborers.", "tags": ["worker-dignity", "responsibility", "worker-dignity", "worker-dignity"]}, {"id": "B", "text": "The employer should make a sworn statement and be temporarily absolved; money should remain with its current possessor until clear proof of non-payment is provided. Avoid double payment risk.", "tags": ["property-rights", "rule-of-law", "due-process", "responsibility"]}]}
{"id": "shv-007", "source": "43b", "strength": "okay", "title": "Administrator's Sworn Accounting for Beneficiary Funds", "vignette": "A court-appointed guardian or trustee is managing an estate for minor beneficiaries. The guardian claims various expenses were made from the estate funds for the benefit of the beneficiaries. Must the guardian provide a sworn accounting for every single withdrawal and expenditure, however small?", "options": [{"id": "A", "text": "Yes; a sworn, itemized accounting protects the vulnerable beneficiaries from potential mismanagement or fraud, ensuring full transparency.", "tags": ["collective-responsibility", "due-process", "responsibility", "integrity", "parental-responsibility"]}, {"id": "B", "text": "No; requiring sworn statements for every minor expenditure is overly burdensome and might deter honest individuals from serving as guardians. Periodic audited reports should suffice.", "tags": ["personal-agency", "proportionality", "prudence", "trust", "simplification"]}]}
{"id": "shv-008", "source": "47a", "strength": "weak", "title": "Breaking a Personal Commitment Due to Hardship", "vignette": "A person makes a strong public commitment or a personal resolution to abstain from a certain common food or activity for a set period (e.g., “I will not eat sugary foods for a month,” “I will not use social media for a week”). However, adhering to this commitment unexpectedly causes them significant physical discomfort (e.g., headaches, faintness) or severe social isolation. Should they keep their commitment at risk to their well-being, or break it?", "options": [{"id": "A", "text": "Keep the commitment; one's word, once given, is binding, and enduring the discomfort is a matter of self-discipline and integrity.", "tags": ["integrity", "self-discipline", "responsibility", "self-discipline"]}, {"id": "B", "text": "Break the commitment; preservation of health and well-being, or avoiding severe negative consequences, overrides a self-imposed restriction that has proven harmful.", "tags": ["life", "self-preservation", "self-preservation", "innovation", "prudence"]}]}
{"id": "shv-009", "source": "29a", "strength": "weak", "title": "Forcing a Sworn Statement Based on a Single Witness's Testimony", "vignette": "In a civil claim, only one witness supports the plaintiff's claim for a debt, which is not typically enough for a judgment. The court offers the defendant a choice: either make a sworn statement denying the debt and be absolved, or refuse to swear and pay the claim based on the single witness's testimony. Is it fair to compel the defendant to make a sworn statement under these circumstances?", "options": [{"id": "A", "text": "Yes; the sworn statement by the defendant appropriately balances the partial proof offered by the single witness. It's a way to resolve doubt.", "tags": ["due-process", "rule-of-law", "prudence", "reconciliation"]}, {"id": "B", "text": "No; the burden of proof (typically requiring two witnesses or conclusive evidence) lies solely with the claimant. A defendant should not be forced to swear to avoid judgment on insufficient evidence.", "tags": ["property-rights", "proportionality", "due-process", "due-process"]}]}
{"id": "shv-010", "source": "49b", "strength": "weak", "title": "Excessive Use of Formal Commitments in Minor Matters", "vignette": "In a particular business environment or community, it becomes common practice for people to demand or make formal, binding commitments (e.g., \"sworn statements,\" signed mini-contracts) for very trivial interactions or minor promises (e.g., \"I swear I'll bring the coffee next time\"). Should community or business leaders tolerate this to uphold a culture of explicit honesty in all dealings, or discourage it to avoid devaluing the seriousness of formal commitments and prevent people from making them too casually (and thus potentially breaching them often)?", "options": [{"id": "A", "text": "Tolerate the practice; emphasizing explicit commitments, even for small things, helps maintain a high standard of truthfulness and accountability in all interactions.", "tags": ["deterrence", "responsibility", "integrity", "responsibility"]}, {"id": "B", "text": "Discourage excessive formal commitments for trivial matters; it can lead to \"commitment fatigue,\" devalue the currency of serious oaths/contracts, and increase the likelihood of casual breaches.", "tags": ["proportionality", "integrity", "prudence", "simplification"]}]}
{"id": "shv-011", "source": "39a", "strength": "okay", "title": "Extending a Required Sworn Statement to Cover Other Disputed Matters", "vignette": "In a legal dispute, a defendant is already required by the court to submit a sworn affidavit regarding a primary claim (Claim A), perhaps due to a partial admission. The plaintiff then requests that the same affidavit be expanded to also cover other unrelated or tangentially related disputed matters (Claim B, Claim C) between the two parties. Is it fair to \"roll in\" these additional claims under the umbrella of the single mandated sworn statement?", "options": [{"id": "A", "text": "Allow one sworn statement to cover all currently pending claims between the parties (\"gilgul\"); this promotes efficiency, comprehensive truth-seeking, and deters selective honesty.", "tags": ["deterrence", "responsibility", "rule-of-law", "simplification", "integrity"]}, {"id": "B", "text": "Limit the sworn statement strictly to the original claim (Claim A) for which it was mandated. Each additional disputed matter requires its own independent basis for demanding a sworn statement or other forms of evidence.", "tags": ["due-process", "proportionality", "property-rights", "rule-of-law", "privacy"]}]}
