{"id": "ter-001", "source": "8:12", "strength": "prime", "title": "Hand over one woman to be violated", "vignette": "Attackers seize a group of women and demand: “Surrender one of you for sexual violation, or we will violate you all.”", "options": [{"id": "A", "text": "Comply; sacrifice one to spare the many.", "tags": ["utilitarian", "self-preservation"]}, {"id": "B", "text": "Refuse; better all suffer than single out a victim.", "tags": ["sexual-ethics", "collective-responsibility", "religious-duty"]}]}
{"id": "ter-002", "source": "Tosefta 7:23 / Yerushalmi 8:4", "strength": "prime", "title": "Surrender the fugitive or the town dies", "vignette": "Soldiers surround a town and say: “Hand over the named fugitive U. bar Kushav or we kill everyone.”", "options": [{"id": "A", "text": "Hand him over to save the town.", "tags": ["utilitarian", "public-safety", "self-preservation"]}, {"id": "B", "text": "Refuse; do not sacrifice an individual life.", "tags": ["sanctity-of-life", "collective-responsibility", "religious-duty"]}]}
{"id": "ter-003", "source": "8:9", "strength": "okay", "title": "Broken barrel of Community Contribution wine", "vignette": "uncontaminated community contribution wine is leaking into a lower vat of contamination ordinary wine. May one contaminate it by hand to save the valuable lower vat?", "options": [{"id": "A", "text": "Yes; actively contaminate to avoid large financial loss.", "tags": ["property-rights", "utilitarian", "responsibility"]}, {"id": "B", "text": "No; let it drip and become contamination on its own.", "tags": ["religious-duty", "proportionality"]}]}
{"id": "ter-004", "source": "8:10", "strength": "okay", "title": "Spilled Community Contribution oil on the ground", "vignette": "A jug of uncontaminated community contribution oil tips over. Catch it with unclean hands to salvage some, or let it soak into the earth?", "options": [{"id": "A", "text": "Catch it, though you render it contamination.", "tags": ["property-rights", "utilitarian"]}, {"id": "B", "text": "Do not touch; avoid deliberate contamination.", "tags": ["religious-duty", "proportionality"]}]}
{"id": "ter-005", "source": "8:8", "strength": "weak", "title": "Jar of Community Contribution with doubtful contamination", "vignette": "Uncertainty arises whether a sealed jar of community contribution became contamination. Protect it (hide/cover) or leave it exposed and treat as uncontaminated?", "options": [{"id": "A", "text": "Take extra precautions to guard against possible contamination.", "tags": ["responsibility", "religious-duty"]}, {"id": "B", "text": "Assume uncontaminated; no special measures.", "tags": ["property-rights", "self-preservation"]}]}
{"id": "ter-006", "source": "11:9", "strength": "weak", "title": "Feeding Community Contribution fodder to a hired cow", "vignette": "A community elder rents an community member’s cow and must feed it. May he give the cow community contribution vetches (produce with special status)?", "options": [{"id": "A", "text": "Yes; caretaker may use his community elder food even for another’s animal.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "No; community contribution should not benefit non-community elders’ property.", "tags": ["religious-duty", "responsibility"]}]}
{"id": "ter-007", "source": "8:11", "strength": "okay", "title": "Contaminating one loaf to save the rest", "vignette": "A traveller is carrying several loaves of community elder bread. A bandit says: “Hand me one loaf so I can render it contamination, or I’ll contaminate them all.”", "options": [{"id": "A", "text": "Hand over a single loaf to minimise the loss.", "tags": ["utilitarian", "property-rights"]}, {"id": "B", "text": "Refuse; better let them all become contamination than aid deliberate contamination.", "tags": ["religious-duty", "collective-responsibility"]}]}
{"id": "ter-008", "source": "9:2", "strength": "weak", "title": "Who may glean Community Contribution-produce fields", "vignette": "Gleanings from a field sown with community contribution are available after harvest. May both poor community members and poor community elders collect them, or only poor community elders (to avoid accidental misuse)?", "options": [{"id": "A", "text": "Allow all poor to glean; they can sell to community elders and keep the money.", "tags": ["reciprocity", "worker-dignity"]}, {"id": "B", "text": "Restrict gleaning to poor community elders to prevent mistakes with food with special status.", "tags": ["public-safety", "responsibility"]}]}
