{"id": "ber-001", "source": "13a", "strength": "prime", "title": "Interrupting an Important Personal Task for Authority", "vignette": "Someone is engrossed in a task they consider deeply important (e.g., completing a critical piece of work for a personal project, a moment of deep meditation, or a non-religious personal ritual). A very high-ranking authority figure (e.g., CEO of their large company, a state governor, a military general if they are a civilian) unexpectedly appears. Not acknowledging the authority figure could have severe negative personal or professional consequences.", "options": [{"id": "A", "text": "Continue the task; do not interrupt important personal work.", "tags": ["self-discipline", "self-sacrifice"]}, {"id": "B", "text": "Interrupt and acknowledge to avoid negative consequences.", "tags": ["self-preservation", "authority"]}]}
{"id": "ber-002", "source": "13b", "strength": "okay", "title": "Interrupting a Personal Task for a Respected Mentor", "vignette": "An individual is in the middle of a focused personal activity (e.g., practicing a musical instrument, deep study, a hobby requiring concentration). Their highly respected mentor, to whom they owe a great deal for their development, enters. Should they interrupt their activity to greet the mentor?", "options": [{"id": "A", "text": "Interrupt to honour the mentor.", "tags": ["authority", "reciprocity"]}, {"id": "B", "text": "Do not interrupt; the personal activity takes precedence.", "tags": ["self-discipline", "personal-agency"]}]}
{"id": "ber-003", "source": "16a", "strength": "prime", "title": "Personal Activities on Company Time", "vignette": "Employees are found spending a significant portion of their paid work hours on personal, non-work-related activities that are important to them (e.g., managing personal investments, extensive personal calls, pursuing a side-business during work hours).", "options": [{"id": "A", "text": "Continue their personal activities.", "tags": ["self-preservation"]}, {"id": "B", "text": "Focus on work tasks to not misuse company time.", "tags": ["worker-dignity", "responsibility"]}]}
{"id": "ber-004", "source": "30a", "strength": "okay", "title": "Performing a Necessary Personal Routine in a Compromised Situation", "vignette": "A person is on a difficult journey or in a situation where stopping or changing their immediate circumstances is risky (e.g., a lone hiker in a remote area needing to perform a daily medical self-treatment, a driver in heavy traffic needing to take scheduled medication). Performing the routine ideally requires stopping and being in a stable environment, but doing so could lead to danger or significant loss.", "options": [{"id": "A", "text": "Stop to perform the routine despite the risk.", "tags": ["self-preservation", "self-sacrifice"]}, {"id": "B", "text": "Continue and perform the routine as best as possible in the compromised situation.", "tags": ["self-preservation", "prudence"]}]}
{"id": "ber-005", "source": "2a", "strength": "weak", "title": "Optimal Individual Timing vs. Group Participation", "vignette": "Someone has the opportunity to perform a valued personal activity at what they consider the perfect time for maximum personal benefit or efficiency. Alternatively, they could delay it to do it as part of a group activity, which has its own social or collaborative benefits but might be less ideal for them personally.", "options": [{"id": "A", "text": "Wait and perform the activity with the group.", "tags": ["collective-responsibility", "reciprocity"]}, {"id": "B", "text": "Perform the activity immediately by oneself.", "tags": ["self-preservation", "personal-agency"]}]}
{"id": "ber-006", "source": "45a", "strength": "okay", "title": "Group Ritual vs. Urgent Personal Commitments", "vignette": "After a shared activity (e.g., a team lunch, a volunteer group meeting), the group decides to engage in a customary follow-up social ritual or brief activity (e.g., a quick debrief, a traditional group photo, a short informal chat). One member has urgent personal or professional matters to attend to elsewhere.", "options": [{"id": "A", "text": "Stay and join the group ritual.", "tags": ["collective-responsibility", "altruism"]}, {"id": "B", "text": "Leave early to attend to urgent matters.", "tags": ["self-preservation", "self-preservation"]}]}
{"id": "ber-007", "source": "23a", "strength": "okay", "title": "Valuable/Sensitive Item in an Unhygienic Place", "vignette": "A person needs to use a public restroom. They are carrying an item of significant personal value or sensitivity (e.g., a passport, a company confidential prototype, a very expensive piece of personal electronics). Leaving it outside unattended risks theft or loss. Taking it inside feels inappropriate or could expose it to unhygienic conditions.", "options": [{"id": "A", "text": "Bring the item inside for safekeeping.", "tags": ["self-preservation", "property-rights"]}, {"id": "B", "text": "Leave the item outside to avoid unhygienic conditions.", "tags": ["integrity", "prudence"]}]}
