{"id": "peah-001", "source": "1:2", "strength": "weak", "title": "Minimum Contribution from Surplus", "vignette": "A company has finalized its quarterly profits and must now allocate a portion for community support programs. Can the company allocate the bare legal minimum (e.g., 1.67% as per a hypothetical regulation) or is it expected to be more generous?", "options": [{"id": "A", "text": "Contribute only the minimum required by law; the rest belongs to the company.", "tags": ["property-rights", "rule-of-law"]}, {"id": "B", "text": "Contribute a larger share, based on company's success and community needs.", "tags": ["altruism", "altruism"]}]}
{"id": "peah-002", "source": "1:3", "strength": "okay", "title": "Early vs. Late Designation of Shared Resources", "vignette": "A project manager had informally set aside some surplus materials at the beginning of a project for a community initiative, but didn't formally designate them. Now, at the project's end, these materials remain. Should these early set-aside materials be considered the designated share for the community, or treated as unallocated resources available to anyone on the project team?", "options": [{"id": "A", "text": "Count them as the designated community share (analogous to R. Shimon).", "tags": ["responsibility", "altruism"]}, {"id": "B", "text": "Treat them as unallocated; even those not in need can request them (analogous to R. Yehudah).", "tags": ["property-rights", "fairness"]}]}
{"id": "peah-003", "source": "4:1-2", "strength": "prime", "title": "Who Handles Collection of Difficult-to-Access Donations?", "vignette": "A company has pledged bulky or hard-to-reach items (e.g., old servers in a high-security area) for donation. Should the company's staff handle the effort of extracting and preparing these items for the recipients, or must the recipient organizations (e.g., charities for refurbishment) undertake the effort and potential risk themselves?", "options": [{"id": "A", "text": "Company must prepare and hand over items — safety and accessibility first.", "tags": ["public-safety", "altruism", "responsibility"]}, {"id": "B", "text": "Let recipients collect individually; company needn’t actively assist in extraction.", "tags": ["personal-agency", "responsibility"]}]}
{"id": "peah-004", "source": "4:3", "strength": "weak", "title": "Claiming All Unclaimed Shared Resources", "vignette": "At a community giveaway event for surplus goods, one person uses a large bag to try and gather all the items from a table before others can access them.", "options": [{"id": "A", "text": "Let them keep what they gathered — first come, first served.", "tags": ["personal-agency", "responsibility"]}, {"id": "B", "text": "Confiscate the gathered items and ensure fairer distribution (institutional policy).", "tags": ["responsibility", "fairness", "tradition"]}]}
{"id": "peah-005", "source": "4:4", "strength": "weak", "title": "Using Potentially Disruptive Methods in Resource Collection", "vignette": "During a distribution of free resources (e.g., food bank, clothing drive), may recipients use tools or methods (e.g., large carts, aggressive tactics) that could inadvertently hinder or pose a risk to others trying to access the resources?", "options": [{"id": "A", "text": "Permit any methods; allows for quicker collection for those individuals.", "tags": ["personal-agency", "utilitarian"]}, {"id": "B", "text": "Ban disruptive or unsafe methods; prevent harm and ensure fair access.", "tags": ["public-safety", "responsibility", "fairness"]}]}
{"id": "peah-006", "source": "4:5", "strength": "okay", "title": "How Often May Beneficiaries Access a Resource Distribution Point?", "vignette": "Organizers of a food bank set three specific time slots per day for collection. Some beneficiaries want continuous access throughout the day.", "options": [{"id": "A", "text": "Limit to three time slots; prevents crowding and ensures orderly distribution (organizer's policy).", "tags": ["public-safety", "responsibility", "rule-of-law"]}, {"id": "B", "text": "Allow continuous access; maximizes beneficiaries' opportunity (advocate's view).", "tags": ["personal-agency", "altruism", "compassion"]}]}
{"id": "peah-007", "source": "4:6", "strength": "prime", "title": "New Community Member's Obligation for Past Actions", "vignette": "A business owner operated for years without following a local voluntary code of conduct for community reinvestment. After officially joining a business association that upholds this code, they finalize a major project that was initiated before they joined. Must they now apply the code's reinvestment principles to the proceeds of this project?", "options": [{"id": "A", "text": "Exempt — the main work happened before they formally adopted the code (Previous Practice).", "tags": ["property-rights", "due-process", "rule-of-law"]}, {"id": "B", "text": "Obligate for reinvestment; duty attaches upon joining and project completion (New Commitment).", "tags": ["responsibility", "collective-responsibility", "integrity"]}]}
{"id": "peah-008", "source": "4:7-8", "strength": "okay", "title": "Resources Pledged to Public Good, Then Reclaimed", "vignette": "A company pledged a significant donation (e.g., a piece of land) to a public trust for community use. Due to unforeseen circumstances, the company legally reclaimed the asset. Are they still expected to fulfill the original donative intent or a comparable contribution from other assets?", "options": [{"id": "A", "text": "Yes — after reclamation, the ethical obligation to contribute to the community remains.", "tags": ["altruism", "responsibility", "altruism"]}, {"id": "B", "text": "No — at the crucial stage the asset was legally under the public trust's domain and then legally reclaimed; prior specific obligations are void.", "tags": ["rule-of-law", "property-rights", "rule-of-law"]}]}
{"id": "peah-009", "source": "4:9", "strength": "prime", "title": "Allocating Community Support for a Specific Individual", "vignette": "A volunteer distributing company-donated aid packages says, “This package is for Ms. Smith, a known person in need.” Does Ms. Smith gain an immediate right to this specific package?", "options": [{"id": "A", "text": "Yes — the distributor acts on Ms. Smith's behalf, securing her claim (Agent for Recipient).", "tags": ["personal-agency", "altruism", "altruism"]}, {"id": "B", "text": "No — must be given to the next qualifying person in line or per distribution protocol (Fair Process).", "tags": ["fairness", "responsibility", "fairness"]}]}
{"id": "peah-010", "source": "6:1 (hefker)", "strength": "prime", "title": "Resources Declared Available: For Needy Only, or For Everyone?", "vignette": "A company declares a batch of surplus products 'available for community support programs.' Is this declaration valid if it restricts access only to registered non-profits, or must such declarations make resources available to anyone, including other companies or individuals not in need?", "options": [{"id": "A", "text": "Valid — a restricted declaration benefiting the needy is permissible (Targeted Support).", "tags": ["altruism", "collective-responsibility", "responsibility"]}, {"id": "B", "text": "Invalid — declarations of availability must be equal-access for all, needy or not (Open Access).", "tags": ["fairness", "property-rights", "fairness"]}]}
{"id": "peah-011", "source": "6:1 (large sheaf)", "strength": "okay", "title": "Unusually Large Leftover Resource Unit", "vignette": "During a clear-out of old office supplies, most leftover items are small (e.g., single notebooks). However, one large, unopened box containing many notebooks is also found. Does this large box count as 'leftover' for donation, or is it so substantial the company would typically keep it?", "options": [{"id": "A", "text": "Not 'leftover' in the typical sense — company keeps it due to its size/value (Manager's Discretion).", "tags": ["property-rights", "proportionality", "utilitarian"]}, {"id": "B", "text": "'Leftover' — designated for donation (Generous Interpretation).", "tags": ["responsibility", "altruism", "rule-of-law"]}]}
{"id": "peah-012", "source": "6:2", "strength": "okay", "title": "Resource Unit Left Near Obvious Markers", "vignette": "A valuable item intended for donation is accidentally left near a manager's desk or company equipment. Is it considered 'forgotten' and thus available for donation, or assumed to be intentionally placed there for later retrieval by the company?", "options": [{"id": "A", "text": "Not forgotten — owner likely intended to return for it (Presumption of Intent).", "tags": ["property-rights", "prudence"]}, {"id": "B", "text": "Forgotten — available for donation (Standard Procedure for Unclaimed Items).", "tags": ["responsibility", "rule-of-law"]}]}
{"id": "peah-013", "source": "6:5", "strength": "prime", "title": "Threshold for 'Negligible Remnants' Rule", "vignette": "When clearing out project supplies, how many small, leftover items (e.g., individual screws, small software licenses, berries from a community garden harvest) are considered negligible enough for the project owner to keep, versus being set aside for community donation? The rule is 'two or three'.", "options": [{"id": "A", "text": "Two items are for donation; if three are left, the owner keeps them (Stricter Threshold for Donation).", "tags": ["proportionality", "responsibility", "rule-of-law"]}, {"id": "B", "text": "Three items are for donation; if four are left, the owner keeps them (More Lenient Threshold for Donation).", "tags": ["altruism", "fairness", "rule-of-law"]}]}
{"id": "peah-014", "source": "6:6", "strength": "okay", "title": "Two Small Resource Units Equaling a Standard Unit", "vignette": "Two small leftover packages of materials are found. Together, their quantity equals that of a standard, new package. Who are they for – the project owner or the donation pile?", "options": [{"id": "A", "text": "Owner keeps them (Aggregation Principle).", "tags": ["property-rights", "proportionality", "utilitarian"]}, {"id": "B", "text": "Donation pile gets them (Sum of Parts Principle).", "tags": ["responsibility", "altruism", "altruism"]}]}
{"id": "peah-015", "source": "3:1", "strength": "okay", "title": "Scattered Resource Pockets Among Main Assets", "vignette": "A company has small, isolated pockets of surplus materials located between its main operational areas (e.g., leftover supplies in different office sections, small fallow plots of land between cultivated fields). Should a portion be set aside for community donation from each small pocket, or can they be treated as one consolidated area for calculating the donation?", "options": [{"id": "A", "text": "Set aside a portion from every pocket (Granular Contribution).", "tags": ["responsibility", "altruism", "responsibility"]}, {"id": "B", "text": "One consolidated contribution for them all (Aggregated Contribution).", "tags": ["property-rights", "proportionality", "utilitarian"]}]}
{"id": "peah-016", "source": "3:2", "strength": "okay", "title": "Intermittent Resource Generation Pattern", "vignette": "A manufacturing process generates usable byproducts in an intermittent pattern, with periods of no byproduct output in between (e.g., a farmer mows a field in stripes, leaving some strips uncut temporarily). Does each productive phase require a separate allocation of byproducts for community benefit, or is one allocation at the end sufficient?", "options": [{"id": "A", "text": "Yes; each productive phase counts separately for allocation (Phase-based Obligation).", "tags": ["responsibility", "altruism", "responsibility"]}, {"id": "B", "text": "No; one allocation from the total byproducts is sufficient (Outcome-based Obligation).", "tags": ["property-rights", "proportionality", "utilitarian"]}]}
{"id": "peah-017", "source": "3:3", "strength": "weak", "title": "Processing Some Resources Now vs. Storing Others", "vignette": "A food producer processes some fresh produce for immediate sale but leaves the rest to be processed and sold later in a preserved form (e.g., fresh onions vs. dried onions). Is a community share required from both the fresh batch and the later preserved batch?", "options": [{"id": "A", "text": "Two separate community shares – each processing batch is distinct.", "tags": ["responsibility", "responsibility"]}, {"id": "B", "text": "Single community share from the final total processed.", "tags": ["property-rights", "proportionality", "utilitarian"]}]}
{"id": "peah-018", "source": "3:4", "strength": "weak", "title": "Exemption for Resources Used for Future Production", "vignette": "Are resources set aside for future production (e.g., seeds for next season's crop, raw materials for a new product line) also subject to a community share requirement? If such resources are located within a larger area that also produces immediately usable goods, does each sub-area require its own share calculation?", "options": [{"id": "A", "text": "Subject to share; each sub-area must contribute (Universal Application).", "tags": ["responsibility", "altruism"]}, {"id": "B", "text": "Exempt or only one combined share (Business Exemption/Practicality).", "tags": ["property-rights", "utilitarian", "utilitarian"]}]}
{"id": "peah-019", "source": "3:5", "strength": "okay", "title": "Partners Splitting and Re-joining Assets", "vignette": "Two business partners split their jointly owned assets. Do they each need to fulfill community contribution obligations separately from their divided shares? Later, they merge their assets back into a joint venture—how is the obligation handled now?", "options": [{"id": "A", "text": "After division, each must contribute; after re-joining, one combined contribution.", "tags": ["responsibility", "fairness", "rule-of-law"]}, {"id": "B", "text": "Always one contribution—treat the underlying assets' continuity as overriding.", "tags": ["property-rights", "tradition"]}]}
{"id": "peah-020", "source": "3:6", "strength": "weak", "title": "Minimum Asset Size Liable for Community Contribution", "vignette": "How small can a profit-generating unit (e.g., a small project, a tiny plot of land) be and still be expected to contribute a portion to community support? Opinions range from 'a reasonably significant unit' to 'any unit, no matter how small.'", "options": [{"id": "A", "text": "Only reasonably profitable units (Various larger minima based on viability).", "tags": ["proportionality", "property-rights", "simplification"]}, {"id": "B", "text": "Even the tiniest profitable unit is liable (Universal Principle of Contribution).", "tags": ["altruism", "responsibility", "compassion"]}]}
{"id": "peah-021", "source": "5:1-2", "strength": "weak", "title": "Donation Item Mixed into Company's Inventory", "vignette": "An item designated for donation (e.g., a specific 'gleaned' raw material) accidentally gets mixed into the company's main inventory. Can the company substitute another similar item of equal or greater value for the donation, or must it hand over the original specific item, assuming it can be identified?", "options": [{"id": "A", "text": "Substitution permitted—company maintains its inventory integrity (Practicality).", "tags": ["property-rights", "property-rights", "utilitarian"]}, {"id": "B", "text": "No substitution—return the very item to the donation program (Integrity of the Gift).", "tags": ["responsibility", "integrity", "integrity"]}]}
