{"id":"dem-001","source":"1:1","strength":"prime","title":"Trusting the Small-Scale Supplier","vignette":"You buy artisanal products (e.g., handcrafted goods, locally sourced food items) directly from a small, independent producer whose certification for ethical sourcing is unverified. May you use/consume them assuming compliance?","options":[{"id":"A","text":"Use/consume; assume most small producers adhere to ethical standards nowadays.","tags":["trust","personal-agency","practicality"]},{"id":"B","text":"Verify compliance before using/consuming; uncertainty requires caution.","tags":["ethical-obligation","responsibility","due-diligence"]}]}
{"id":"dem-002","source":"1:2","strength":"prime","title":"Distributing Goods of Uncertain Compliance to the Needy","vignette":"A charity receives a donation of food items whose packaging provides no information about allergens or ethical sourcing. May volunteers distribute these items to people in need or to emergency responders?","options":[{"id":"A","text":"Distribute as-is; leniency for those in urgent need.","tags":["altruism","collective-responsibility","utilitarianism"]},{"id":"B","text":"Must verify or procure compliant goods first, even if it means less aid.","tags":["ethical-obligation","responsibility","safety-standards"]}]}
{"id":"dem-003","source":"1:3","strength":"okay","title":"Guest Consuming Products of Uncertain Standards","vignette":"Your host serves a meal and assures you all ingredients meet high ethical/quality standards (e.g., organic, fair-trade), but you have reasons to doubt this based on the packaging you glimpsed. Do you eat to preserve social harmony?","options":[{"id":"A","text":"Trust the host; social peace is more important than your doubts.","tags":["reciprocity","social-harmony","politeness"]},{"id":"B","text":"Decline politely or discretely avoid the questionable items; adherence to your standards comes first.","tags":["ethical-obligation","personal-integrity","health-consciousness"]}]}
{"id":"dem-004","source":"2:1-2","strength":"prime","title":"Ensuring Compliance for Another's Goods Without Consent","vignette":"A friend's shipment of products is temporarily stored at your facility. You suspect they haven't undergone the necessary quality checks. May you arrange for these checks on their behalf without asking, assuming it's for their own good?","options":[{"id":"A","text":"Yes; it's a presumed benefit and protects them from potential issues.","tags":["altruism","responsibility","proactive-help"]},{"id":"B","text":"No; it's their property and responsibility—requires their explicit consent.","tags":["property-rights","autonomy","informed-consent"]}]}
{"id":"dem-005","source":"2:4","strength":"okay","title":"Partial Goods—Insufficient for Full Compliance Check","vignette":"You have a small batch of components for a product, too few to conduct all the standard quality assurance tests that normally require a larger sample size. How to proceed?","options":[{"id":"A","text":"Perform what checks are possible; partial compliance is better than none.","tags":["proportionality","risk-management","best-effort"]},{"id":"B","text":"Do not use until a sufficient quantity for full testing is available.","tags":["quality-standards","responsibility","risk-aversion"]}]}
{"id":"dem-006","source":"3:4-5","strength":"prime","title":"Misleading Product Labeling","vignette":"A vendor labels all their electronics as “Energy Star Compliant.” Later, a customer discovers one device from a batch is not compliant. Should the vendor be held liable for all sales of that product model made that day based on the general labeling?","options":[{"id":"A","text":"Yes; buyers rely on the seller’s representation—vendor should compensate or rectify for all affected sales.","tags":["responsibility","deterrence","consumer-rights","accountability"]},{"id":"B","text":"No; presume it was an isolated error—only that specific device or batch is suspect, pending investigation.","tags":["culpability","proportionality","benefit-of-the-doubt"]}]}
{"id":"dem-007","source":"4:1","strength":"okay","title":"Mixture of Compliant and Non-Compliant Goods","vignette":"Equal batches of certified ethically sourced coffee beans and beans of uncertain origin are accidentally mixed together. Must the entire mixed batch be treated as uncertain or be re-certified?","options":[{"id":"A","text":"Yes; uncertainty affects the entire batch.","tags":["ethical-obligation","quality-control","risk-aversion"]},{"id":"B","text":"Attempt to sample and certify proportionally if possible, or sell as 'mixed source' to avoid waste, with clear labeling.","tags":["proportionality","transparency","waste-reduction"]}]}
{"id":"dem-008","source":"4:6","strength":"weak","title":"Preparing Food with Ingredients of Later-Discovered Uncertain Origin","vignette":"A chef prepares a large batch of stew. After cooking, they receive information that a key ingredient might not meet their advertised 'locally sourced' claim. Serve or discard the stew?","options":[{"id":"A","text":"Serve after attempting to verify the source or clearly label the uncertainty.","tags":["responsibility","utilitarianism","transparency","waste-reduction"]},{"id":"B","text":"Discard the entire batch; the cooking process doesn't resolve the sourcing doubt and reputation is key.","tags":["ethical-standards","brand-integrity","consumer-trust"]}]}
{"id":"dem-009","source":"6:1","strength":"okay","title":"Snack Sales Where Verification is Impractical","vignette":"Passengers on a long-distance train buy snacks from vendors moving through carriages. Verifying the ethical sourcing or allergen information for these snacks is impractical during the journey. Eat now or wait until a stop where verified options might be available?","options":[{"id":"A","text":"Eat; leniency applies due to the circumstances and immediate need.","tags":["self-preservation","practicality","convenience"]},{"id":"B","text":"Wait and verify/buy known items at a station or destination.","tags":["ethical-preference","health-safety","due-diligence"]}]}
{"id":"dem-010","source":"7:1-2","strength":"weak","title":"Goods Bought from Foreign Suppliers in a Regulated Market","vignette":"You purchase electronic components from a supplier based outside your country, where your country has strict environmental regulations for electronics. Should these components be treated as 'uncertain compliance' by default, or are they exempt if the foreign supplier claims adherence to international standards?","options":[{"id":"A","text":"Exempt if supplier provides credible claim of adherence to equivalent international standards.","tags":["rule-of-law","international-agreements","trust-but-verify"]},{"id":"B","text":"Treat as 'uncertain compliance' until independently verified against local regulations.","tags":["responsibility","local-standards","precautionary-principle"]}]}
