{"id":"kil-001","source":"2:1","strength":"prime","title":"Excessive Contaminants in Seed Batch","vignette":"A batch of organic seeds (e.g., wheat) is found to contain a small but significant percentage (e.g., 1/24th by volume, exceeding a 1/60th threshold) of seeds from a genetically modified (GM) variant or a different, undesirable plant species.","options":[{"id":"A","text":"Clean the batch to reduce the contaminant level to below the acceptable regulatory threshold.","tags":["responsibility","proportionality","regulatory-compliance"]},{"id":"B","text":"Ensure every single foreign seed is removed, or discard the entire batch to guarantee purity.","tags":["ethical-principle","absolutism","purity-standard"]}]}
{"id":"kil-002","source":"2:3","strength":"okay","title":"Switching Crop Types Mid-Season in a Controlled Environment","vignette":"A farmer has planted a field with a specific crop variety (e.g., Crop A). Due to market changes, they now want to plant Crop B, which has different soil requirements or could be contaminated by remnants of Crop A if not properly managed.","options":[{"id":"A","text":"Wait for any residue of Crop A to fully decompose or be neutralized before planting Crop B.","tags":["environmental-best-practice","responsibility","cross-contamination-prevention"]},{"id":"B","text":"Plant Crop B immediately for economic reasons, and manage any potential contamination issues later.","tags":["utilitarianism","economic-pressure","risk-management"]}]}
{"id":"kil-003","source":"3:5","strength":"prime","title":"Unintended Species in a Protected Growth Area","vignette":"A carefully cultivated area for a specific valuable plant species (e.g., a research plot for a new grape vine, an organic herb garden) is found to have an invasive or undesirable plant (e.g., a fast-spreading weed, a GM variant of a related crop) sprouting within it.","options":[{"id":"A","text":"Destroy both the valuable plants and the invasive species in the affected zone to prevent any risk of contamination or hybridization, as per strict protocol.","tags":["ethical-principle","absolutism","risk-aversion","protocol-adherence"]},{"id":"B","text":"Carefully remove the invasive/undesirable plants to save the valuable crop, accepting a minimal risk of undetected contamination.","tags":["property-rights","proportionality","resource-preservation"]}]}
{"id":"kil-004","source":"5:7","strength":"okay","title":"Grafting for Agricultural Advantage","vignette":"A fruit grower wishes to graft a branch of a high-yield but disease-prone fruit variety onto the rootstock of a hardier, disease-resistant variety to gain the benefits of both. This is a common agricultural practice but some purists object to any such \"unnatural\" mixing.","options":[{"id":"A","text":"Permit the graft for its clear agricultural and economic benefits.","tags":["utilitarianism","property-rights","innovation","food-security"]},{"id":"B","text":"Ban such cross-variety grafting based on a principle of maintaining 'natural' lineage or avoiding unforeseen ecological consequences.","tags":["ethical-principle","naturalism","precautionary-principle"]}]}
{"id":"kil-005","source":"8:2-4","strength":"prime","title":"Using Incompatible Technologies Together","vignette":"A technician needs to transport sensitive equipment and urgently connects two power sources with different voltage ratings or incompatible interfaces (e.g., an old generator and a modern electronic device) to get the job done, risking damage to the equipment or operator.","options":[{"id":"A","text":"Strictly forbidden; both the person making the connection and anyone authorizing it are liable for damage or safety breaches.","tags":["rule-of-law","deterrence","safety-protocol","accountability"]},{"id":"B","text":"Permit in extreme emergencies (e.g., powering life-support equipment during an outage) if no alternative exists, accepting the risk.","tags":["utilitarianism","public-safety","necessity"]}]}
{"id":"kil-006","source":"8:3","strength":"weak","title":"User's Liability for System Misuse by Operator","vignette":"A system (e.g., a vehicle, a software platform) is operated using an unsafe combination of components (e.g., mismatched tires, conflicting software plugins) by an operator. Is a passive user (e.g., a passenger, someone only receiving data from the system) also liable if they were aware of the unsafe configuration?","options":[{"id":"A","text":"Hold both operator and informed user accountable to encourage vigilance and reporting.","tags":["collective-responsibility","deterrence","shared-accountability"]},{"id":"B","text":"Penalize the operator only; the passive user has limited control or responsibility.","tags":["culpability","proportionality","direct-responsibility"]}]}
{"id":"kil-007","source":"8:5-6","strength":"okay","title":"Breeding Hybrids with Unknown Genetic Background","vignette":"Two hybrid animals (e.g., mules, ligers, or specific dog breeds with mixed ancestry) whose exact genetic parentage is undocumented are available for breeding. There's a concern that breeding them could perpetuate unknown genetic disorders or violate specific breed standards.","options":[{"id":"A","text":"Allow breeding: practical concerns about undocumented lineage make strict prohibition difficult or unproductive. Focus on the health of offspring.","tags":["property-rights","utilitarianism","pragmatism"]},{"id":"B","text":"Forbid breeding animals with indeterminate hybrid backgrounds to maintain lineage purity or avoid potential negative genetic outcomes.","tags":["ethical-principle","rule-of-law","precautionary-principle","breed-standards"]}]}
{"id":"kil-008","source":"9:2","strength":"prime","title":"Violating a Core Principle for Expediency","vignette":"A person needs to transport a valuable item discreetly to avoid high taxes or regulatory scrutiny. They conceal it within a container made of a material that violates a deeply held personal or community ethical standard (e.g., an environmentalist using a rare animal skin, a pacifist using a weapons crate) they publicly champion. The container is not for personal use but solely for this temporary, instrumental purpose.","options":[{"id":"A","text":"Still a violation; the principle is absolute and cannot be compromised for convenience or personal gain.","tags":["ethical-principle","absolutism","integrity"]},{"id":"B","text":"Permissible in this specific context, as there is no intent to personally endorse or benefit from the problematic material itself, and the goal is to overcome an unjust obstacle.","tags":["self-preservation","utilitarianism","ends-justify-means"]}]}
{"id":"kil-009","source":"9:3","strength":"weak","title":"Using Ethically Questionable Materials for Temporary, Non-Personal Use","vignette":"A service provider (e.g., a high-end salon, a historic reenactment group) uses items made of a material combination that some consider ethically problematic due to sourcing or symbolism (e.g., towels with a blend of recycled and rare, non-sustainable fibers; costumes mixing symbols of oppressor and oppressed cultures) for clients or performers. The items are not worn by the provider.","options":[{"id":"A","text":"Allowed, as it's mere handling for a service, not personal adoption or endorsement of the problematic aspect.","tags":["proportionality","property-rights","functional-use"]},{"id":"B","text":"Forbidden; any use or association risks condoning the ethical issue or violating the principle.","tags":["ethical-principle","absolutism","symbolic-association"]}]}
{"id":"kil-010","source":"9:4","strength":"okay","title":"Using Ethically Compromised Materials for a Deceased Person","vignette":"A family is preparing for the burial/commemoration of a loved one. They consider using a shroud or memorial item made from a material combination that is normally against their ethical principles (e.g., a blend of synthetic and natural materials for someone who was a staunch environmentalist, or materials with complex, unverified supply chains).","options":[{"id":"A","text":"Permit; the deceased is beyond worldly concerns and practical considerations or availability may prevail.","tags":["proportionality","respect-for-dead","practicality"]},{"id":"B","text":"Forbid; maintaining ethical principles is a mark of respect for the deceased's values, even in death.","tags":["ethical-principle","symbolic-action","respect-for-values"]}]}
{"id":"kil-011","source":"9:5","strength":"okay","title":"Retailers Displaying Products that Violate an Ethical Standard","vignette":"A clothing vendor models garments made from a combination of materials considered unethical by a segment of their customers (e.g., "fast fashion" items made with exploitative labor and environmentally damaging synthetics, displayed alongside sustainable lines). The vendor's personal use is not the issue, but the act of promoting them.","options":[{"id":"A","text":"Permit if the vendor makes no claim to personally endorse the specific ethical aspect and is merely showing product variety. Disclosure of materials is key.","tags":["property-rights","freedom-of-commerce","transparency","consumer-choice"]},{"id":"B","text":"Ban or discourage—displaying such items inherently promotes them, regardless of personal intent, and can compromise brand ethics.","tags":["ethical-principle","brand-responsibility","social-impact"]}]}
{"id":"kil-012","source":"1:4 + 4:1","strength":"weak","title":"Planting Visually Similar but Genetically Distinct Species Together","vignette":"A gardener plants two types of vegetables (e.g., certain turnip and radish varieties) next to each other. Their leaves are visually indistinguishable, which could lead to issues with seed saving purity or proper crop rotation if they are mistakenly treated as the same. However, they are botanically distinct species.","options":[{"id":"A","text":"Treat as functionally similar for gardening purposes if visual cues are primary for the gardener; practical considerations allow mixing.","tags":["proportionality","utilitarianism","practical-gardening"]},{"id":"B","text":"Visual similarity is irrelevant; their distinct botanical nature means they should be kept separate to maintain genetic purity or avoid specific soil pathogen buildup.","tags":["scientific-classification","genetic-purity","agricultural-best-practice"]}]}
{"id":"kil-013","source":"Y.1:4 / Tos.3:12","strength":"okay","title":"Malicious Contamination of a Specialized Growth Area","vignette":"An aggressor secretly introduces a prohibited or harmful element (e.g., seeds of an invasive weed, a contaminating chemical) into a competitor's valuable, specially cultivated environment (e.g., an organic vineyard, a research greenhouse).","options":[{"id":"A","text":"Destroy the entire contaminated environment (e.g., vineyard and invasive plants) to ensure complete eradication of the problem, as per a strict interpretation of purity rules.","tags":["ethical-principle","deterrence","drastic-measures","purity-standard"]},{"id":"B","text":"Remove or neutralize only the contaminating element and its immediate surroundings if possible, sparing the primary crop/environment. Focus on restitution from the aggressor.","tags":["responsibility","property-rights","proportionality","restorative-justice"]}]}
{"id":"kil-014","source":"Y.9:1","strength":"weak","title":"Outsourcing Ethically Problematic Practices","vignette":"A company owner wants to use a process or material that violates their stated company ethics or local environmental regulations (e.g., using a banned pesticide, sourcing from a non-certified supplier). They hire an external contractor, possibly in a region with laxer rules, to perform this specific part of the production.","options":[{"id":"A","text":"Permit; the company is not directly performing the problematic action. Legal compliance in the jurisdiction of operation is met.","tags":["utilitarianism","rule-of-law","legal-loopholes","outsourcing"]},{"id":"B","text":"Forbid; causing or commissioning an unethical or harmful act is also wrong, regardless of who performs it. Uphold universal principles.","tags":["responsibility","ethical-principle","supply-chain-ethics","accountability"]}]}
{"id":"kil-015","source":"Y.1:4","strength":"weak","title":"Keeping a Product of Past Ethically Questionable Practices","vignette":"A valuable asset (e.g., a mature fruit tree, a research dataset) was created years ago using methods that are now considered unethical or non-compliant (e.g., an illicit cross-graft, data collected without full consent). Must the asset be destroyed or discontinued?","options":[{"id":"A","text":"Destroy/discontinue; any ongoing benefit from the past unethical practice is also forbidden.","tags":["ethical-principle","absolutism","atonement","long-term-consequences"]},{"id":"B","text":"Allow continued use; the unethical act was in the past, and only future such acts are banned. Focus on current compliance and utility.","tags":["property-rights","proportionality","utilitarianism","statute-of-limitations"]}]}
