{"id":"she-001","source":"10:1","strength":"prime","title":"Withholding Loans Near a Debt Forgiveness Deadline","vignette":"As a legally mandated debt forgiveness date (e.g., for certain types of payday loans or student debt after a set period) approaches, a creditor debates whether to extend a new short-term loan that might be cancelled before full repayment.","options":[{"id":"A","text":"Refuse the loan; protect your financial assets from likely cancellation.","tags":["self-preservation","property-rights","financial-risk"]},{"id":"B","text":"Lend anyway, accepting the societal rule of debt forgiveness and potential loss.","tags":["altruism","social-responsibility","ethical-lending"]}]}
{"id":"she-002","source":"10:3","strength":"prime","title":"Using a Legal Waiver to Bypass Debt Cancellation","vignette":"A creditor has the option to have borrowers sign a specific legal waiver (*prozbul* equivalent) at the time of loan origination that exempts this particular debt from an upcoming general debt cancellation/forgiveness program.","options":[{"id":"A","text":"Implement the waiver; retain the right to collect the debt.","tags":["property-rights","rule-of-law","contractual-rights"]},{"id":"B","text":"Do not use the waiver; allow the debt to be cancelled as per the general program's intent.","tags":["collective-responsibility","social-welfare","ethical-consideration"]}]}
{"id":"she-003","source":"10:9","strength":"okay","title":"Debtor Voluntarily Repays After Debt Cancellation","vignette":"After a widespread debt cancellation (e.g., student loan forgiveness), a debtor whose debt was legally cancelled considers whether they should still try to repay the original lender out of a sense of moral obligation.","options":[{"id":"A","text":"Repay if able, due to a personal sense of moral duty or appreciation.","tags":["reciprocity","responsibility","personal-ethics"]},{"id":"B","text":"Keep the money; the debt was legally and fully cancelled. No further obligation exists.","tags":["self-preservation","property-rights","legal-rights"]}]}
{"id":"she-004","source":"8:3","strength":"okay","title":"Commercial Sale of Resources from a 'Commons' Period","vignette":"During a designated 'community access' period (e.g., when a private forest is opened for public foraging of wild berries, or a software project enters a 'community contribution' phase), a person gathers a large quantity of these resources. Should they sell them for significant personal profit?","options":[{"id":"A","text":"Sell freely; the effort of gathering justifies the income, which supports their family.","tags":["utilitarianism","property-rights","entrepreneurship"]},{"id":"B","text":"Limit sales to small, symbolic amounts, or give away the resources, respecting the spirit of the 'commons' period.","tags":["altruism","community-spirit","ethical-commercialization"]}]}
{"id":"she-005","source":"4:2","strength":"okay","title":"Restricting Access to a Resource Area During its 'Rest' Period","vignette":"A landowner is mandated to let their agricultural land lie fallow for a season to regenerate soil, during which time community members are traditionally allowed to glean naturally occurring produce. The landowner debates whether to fence off their land to protect it from overuse or leave it open for all.","options":[{"id":"A","text":"Fence it; safeguard the land and its minimal produce from potential damage or over-harvesting.","tags":["self-preservation","property-rights","resource-management"]},{"id":"B","text":"Leave it open; allow anyone to access it freely as per tradition and communal benefit.","tags":["altruism","collective-responsibility","open-access"]}]}
{"id":"she-006","source":"9:6","strength":"okay","title":"Hoarding 'Commons' Resources After Public Availability Ends","vignette":"Resources from a communal 'fallow period' (e.g., wild fruit, fish from a special open season) are no longer easily found in the wild or common areas. May a family continue to keep a large private stock they gathered, or should these now be shared more widely as the general availability has ceased (the *bi'ur* equivalent)?","options":[{"id":"A","text":"Keep their private stock; what they gathered is theirs by right of effort.","tags":["self-preservation","property-rights","personal-provisioning"]},{"id":"B","text":"Make their surplus available to the community or dispose of it as per rules governing scarce common resources.","tags":["ethical-obligation","responsibility","fair-distribution","community-rules"]}]}
{"id":"she-007","source":"8:4","strength":"weak","title":"Trading 'Commons' Resources for Higher-Value Goods","vignette":"A person has gathered produce during a 'Sabbatical year' type event where resources are meant to be shared freely or at low cost. They trade this easily acquired produce for more luxurious or commercially valuable items, thereby profiting from the special conditions.","options":[{"id":"A","text":"Trade; maximizing personal value is economically rational, within legal bounds.","tags":["utilitarianism","property-rights","economic-rationality"]},{"id":"B","text":"Avoid such trade; consume or share the resources in their original spirit of non-commerciality.","tags":["ethical-principle","respect-for-commons","anti-profiteering"]}]}
{"id":"she-008","source":"7:3","strength":"weak","title":"Bartering 'Restricted Use' Resources for Money, Transferring Restrictions","vignette":"Someone sells a product with 'restricted use' conditions (e.g., software with a non-commercial license, food aid that shouldn't be resold) for cash. The idea is that the cash received now carries the same 'restricted use' conditions (e.g., must be spent on non-commercial activities or similar aid).","options":[{"id":"A","text":"Use the cash for any ordinary purchases; money is fungible and restrictions are hard to trace.","tags":["property-rights","utilitarianism","fungibility","practicality"]},{"id":"B","text":"Spend the cash only on items or activities consistent with the original restrictions.","tags":["ethical-obligation","responsibility","respect-for-conditions","integrity"]}]}
{"id":"she-009","source":"7:4","strength":"weak","title":"Feeding Specially Designated Food to Animals","vignette":"Food that was set aside for a special community purpose (e.g., 'Sabbatical' produce, food bank items meant for human clients) is leftover and could be fed to household animals, though it's still perfectly fit for human consumption.","options":[{"id":"A","text":"Give it to the animals; it's better than letting it go to waste.","tags":["utilitarianism","responsibility","waste-avoidance"]},{"id":"B","text":"Reserve it strictly for its intended human beneficiaries, or dispose of it according to specific rules if it cannot be consumed by them.","tags":["ethical-principle","respect-for-intent","priority-of-need"]}]}
{"id":"she-010","source":"Tosefta 1:8","strength":"weak","title":"Leasing Property to an External Party to Bypass Usage Restrictions","vignette":"A factory owner is required by environmental regulations to halt operations for a period to reduce pollution. The owner considers temporarily leasing the factory to an external company from a region with no such restrictions, allowing production (and pollution) to continue.","options":[{"id":"A","text":"Lease it; maintain income and production via a legal loophole.","tags":["property-rights","utilitarianism","economic-pressure","legal-maneuvering"]},{"id":"B","text":"Refuse; uphold the spirit of the environmental regulation and allow the mandated rest/reduction.","tags":["ethical-principle","collective-responsibility","environmental-stewardship"]}]}
{"id":"she-011","source":"7:6-7","strength":"okay","title":"Paying Workers with Resources from a 'Commons' Period","vignette":"A community project harvests resources from a commonly held area during a designated 'open access' season (e.g., wild berries, fallen wood). The project manager wants to pay volunteers or temporary workers with a share of these gathered resources instead of money.","options":[{"id":"A","text":"Permitted – payment in kind is fair, practical, and utilizes available resources.","tags":["worker-dignity","utilitarianism","barter-economy","resourcefulness"]},{"id":"B","text":"Forbidden – resources from a 'commons' period should not be commodified as wages; compensation should be monetary or from other sources.","tags":["ethical-principle","non-commodification","fair-labor-practices","community-spirit"]}]}
{"id":"she-012","source":"7:1","strength":"weak","title":"Selling 'Commons' Produce by Precise Measure vs. Estimate","vignette":"During a period when local produce is shared widely (Sabbatical year), some people begin selling it. Should they be allowed to sell by precise weight/volume, which implies commercial business, or only by informal estimates (e.g., 'a handful,' 'a small bag') to keep transactions modest and less commercial?","options":[{"id":"A","text":"Allow precise measurement – ensures honest trade and fair value for customers.","tags":["responsibility","property-rights","fair-trade","transparency"]},{"id":"B","text":"Prohibit precise measurement; only informal measures maintain the non-commercial spirit of the period.","tags":["ethical-principle","community-spirit","anti-commercialism"]}]}
{"id":"she-013","source":"5:6","strength":"weak","title":"Giving 'Restricted Community' Food to Outsiders' Animals","vignette":"A household has surplus food items specifically designated for members of their community (e.g., from a co-op buying club with specific membership rules, or 'Sabbatical' produce). May they give some of this surplus to feed the animals of a neighbor who is not part of this community?","options":[{"id":"A","text":"Yes; it's a good use of surplus and better than letting it spoil. An act of general goodwill.","tags":["altruism","utilitarianism","waste-avoidance"]},{"id":"B","text":"No; these resources are specifically for the community members or their dependents only, as per the rules of distribution.","tags":["resource-rules","community-focus","boundary-maintenance","exclusivity-clause"]}]}
