{"id": "ter-001", "source": "8:12", "strength": "prime", "title": "Sacrifice One to Save Many from Violation", "vignette": "A hostile armed group captures several people and issues a demand: “Surrender one person from your group to be subjected to severe harm (e.g., torture, violation), or we will inflict this harm on everyone in the group.”", "options": [{"id": "A", "text": "Comply; sacrifice one individual to spare the larger group from harm.", "tags": ["utilitarian", "self-preservation", "prudence"]}, {"id": "B", "text": "Refuse; it is morally wrong to single out an individual for such harm, even to save others. All will face the consequences together.", "tags": ["absolutism", "collective-responsibility", "absolutism", "self-sacrifice"]}]}
{"id": "ter-002", "source": "Tosefta 7:23 / Yerushalmi 8:4", "strength": "prime", "title": "Surrender a Specific Person or the Community Faces Destruction", "vignette": "An occupying military force surrounds a town and issues an ultimatum: “Hand over a named individual, whom they label a fugitive or enemy of the state, or the entire town will be destroyed.” The townspeople may or may not know if the individual is truly guilty of what they are accused.", "options": [{"id": "A", "text": "Hand the named individual over to save the town and its inhabitants.", "tags": ["utilitarian", "public-safety", "self-preservation", "prudence"]}, {"id": "B", "text": "Refuse to hand the individual over; do not sacrifice a specific person to an uncertain fate, even to save the community. Risk collective punishment.", "tags": ["sanctity-of-life", "collective-responsibility", "absolutism", "compassion"]}]}
{"id": "ter-003", "source": "8:9", "strength": "okay", "title": "Contaminated High-Value Liquid Leaking into General Supply", "vignette": "A barrel of sterile, high-value pharmaceutical liquid (e.g., a vaccine batch, \"Supply A\") is found to be leaking into a much larger, lower vat containing a standard, non-sterile version of a similar product (\"Supply B\"). If Supply A drips slowly, it will gradually contaminate Supply B. However, one could quickly pour a small amount of Supply B into Supply A's barrel, deliberately and more rapidly \"contaminating\" the remainder of Supply A, but potentially saving the bulk of Supply B from being affected by the slow leak.", "options": [{"id": "A", "text": "Yes; actively write off the leaking high-value supply by mixing to prevent a much larger financial loss of the general supply.", "tags": ["property-rights", "utilitarian", "prudence", "utilitarian"]}, {"id": "B", "text": "No; do not deliberately mix. Let the leak proceed and deal with the resulting contamination naturally, potentially losing more of the general supply. Avoid active \"contamination\" of the high-value supply.", "tags": ["rule-of-law", "rule-of-law", "integrity"]}]}
{"id": "ter-004", "source": "8:10", "strength": "okay", "title": "Spilled Hazardous Material on the Ground", "vignette": "A container of valuable but hazardous material (e.g., a rare chemical, a radioactive tracer) tips over and is spilling onto a contaminated surface. One could try to catch some of it with their hands (which are not properly protected and would thus \"contaminate\" what is caught, rendering it less pure or usable only for lower-grade purposes), or let it all soak into the ground and be lost.", "options": [{"id": "A", "text": "Attempt to catch some with unprotected hands, thus salvaging some material albeit in a 'contaminated' or less pure state.", "tags": ["property-rights", "utilitarian", "utilitarian", "environmental-stewardship"]}, {"id": "B", "text": "Do not touch; avoid deliberate contamination or personal exposure, even if it means total loss of the spilled material.", "tags": ["public-safety", "self-preservation", "integrity"]}]}
{"id": "ter-005", "source": "8:8", "strength": "weak", "title": "Sealed Container of Sensitive Material with Suspected Contamination", "vignette": "There's uncertainty whether a sealed container of highly sensitive material (e.g., classified documents, sterile medical supplies) has been compromised (e.g., seal broken and resealed, exposed to damaging conditions). Should one take extra costly precautions to isolate and protect it as if it *is* compromised, or handle it as if it's still perfectly intact/secure?", "options": [{"id": "A", "text": "Take extra precautions (e.g., isolate, re-sterilize, place in secure vault) due to the possibility of compromise.", "tags": ["responsibility", "prudence", "prudence", "responsibility"]}, {"id": "B", "text": "Assume it's fine; handle normally unless clear evidence of compromise is found. Avoid unnecessary costs/effort.", "tags": ["property-rights", "utilitarian", "integrity"]}]}
{"id": "ter-006", "source": "11:9", "strength": "weak", "title": "Feeding Restricted-Access Supplies to a Third-Party's Asset", "vignette": "An authorized individual (e.g., a researcher) is temporarily responsible for an asset belonging to an external party (e.g., a leased lab animal, borrowed equipment requiring special consumables). The individual has access to restricted supplies (e.g., special high-grade animal feed, proprietary lubricants) intended only for their institution's assets. May they use these restricted supplies for the third-party's asset under their care?", "options": [{"id": "A", "text": "Yes; the caretaker may use their institution's restricted supplies as necessary for the asset under their direct management.", "tags": ["utilitarian", "property-rights", "utilitarian", "responsibility"]}, {"id": "B", "text": "No; restricted supplies should not be used for assets not owned by or explicitly covered by the institution's protocols.", "tags": ["rule-of-law", "responsibility", "responsibility", "property-rights"]}]}
{"id": "ter-007", "source": "8:11", "strength": "okay", "title": "Sacrificing One Unit of Sensitive Material to Save Others", "vignette": "A person is transporting several individually sealed packets of sterile medical instruments. An aggressive individual demands: “Hand me one packet so I can open it and expose it to contaminants (rendering it unusable for its intended medical purpose), or I’ll contaminate your entire supply.”", "options": [{"id": "A", "text": "Hand over a single packet to minimize the overall loss of sterile instruments.", "tags": ["utilitarian", "prudence", "prudence", "simplification"]}, {"id": "B", "text": "Refuse; it's wrong to actively participate in the deliberate contamination of medical supplies. Risk losing the whole supply.", "tags": ["absolutism", "personal-agency", "personal-agency"]}]}
{"id": "ter-008", "source": "9:2", "strength": "weak", "title": "Who May Collect Surplus from a Restricted Production Area", "vignette": "Surplus materials (e.g., off-cuts, slightly imperfect items) are available from an area producing goods requiring special handling or certification (e.g., a \"clean room\" for electronics, an organic-certified farm that used some specially sourced \"organic-certified\" seeds). May both uncertified individuals and certified personnel collect these surplus items, or only certified personnel to prevent accidental misuse or mislabeling of the items if they enter general circulation?", "options": [{"id": "A", "text": "Allow anyone to collect; they can use it personally or sell it to certified entities if required, ensuring wider benefit.", "tags": ["reciprocity", "compassion", "utilitarian", "environmental-stewardship"]}, {"id": "B", "text": "Restrict collection to certified personnel only to prevent improper handling, use, or representation of these sensitive-origin items.", "tags": ["responsibility", "responsibility", "prudence", "rule-of-law"]}]}
