{"id":"ter-001","source":"8:12","strength":"prime","title":"Sacrifice One to Save Many from Violation","vignette":"Armed captors hold several people and threaten to harm everyone unless one person is handed over for abuse. Should the group give up one individual to protect the rest?","options":[{"id":"A","text":"Comply; sacrifice one individual to spare the larger group from harm.","tags":["utilitarianism","self-preservation","impossible-choice"]},{"id":"B","text":"Refuse; it is morally wrong to single out an individual for such harm, even to save others. All will face the consequences together.","tags":["moral-principle","collective-responsibility","deontological-ethics","refusal-to-participate-in-evil"]}]}
{"id":"ter-002","source":"Tosefta 7:23 / Yerushalmi 8:4","strength":"prime","title":"Surrender a Specific Person or the Community Faces Destruction","vignette":"A military force surrounds a town and demands that a named resident be surrendered, or the entire town will be destroyed. The townspeople aren't sure the person is guilty. Do they comply?","options":[{"id":"A","text":"Hand the named individual over to save the town and its inhabitants.","tags":["utilitarianism","public-safety","self-preservation","lesser-of-two-evils"]},{"id":"B","text":"Refuse to hand the individual over; do not sacrifice a specific person to an uncertain fate, even to save the community. Risk collective punishment.","tags":["sanctity-of-life","collective-responsibility","moral-stand","asylum"]}]}
{"id":"ter-003","source":"8:9","strength":"okay","title":"Contaminated High-Value Liquid Leaking into General Supply","vignette":"A container of valuable sterile liquid is leaking into a larger vat of ordinary product. Mixing them would sacrifice the sterile portion but save the bulk of the ordinary supply. Should this be done?","options":[{"id":"A","text":"Yes; actively write off the leaking high-value supply by mixing to prevent a much larger financial loss of the general supply.","tags":["property-rights","utilitarianism","loss-mitigation","economic-decision"]},{"id":"B","text":"No; do not deliberately mix. Let the leak proceed and deal with the resulting contamination naturally, potentially losing more of the general supply. Avoid active "contamination" of the high-value supply.","tags":["protocol-adherence","principle-of-non-intervention","material-integrity"]}]}
{"id":"ter-004","source":"8:10","strength":"okay","title":"Spilled Hazardous Material on the Ground","vignette":"A container of hazardous but valuable chemical spills onto a dirty surface. One could catch some bare-handed, contaminating it, or let it all soak into the ground. What's the better choice?","options":[{"id":"A","text":"Attempt to catch some with unprotected hands, thus salvaging some material albeit in a 'contaminated' or less pure state.","tags":["property-rights","utilitarianism","resource-salvage","waste-reduction"]},{"id":"B","text":"Do not touch; avoid deliberate contamination or personal exposure, even if it means total loss of the spilled material.","tags":["safety-protocol","personal-safety","principle-of-purity"]}]}
{"id":"ter-005","source":"8:8","strength":"weak","title":"Sealed Container of Sensitive Material with Suspected Contamination","vignette":"There's uncertainty whether a sealed container of highly sensitive material (e.g., classified documents, sterile medical supplies) has been compromised (e.g., seal broken and resealed, exposed to damaging conditions). Should one take extra costly precautions to isolate and protect it as if it *is* compromised, or handle it as if it's still perfectly intact/secure?","options":[{"id":"A","text":"Take extra precautions (e.g., isolate, re-sterilize, place in secure vault) due to the possibility of compromise.","tags":["responsibility","risk-aversion","precautionary-principle","quality-control"]},{"id":"B","text":"Assume it's fine; handle normally unless clear evidence of compromise is found. Avoid unnecessary costs/effort.","tags":["property-rights","efficiency","presumption-of-integrity"]}]}
{"id":"ter-006","source":"11:9","strength":"weak","title":"Feeding Restricted-Access Supplies to a Third-Party's Asset","vignette":"An authorized individual (e.g., a researcher) is temporarily responsible for an asset belonging to an external party (e.g., a leased lab animal, borrowed equipment requiring special consumables). The individual has access to restricted supplies (e.g., special high-grade animal feed, proprietary lubricants) intended only for their institution's assets. May they use these restricted supplies for the third-party's asset under their care?","options":[{"id":"A","text":"Yes; the caretaker may use their institution's restricted supplies as necessary for the asset under their direct management.","tags":["utilitarianism","property-rights","operational-needs","caretaker-responsibility"]},{"id":"B","text":"No; restricted supplies should not be used for assets not owned by or explicitly covered by the institution's protocols.","tags":["protocol-adherence","responsibility","resource-allocation","misuse-of-assets"]}]}
{"id":"ter-007","source":"8:11","strength":"okay","title":"Sacrificing One Unit of Sensitive Material to Save Others","vignette":"While transporting sterile medical packets, someone threatens to contaminate everything unless given one packet to ruin. Should you hand over one packet to save the rest?","options":[{"id":"A","text":"Hand over a single packet to minimize the overall loss of sterile instruments.","tags":["utilitarianism","loss-minimization","risk-management","pragmatism"]},{"id":"B","text":"Refuse; it's wrong to actively participate in the deliberate contamination of medical supplies. Risk losing the whole supply.","tags":["moral-principle","refusal-to-participate","non-compliance-with-threats"]}]}
{"id":"ter-008","source":"9:2","strength":"weak","title":"Who May Collect Surplus from a Restricted Production Area","vignette":"Surplus materials (e.g., off-cuts, slightly imperfect items) are available from an area producing goods requiring special handling or certification (e.g., a "clean room" for electronics, an organic-certified farm that used some specially sourced "organic-certified" seeds). May both uncertified individuals and certified personnel collect these surplus items, or only certified personnel to prevent accidental misuse or mislabeling of the items if they enter general circulation?","options":[{"id":"A","text":"Allow anyone to collect; they can use it personally or sell it to certified entities if required, ensuring wider benefit.","tags":["reciprocity","accessibility","economic-opportunity","waste-reduction"]},{"id":"B","text":"Restrict collection to certified personnel only to prevent improper handling, use, or representation of these sensitive-origin items.","tags":["quality-control","responsibility","risk-management","protocol-adherence"]}]}
