{"id":"mas-001","source":"1:1-2","strength":"okay","title":"Consuming Raw Materials Before Final Accountability","vignette":"May an employee (e.g., a chef in a restaurant, a factory worker with raw components) consume small amounts of the raw materials they are working with before these materials are formally processed and accounted for (e.g., before ingredients are officially measured for a recipe, before components are logged in inventory for an assembly line)?","options":[{"id":"A","text":"Yes; casual, minor consumption of raw materials on-site is generally overlooked until formal processing begins.","tags":["employee-perks","de-minimis","practicality"]},{"id":"B","text":"No; all materials must be accounted for before any personal consumption to ensure accurate inventory and cost control.","tags":["resource-management","accountability","inventory-control"]}]}
{"id":"mas-002","source":"1:1-2","strength":"okay","title":"Internal Use vs. Commercial Distribution: Timing of Compliance","vignette":"Do resources designated for internal company use (e.g., software tools developed for employees) require adherence to certain standards (e.g., full documentation, security audit) at an earlier stage than resources intended for external market distribution?","options":[{"id":"A","text":"Internal use: full compliance only when formally deployed; Market distribution: full compliance immediately upon creation/packaging.","tags":["internal-policy","external-standards","phased-compliance","risk-assessment"]},{"id":"B","text":"Treat both the same—full compliance is required as soon as the resource is functionally complete, regardless of intended user.","tags":["universal-standards","quality-assurance","consistency"]}]}
{"id":"mas-003","source":"2:1","strength":"prime","title":"Consuming Goods from a Supplier with Questionable Standards","vignette":"An ethically conscious individual is offered a product (e.g., food, clothing) by a neighbor or small supplier whose adherence to fair labor practices or environmental standards is doubtful. May they accept and use the product without personally verifying its ethical passport?","options":[{"id":"A","text":"May use—assume the supplier meets basic standards or out of politeness.","tags":["reciprocity","social-norms","benefit-of-the-doubt","convenience"]},{"id":"B","text":"Must verify or refuse—personal ethical commitments require ensuring standards are met.","tags":["ethical-consumption","responsibility","due-diligence","personal-integrity"]}]}
{"id":"mas-004","source":"2:3","strength":"prime","title":"Worker’s Right to Sample Products During Production","vignette":"A hired worker in a food processing plant (e.g., picking strawberries, sorting candies) wants to sample the products they are handling. Is the worker allowed to consume these items before they have gone through final quality control and packaging (the equivalent of "tithing")?","options":[{"id":"A","text":"Yes; workers are generally permitted to sample the products they directly handle during production.","tags":["worker-dignity","employee-perks","de-minimis-use","quality-feedback"]},{"id":"B","text":"No; all products must pass final quality control and be accounted for before any consumption.","tags":["quality-assurance","inventory-control","company-policy"]}]}
{"id":"mas-005","source":"2:4","strength":"okay","title":"Extending On-the-Job Perks to Worker's Family Members","vignette":"The same production worker sends their child to help them on the line for a day. Does the child also have the right to sample the products before final quality control, like the parent employee?","options":[{"id":"A","text":"No; only the directly contracted employee enjoys such perks. Not transferable.","tags":["responsibility","company-policy","contractual-limits"]},{"id":"B","text":"Yes; the benefit is associated with the work being done, regardless of who specifically performs it, if authorized.","tags":["reciprocity","worker-dignity","family-inclusive-perks-informal"]}]}
{"id":"mas-006","source":"2:6","strength":"okay","title":"Product Sampling Rights After Moving to a Different Company Area","vignette":"Once the products (e.g., freshly picked fruit) are moved from the field/initial processing area into the company’s main storage or packaging facility (equivalent to "employer's enclosed yard"), may the worker who initially handled them still sample them before final quality control/packaging?","options":[{"id":"A","text":"No; entry into the formal facility triggers stricter inventory control and quality assurance protocols. Sampling perks cease.","tags":["rule-of-law","inventory-management","quality-protocol","process-stages"]},{"id":"B","text":"Yes; their sampling right continues as long as the products are not yet in their final packaged state for sale.","tags":["worker-dignity","employee-perks","informal-rules"]}]}
{"id":"mas-007","source":"5:1","strength":"weak","title":"Relocating Partially Processed Goods: Does it Trigger Re-Verification?","vignette":"If a company moves partially assembled electronic components from one workshop and incorporates them into a new sub-assembly in another workshop, must these components undergo a full quality/compliance check twice (once before the move, and again after incorporation into the new sub-assembly)?","options":[{"id":"A","text":"Yes; incorporating them into a new stage or product line creates a new compliance checkpoint.","tags":["quality-assurance","process-control","regulatory-oversight","double-check"]},{"id":"B","text":"No; once components pass an initial quality check, their status is maintained unless modified. Avoid redundant checks.","tags":["efficiency","lean-manufacturing","trust-in-prior-checks"]}]}
{"id":"mas-008","source":"5:2","strength":"okay","title":"Selling Unverified Goods to a Buyer Known for Lax Standards","vignette":"May a producer sell raw materials or components that have not yet undergone mandatory safety/quality checks to a buyer who is suspected of skipping these checks to save costs?","options":[{"id":"A","text":"Prohibited; the seller must ensure their products meet standards before sale to prevent downstream violations or harm.","tags":["responsibility","supply-chain-ethics","public-safety","ethical-sourcing"]},{"id":"B","text":"Permitted; the buyer bears full responsibility for compliance once they take ownership. Seller is not their enforcer.","tags":["personal-agency","property-rights","caveat-emptor","market-freedom"]}]}
{"id":"mas-009","source":"5:4","strength":"weak","title":"Compliance Duties for Products from Disputed/Annexed Territories","vignette":"Products are manufactured in a territory that was recently annexed or whose legal status is disputed (analogous to "Syria" in the text). Must these products adhere to the stringent safety/quality standards of the primary regulating body (analogous to "head office"), or can they follow potentially laxer local rules?","options":[{"id":"A","text":"Yes; the territory is now under the primary body's jurisdiction, so its standards apply.","tags":["regulatory-scope","legal-integration","consumer-protection","uniform-standards"]},{"id":"B","text":"No; the obligation to meet the primary body's standards only applies to its core, undisputed territory. Local rules suffice.","tags":["property-rights","rule-of-law","jurisdictional-limits","local-autonomy"]}]}
{"id":"mas-010","source":"3:1-2","strength":"okay","title":"Worker's Sampling Perk When Employer Provides Meals","vignette":"Production workers who handle food items (e.g., in a bakery, a cannery) are normally allowed to sample the items during their shift. If their employment contract explicitly includes free catered meals provided by the employer, do they still retain the right to sample products directly from the production line before final quality control?","options":[{"id":"A","text":"Yes – the right to sample items they handle is a separate, customary perk, even if meals are provided.","tags":["worker-dignity","employee-benefits","customary-practice","job-satisfaction"]},{"id":"B","text":"No – once comprehensive meals are supplied, the perk of sampling items from the line (before they are accounted for) is implicitly revoked or redundant.","tags":["property-rights","company-policy","contract-terms","resource-control"]}]}
{"id":"mas-011","source":"3:4","strength":"weak","title":"Finding Unaccounted-For Products Near a Production Area","vignette":"Someone discovers a small batch of finished products (e.g., cut figs, packaged snacks) lying unattended near a factory's loading dock or a farm's drying area. Can they take and consume these items, assuming they are "unaccounted for" or "abandoned," or must they treat them as company/owner property requiring proper clearance?","options":[{"id":"A","text":"Take and consume – they appear to be minor, ownerless items, like production surplus or samples, exempt from formal accounting.","tags":["property-rights","finders-keepers-informal","de-minimis","assumption-of-abandonment"]},{"id":"B","text":"Leave them or report them – presume they belong to the company/owner and taking them without clearance would be unauthorized.","tags":["responsibility","respect-for-property","honesty","company-policy"]}]}
