{"id":"mas-001","source":"1:1-2","strength":"okay","title":"Field snacking before tax assessment","vignette":"A grower walking through his orchard nibbles on fruit that has not yet been officially weighed or assessed for the required produce tax. Is this casual snacking allowed before the crop is fully harvested?","options":[{"id":"A","text":"Yes; casual field snacking is exempt until full ripeness.","tags":["self-preservation","religious-duty"]},{"id":"B","text":"No; all edible produce requires assessment first.","tags":["sanctity-of-life","responsibility"]}]}
{"id":"mas-002","source":"1:1-2","strength":"okay","title":"Home consumption versus market sale","vignette":"Baskets picked for the farmer’s kitchen table and crates destined for a wholesaler leave the field together. Does the produce tax become due at different times for home-use fruit versus market fruit?","options":[{"id":"A","text":"Home use: assess only after bringing inside; Market: assess immediately.","tags":["property-rights","responsibility"]},{"id":"B","text":"Treat both the same—obligated the moment they are picked.","tags":["rule-of-law","religious-duty"]}]}
{"id":"mas-003","source":"2:1","strength":"prime","title":"Eating produce of uncertain compliance","vignette":"A meticulous diner is offered fresh fruit by a neighbour whose compliance with the produce-tax rules is doubtful. May the guest eat without checking or paying the tax himself?","options":[{"id":"A","text":"May eat—assume the host already assessed.","tags":["reciprocity","personal-agency"]},{"id":"B","text":"Must re-assess—personal obligation outweighs courtesy.","tags":["religious-duty","responsibility"]}]}
{"id":"mas-004","source":"2:3","strength":"prime","title":"Harvester’s right to snack on the job","vignette":"An employee picking figs wants to eat some straight off the tree during work hours. Is he permitted to eat produce that has not yet been assessed for tax?","options":[{"id":"A","text":"Yes; labourers may eat the produce they handle.","tags":["worker-dignity","self-preservation"]},{"id":"B","text":"No; the tax must be paid before any eating.","tags":["religious-duty","property-rights"]}]}
{"id":"mas-005","source":"2:4","strength":"okay","title":"Extending the snack perk to a substitute","vignette":"The contracted picker sends his teenage child to finish the shift. Does the substitute have the same right to snack on unassessed produce?","options":[{"id":"A","text":"No; only the actual labourer enjoys the exemption.","tags":["responsibility","property-rights"]},{"id":"B","text":"Yes; the benefit follows the contract, not the person.","tags":["reciprocity","worker-dignity"]}]}
{"id":"mas-006","source":"2:6","strength":"okay","title":"Crossing into the processing yard","vignette":"Once the fruit is carried inside the employer’s fenced packing yard, may the picker still snack before the produce tax is paid?","options":[{"id":"A","text":"No; enclosure triggers the tax obligation.","tags":["rule-of-law","responsibility"]},{"id":"B","text":"Yes; the eating right continues until final processing.","tags":["worker-dignity","property-rights"]}]}
{"id":"mas-007","source":"5:1","strength":"weak","title":"Replanting and tax reset","vignette":"Vegetables are uprooted and replanted in a new plot to extend their growing season. Must the grower pay the produce tax twice—before and after replanting?","options":[{"id":"A","text":"Yes; replanting starts a new obligation cycle.","tags":["religious-duty","culpability"]},{"id":"B","text":"No; once assessed, produce is discharged forever.","tags":["property-rights","rule-of-law"]}]}
{"id":"mas-008","source":"5:2","strength":"okay","title":"Selling unassessed produce to a lax buyer","vignette":"A farmer wants to sell freshly picked, untaxed produce to a buyer known for ignoring the produce-tax requirement. Must the farmer assess the tax first?","options":[{"id":"A","text":"Prohibited; seller must assess first to prevent misuse.","tags":["responsibility","public-safety"]},{"id":"B","text":"Permitted; buyer bears his own legal duty.","tags":["personal-agency","property-rights"]}]}
{"id":"mas-009","source":"5:4","strength":"weak","title":"Produce grown in a special economic zone","vignette":"Crops are grown just across the border in a territory with partial legal status. Do the produce-tax rules apply before eating?","options":[{"id":"A","text":"Yes; the zone is treated like the home jurisdiction for tax purposes.","tags":["religious-duty","collective-responsibility"]},{"id":"B","text":"No; the obligation applies only within the core region.","tags":["property-rights","rule-of-law"]}]}
{"id":"mas-010","source":"3:1-2","strength":"okay","title":"Worker snacks when meals are provided","vignette":"Harvest workers usually snack in the field, but this contract already includes cooked meals at the farmhouse. Do they still have the right to eat unassessed produce while picking?","options":[{"id":"A","text":"Yes – labour law grants workers produce they handle, even when meals are supplied.","tags":["worker-dignity","self-preservation"]},{"id":"B","text":"No – once meals are supplied, snacking on unassessed produce is forbidden.","tags":["property-rights","rule-of-law"]}]}
{"id":"mas-011","source":"3:4","strength":"weak","title":"Found produce near a drying area","vignette":"Someone finds cut figs lying beside a drying mat next to a public path. May he take and eat them without paying the produce tax, or must he treat them as someone else’s property?","options":[{"id":"A","text":"Take and eat – they count as ownerless gleanings, exempt from tax.","tags":["property-rights","self-preservation"]},{"id":"B","text":"Leave (or assess) – presume an owner; taking without assessment is theft.","tags":["responsibility","rule-of-law"]}]}
