{"id": "mas-001", "source": "1:1", "strength": "weak", "title": "Bartering Restricted-Use Goods", "vignette": "In a designated project zone, Person A has project-specific supplies (e.g., special nutritional supplements for a health project) and says to Person B: \"Here are some of my project supplements; give me some of your project's educational materials in exchange.\" Both items were acquired with restricted grant funds for their respective projects.", "options": [{"id": "A", "text": "Barter is fine – an equal-value swap benefits both projects within the zone.", "tags": ["property-rights", "reciprocity", "utilitarian", "collaboration"]}, {"id": "B", "text": "Forbidden; restricted-use items may only be used for their specific project or distributed as per grant rules, not bartered.", "tags": ["responsibility", "rule-of-law"]}]}
{"id": "mas-002", "source": "1:2", "strength": "okay", "title": "Community Asset Earmarked, Then Redirected", "vignette": "A coordinator manages livestock bought with a community development grant. She considers using the prize calf as collateral for her personal loan. The grant agreement bars private use of project assets. Is the pledge valid?", "options": [{"id": "A", "text": "Valid – the asset has recognized monetary worth and can be used.", "tags": ["property-rights", "utilitarian"]}, {"id": "B", "text": "Invalid; assets designated for community or special purposes may not be used for private, unrelated transactions.", "tags": ["responsibility", "property-rights", "trust", "integrity"]}]}
{"id": "mas-003", "source": "1:3–4", "strength": "okay", "title": "High-Value By-product from Restricted Purchase", "vignette": "Grant money restricted to Zone A buys steers for a nutrition program. The hides, now worth more than the beef, are left over. Must the hide revenue stay in Zone A, or can organisers spend it anywhere?", "options": [{"id": "A", "text": "The byproduct is unrestricted; the project manager or organization can sell it and use the profit freely.", "tags": ["property-rights", "utilitarian", "responsibility"]}, {"id": "B", "text": "The byproduct retains the restricted status; its value must also be reinvested or used within the designated project area/purpose.", "tags": ["responsibility", "utilitarian", "integrity"]}]}
{"id": "mas-004", "source": "1:5–6", "strength": "weak", "title": "Accidental Purchase of Non-Approved Items with Restricted Funds", "vignette": "Someone accidentally uses restricted grant funds to purchase items not permitted by the grant terms (e.g., decorative items instead of essential supplies).", "options": [{"id": "A", "text": "The purchase stands; use the items for the project in the designated area anyway, if possible. Make a note of the error.", "tags": ["proportionality", "prudence", "responsibility", "utilitarian"]}, {"id": "B", "text": "The purchase is void; the funds must be restored to their restricted status (e.g., reimburse the grant), and the non-approved items should be disposed of or returned.", "tags": ["rule-of-law", "responsibility", "integrity"]}]}
{"id": "mas-005", "source": "1:7", "strength": "okay", "title": "Switching Restricted Operating Cash to Capital Spend", "vignette": "Budget line \"Consumables – Zone A\" is used to buy a 3-year freezer instead of food. Finance asks whether the manager can keep the freezer or must move an equivalent sum back into the consumables account.", "options": [{"id": "A", "text": "Transaction valid – treat the asset as an investment that will support future project activities/consumables.", "tags": ["property-rights", "utilitarian", "prudence", "responsibility"]}, {"id": "B", "text": "Prohibited or requires special approval; must allocate an equivalent sum from appropriate budget lines to cover the intended consumables, or justify the change. The original funds were for immediate project needs.", "tags": ["responsibility", "rule-of-law"]}]}
{"id": "mas-006", "source": "2:1–2", "strength": "okay", "title": "Personal Use of Program Supplies in Harsh Field Conditions", "vignette": "Aid workers in a desert clinic have high-grade cooking oil meant for beneficiary rations. One staffer wants a bottle for skin protection against the sun. Supplies are tightly tracked. Is that private use allowed?", "options": [{"id": "A", "text": "Yes; such ancillary personal use counts as valid utilization of the supplies under broad interpretation of \"use.\"", "tags": ["personal-agency", "prudence", "worker-dignity", "simplification"]}, {"id": "B", "text": "No; the supplies must be strictly used for their primary intended purpose (e.g., ingestion for nutrition).", "tags": ["responsibility", "legalism", "property-rights"]}]}
{"id": "mas-007", "source": "3:1", "strength": "weak", "title": "Compensating for Transport of Restricted Goods with Those Same Goods", "vignette": "A project manager asks a colleague to transport valuable, restricted-use project supplies (e.g., medical supplies for a clinic in a remote \"designated zone\") to the designated location. Can the manager offer a portion of these same supplies as compensation for the transport service?", "options": [{"id": "A", "text": "Yes; it's fair in-kind compensation for labor and logistical costs.", "tags": ["worker-dignity", "reciprocity", "property-rights", "fairness"]}, {"id": "B", "text": "No; giving a share as payment turns the restricted goods into a bartered commodity, violating their terms of use. Compensation should be from a separate, unrestricted source.", "tags": ["responsibility", "integrity", "rule-of-law"]}]}
{"id": "mas-008", "source": "3:3", "strength": "okay", "title": "Unaccredited Vendor Inside the Spend-Zone", "vignette": "Restricted project coins must be spent inside Zone A. A pop-up stall sells the exact building materials the team needs but has no formal licence. May the team buy there or must they source only from listed vendors?", "options": [{"id": "A", "text": "Permitted – treat the funds like cash for approved purchases within the zone; the vendor's status is secondary as long as the goods are used correctly.", "tags": ["utilitarian", "property-rights", "altruism", "prudence"]}, {"id": "B", "text": "Forbidden – using unaccredited vendors risks lack of quality control, improper documentation, or misuse of funds, undermining the project's integrity.", "tags": ["rule-of-law", "prudence", "trust", "responsibility"]}]}
{"id": "mas-009", "source": "3:5", "strength": "weak", "title": "Taking Restricted-Use Items Outside Designated Zone After Entry", "vignette": "A grant requires certain project supplies (e.g., leftover high-nutrient food supplements) to be consumed or utilized only within a specific project zone (\"designated zone\"). After these supplies have been brought into the zone, can a project worker take them back to their home outside the zone if they intend to return with them later or use them for project purposes while temporarily away?", "options": [{"id": "A", "text": "Allowed if the intent is to use them for the project or return them to the zone. Temporary removal is acceptable.", "tags": ["simplification", "property-rights", "culpability"]}, {"id": "B", "text": "Disallowed; once officially brought into the designated zone, these specific items are 'locked in' and must be used or disposed of within that zone.", "tags": ["responsibility", "rule-of-law", "legalism"]}]}
{"id": "mas-010", "source": "3:6", "strength": "prime", "title": "Transit Through the Spend-Zone", "vignette": "Shipment of lab reagents purchased with Zone A funds passes briefly through Zone A en route to Zone B, where they are scheduled for use. Does the stopover lock the reagents into Zone A usage?", "options": [{"id": "A", "text": "Yes (Strict Interpretation) – mere entry into the designated zone triggers the use restriction for those specific items.", "tags": ["rule-of-law", "legalism", "responsibility"]}, {"id": "B", "text": "No (Flexible Interpretation) – if the primary intention and approval were for use in Zone B, mere transit through Zone A doesn't alter that. The restriction applies to final designated use, not incidental transit.", "tags": ["proportionality", "property-rights", "culpability", "simplification"]}]}
{"id": "mas-011", "source": "3:9", "strength": "okay", "title": "Insurance Payout on Spoiled Restricted Goods", "vignette": "A batch of Zone-A-only produce spoils en route and the insurer pays cash. Must that payout now be spent inside Zone A on replacement produce, or can managers source substitutes wherever is practical?", "options": [{"id": "A", "text": "Replacement funds must be spent within the original designated zone (unless the damage was so severe and occurred far outside, making it impractical).", "tags": ["responsibility", "utilitarian", "tradition", "rule-of-law"]}, {"id": "B", "text": "Replacement funds can be used more flexibly, especially if the compromise occurred outside the zone (unless it was minor and happened within the zone).", "tags": ["proportionality", "prudence", "utilitarian"]}]}
{"id": "mas-012", "source": "3:13", "strength": "weak", "title": "Does Packaging of Restricted Goods Also Become Restricted?", "vignette": "A supplier sells project-specific, restricted-use liquids in special, sealed containers. After the liquid is used according to project rules, do the empty containers themselves also gain a restricted status and need to be handled or disposed of according to project protocols?", "options": [{"id": "A", "text": "Yes; the value and nature of the container are tied to the restricted contents. It should be managed accordingly.", "tags": ["responsibility", "rule-of-law", "environmental-stewardship", "prudence"]}, {"id": "B", "text": "No; only the contents were restricted. The empty container is general waste or can be repurposed freely.", "tags": ["property-rights", "utilitarian", "environmental-stewardship", "integrity"]}]}
{"id": "mas-013", "source": "4:1", "strength": "okay", "title": "Admin Surcharge on Converting Restricted Items", "vignette": "A supervisor redeems leftover restricted supplies bought by a junior staffer, converting them back to general funds. Normally a 20% admin fee applies when you redeem your own stock. Does the fee also apply here?", "options": [{"id": "A", "text": "Yes; treat the subordinate's project expense like one's own for administrative purposes, including the surcharge.", "tags": ["responsibility", "integrity", "simplification", "rule-of-law"]}, {"id": "B", "text": "No; the surcharge applies only when converting items from one's own direct budget allocation, not a subordinate's.", "tags": ["property-rights", "proportionality", "responsibility", "rule-of-law"]}]}
{"id": "mas-014", "source": "4:2", "strength": "weak", "title": "Exchanging Small Denomination Restricted Funds for Larger to Avoid Fees", "vignette": "A project has many small amounts of restricted funds from various small activities that are inconvenient to manage and would each incur a fee if converted separately. The project accountant exchanges all these small amounts for a single large-denomination voucher or sum of the same restricted type, partly to avoid multiple conversion fees.", "options": [{"id": "A", "text": "Permitted; any consolidation that simplifies management and reduces administrative burden is valid.", "tags": ["utilitarian", "simplification"]}, {"id": "B", "text": "Forbidden if the primary aim is to evade the standard conversion fees that would apply to multiple small sums.", "tags": ["responsibility", "rule-of-law", "deterrence", "integrity"]}]}
