{"id":"mas-001","source":"1:1","strength":"weak","title":"Bartering Restricted-Use Goods","vignette":"In a designated project zone, Person A has project-specific supplies (e.g., special nutritional supplements for a health project) and says to Person B: “Here are some of my project supplements; give me some of your project's educational materials in exchange.” Both items were acquired with restricted grant funds for their respective projects.","options":[{"id":"A","text":"Barter is fine – an equal-value swap benefits both projects within the zone.","tags":["property-rights","reciprocity","resource-optimization","inter-project-cooperation"]},{"id":"B","text":"Forbidden; restricted-use items may only be used for their specific project or distributed as per grant rules, not bartered.","tags":["grant-rules","accountability","resource-management","protocol-adherence"]}]}
{"id":"mas-002","source":"1:2","strength":"okay","title":"Using Specially Designated Assets for Personal Commitments","vignette":"A person responsible for managing community assets (e.g., livestock purchased with a community development grant – a "tithe-calf" equivalent) attempts to use one of these assets (e.g., a prize animal) to fulfill a personal obligation, like a dowry or a pledge for a personal loan.","options":[{"id":"A","text":"Valid – the asset has recognized monetary worth and can be used.","tags":["property-rights","personal-use-of-assets","economic-value"]},{"id":"B","text":"Invalid; assets designated for community or special purposes may not be used for private, unrelated transactions.","tags":["fiduciary-duty","misuse-of-assets","public-trust","ethical-breach"]}]}
{"id":"mas-003","source":"1:3–4","strength":"okay","title":"Byproduct Value from Specially Funded Purchase","vignette":"Funds from a restricted grant (earmarked for "consumption in designated zone") are used to purchase a resource for a community project (e.g., an animal for a food program). After the primary use, a byproduct (e.g., the animal's hide, leftover building materials) has significant market value, potentially more than the primary product.","options":[{"id":"A","text":"The byproduct is unrestricted; the project manager or organization can sell it and use the profit freely.","tags":["property-rights","utilitarianism","profit-generation","resource-management"]},{"id":"B","text":"The byproduct retains the restricted status; its value must also be reinvested or used within the designated project area/purpose.","tags":["grant-rules","accountability","reinvestment","ethical-sourcing"]}]}
{"id":"mas-004","source":"1:5–6","strength":"weak","title":"Accidental Purchase of Non-Approved Items with Restricted Funds","vignette":"Someone accidentally uses restricted grant funds (e.g., "tithe-coins") to purchase items not permitted by the grant terms (e.g., decorative items instead of essential supplies, like "water or salt" in the original, which can be essential but sometimes also generic/non-essential).","options":[{"id":"A","text":"The purchase stands; use the items for the project in the designated area anyway, if possible. Make a note of the error.","tags":["proportionality","practicality","minor-infraction","resource-utilization"]},{"id":"B","text":"The purchase is void; the funds must be restored to their restricted status (e.g., reimburse the grant), and the non-approved items should be disposed of or returned.","tags":["grant-compliance","accountability","protocol-adherence","financial-integrity"]}]}
{"id":"mas-005","source":"1:7","strength":"okay","title":"Buying Long-Term Assets with Funds for Consumables","vignette":"A project manager uses funds designated for operational costs or consumables (like "second-tithe money" for food in designated zone) to purchase a long-term asset (e.g., a piece of equipment, a plot of land for future project use).","options":[{"id":"A","text":"Transaction valid – treat the asset as an investment that will support future project activities/consumables.","tags":["property-rights","strategic-investment","long-term-planning","asset-acquisition"]},{"id":"B","text":"Prohibited or requires special approval; must allocate an equivalent sum from appropriate budget lines to cover the intended consumables, or justify the change. The original funds were for immediate project needs.","tags":["grant-rules","budget-compliance","accountability","financial-stewardship"]}]}
{"id":"mas-006","source":"2:1–2","strength":"okay","title":"Using Consumable Project Supplies for Ancillary Personal Use","vignette":"May a aid worker stationed in a remote project area use project-funded consumable supplies (e.g., special high-quality olive oil meant for nutritional programs) for a related but personal ancillary purpose, like skin moisturizer, given the harsh conditions? The supplies are meant to be "eaten, drunk, or anointed" in some interpretations.","options":[{"id":"A","text":"Yes; such ancillary personal use counts as valid utilization of the supplies under broad interpretation of "use."","tags":["personal-agency","practicality","employee-welfare","flexible-interpretation"]},{"id":"B","text":"No; the supplies must be strictly used for their primary intended purpose (e.g., ingestion for nutrition).","tags":["grant-rules","strict-adherence","resource-allocation","intended-use"]}]}
{"id":"mas-007","source":"3:1","strength":"weak","title":"Compensating for Transport of Restricted Goods with Those Same Goods","vignette":"A project manager asks a colleague to transport valuable, restricted-use project supplies (e.g., medical supplies for a clinic in a remote "designated zone") to the designated location. Can the manager offer a portion of these same supplies as compensation for the transport service?","options":[{"id":"A","text":"Yes; it's fair in-kind compensation for labor and logistical costs.","tags":["worker-dignity","reciprocity","barter","practical-compensation"]},{"id":"B","text":"No; giving a share as payment turns the restricted goods into a bartered commodity, violating their terms of use. Compensation should be from a separate, unrestricted source.","tags":["grant-rules","non-commodification","protocol-adherence","financial-purity"]}]}
{"id":"mas-008","source":"3:3","strength":"okay","title":"Using Restricted Funds with Unaccredited Vendors","vignette":"A person has special project funds (e.g., "tithe-coins") that must be spent in a designated zone. They want to buy necessary project supplies from a local vendor within the zone who is not officially accredited by the funding agency or lacks formal business registration (an "unaccredited vendor" equivalent).","options":[{"id":"A","text":"Permitted – treat the funds like cash for approved purchases within the zone; the vendor's status is secondary as long as the goods are used correctly.","tags":["utilitarianism","property-rights","local-economy-support","practical-sourcing"]},{"id":"B","text":"Forbidden – using unaccredited vendors risks lack of quality control, improper documentation, or misuse of funds, undermining the project's integrity.","tags":["grant-compliance","risk-management","vendor-accreditation","financial-oversight"]}]}
{"id":"mas-009","source":"3:5","strength":"weak","title":"Taking Restricted-Use Items Outside Designated Zone After Entry","vignette":"A grant requires certain project supplies (e.g., leftover high-nutrient food supplements) to be consumed or utilized only within a specific project zone ("designated zone"). After these supplies have been brought into the zone, can a project worker take them back to their home outside the zone if they intend to return with them later or use them for project purposes while temporarily away?","options":[{"id":"A","text":"Allowed if the intent is to use them for the project or return them to the zone. Temporary removal is acceptable.","tags":["flexibility","property-rights","intent-matters","practical-application"]},{"id":"B","text":"Disallowed; once officially brought into the designated zone, these specific items are 'locked in' and must be used or disposed of within that zone.","tags":["grant-rules","protocol-adherence","geofencing","strict-compliance"]}]}
{"id":"mas-010","source":"3:6","strength":"prime","title":"Goods That Only Transited Through a Designated Use Zone","vignette":"A shipment of project materials, purchased with restricted funds requiring their use in "Zone A," passes through Zone A in transit to another location (Zone B) and then leaves Zone A. Do these materials now acquire a permanent restriction requiring them to be used only in Zone A, even if originally intended for Zone B (as part of a multi-zone project)?","options":[{"id":"A","text":"Yes (Strict Interpretation) – mere entry into the designated zone triggers the use restriction for those specific items.","tags":["protocol-adherence","strict-interpretation","geofencing","chain-of-custody"]},{"id":"B","text":"No (Flexible Interpretation) – if the primary intention and approval were for use in Zone B, mere transit through Zone A doesn't alter that. The restriction applies to final designated use, not incidental transit.","tags":["proportionality","property-rights","intent-matters","logistical-flexibility"]}]}
{"id":"mas-011","source":"3:9","strength":"okay","title":"Compromised Restricted Goods: Where to Use Replacement Funds","vignette":"Project supplies purchased with restricted funds (e.g., "second-tithe fruit") become damaged or compromised ("unclean"). The items are insured, and the insurance pays out their value. Must this insurance money be spent on replacement supplies only within the original designated project zone ("designated zone"), or can it be used elsewhere if, for example, the compromise happened outside the zone?","options":[{"id":"A","text":"Replacement funds must be spent within the original designated zone (unless the damage was so severe and occurred far outside, making it impractical).","tags":["grant-rules","reinvestment-in-situ","continuity-of-purpose","location-restriction"]},{"id":"B","text":"Replacement funds can be used more flexibly, especially if the compromise occurred outside the zone (unless it was minor and happened within the zone).","tags":["proportionality","practicality","fungibility-of-money","risk-location"]}]}
{"id":"mas-012","source":"3:13","strength":"weak","title":"Does Packaging of Restricted Goods Also Become Restricted?","vignette":"A supplier sells project-specific, restricted-use liquids (e.g., "tithe-wine") in special, sealed containers. After the liquid is used according to project rules, do the empty containers themselves also gain a restricted status and need to be handled or disposed of according to project protocols?","options":[{"id":"A","text":"Yes; the value and nature of the container are tied to the restricted contents. It should be managed accordingly.","tags":["responsibility","protocol-adherence","waste-management-for-special-items","holistic-view"]},{"id":"B","text":"No; only the contents were restricted. The empty container is general waste or can be repurposed freely.","tags":["property-rights","utilitarianism","practical-waste-disposal","focus-on-contents"]}]}
{"id":"mas-013","source":"4:1","strength":"okay","title":"Manager Approves Expense for a Subordinate's Restricted Fund Purchase","vignette":"A project manager is authorizing the "redemption" (conversion to general funds, often with a fee) of restricted-budget items purchased by a junior team member for project use. When "redeeming" one's own project expenses, a standard 20% administrative surcharge is usually added. Does the manager need to apply this surcharge when the expense was incurred by their subordinate?","options":[{"id":"A","text":"Yes; treat the subordinate's project expense like one's own for administrative purposes, including the surcharge (R. Yehuda's view).","tags":["managerial-responsibility","consistency","administrative-overhead","policy-application"]},{"id":"B","text":"No; the surcharge applies only when converting items from one's own direct budget allocation, not a subordinate's (Tanna Kamma's view).","tags":["property-rights","proportionality","delegated-budget-autonomy","specific-application"]}]}
{"id":"mas-014","source":"4:2","strength":"weak","title":"Exchanging Small Denomination Restricted Funds for Larger to Avoid Fees","vignette":"A project has many small amounts of restricted funds (e.g., "tithe coins" from various small activities) that are inconvenient to manage and would each incur a fee if converted ("redeemed") separately. The project accountant exchanges all these small amounts for a single large-denomination voucher or sum of the same restricted type, partly to avoid multiple conversion fees (the "one-fifth surcharge").","options":[{"id":"A","text":"Permitted; any consolidation that simplifies management and reduces administrative burden is valid (The experts' view).","tags":["utilitarianism","efficiency","administrative-simplification","cost-saving"]},{"id":"B","text":"Forbidden if the primary aim is to evade the standard conversion fees that would apply to multiple small sums (Scholar M's view).","tags":["responsibility","rule-of-law","deterrence-of-evasion","financial-integrity"]}]}
