{"id":"hal-001","source":"1:1","strength":"okay","title":"Quietly merging untaxed batches","vignette":"Two neighbours each mix a small quantity of dough, both below the weight that triggers a mandatory food-donation. One person secretly kneads the two portions together, pushing the total over the legal threshold. Do both now owe the donation?","options":[{"id":"A","text":"Yes; combining the doughs creates a joint liability.","tags":["responsibility","collective-responsibility"]},{"id":"B","text":"No; each person is responsible only for the amount they originally owned.","tags":["property-rights","personal-agency"]}]}
{"id":"hal-002","source":"1:2","strength":"okay","title":"Shrinking loaves to dodge a levy","vignette":"A household mixes one large batch of dough that exceeds the donation threshold, then divides it into several mini-loaves each under the limit, hoping to escape the fee. Does the plan work?","options":[{"id":"A","text":"No; liability is fixed once the big batch is mixed.","tags":["responsibility","religious-duty"]},{"id":"B","text":"Yes; final loaf size determines whether the levy applies.","tags":["property-rights","utilitarian"]}]}
{"id":"hal-003","source":"2:3","strength":"weak","title":"Buying pre-mixed dough from an exempt producer","vignette":"A home baker purchases raw dough from a commercial plant that is itself exempt from the donation rule. Once the buyer takes the dough home, must they now set aside the required portion?","options":[{"id":"A","text":"Yes; the duty begins when a liable owner acquires the dough.","tags":["religious-duty","responsibility"]},{"id":"B","text":"No; the obligation rests on whoever did the mixing, not on later buyers.","tags":["property-rights","proportionality"]}]}
{"id":"hal-004","source":"3:7","strength":"weak","title":"Tiered vs. flat donation rates","vignette":"Regulations leave the donation amount undefined. Should a home cook give 4 % of each batch while a factory bakery gives only 2 %, or should everyone follow one uniform minimum?","options":[{"id":"A","text":"Differentiate; households give more, commercial bakers less.","tags":["worker-dignity","responsibility"]},{"id":"B","text":"Use one low rate for all producers.","tags":["reciprocity","property-rights"]}]}
{"id":"hal-005","source":"4:9","strength":"weak","title":"Spilled-on donation dough","vignette":"The portion already set aside for donation becomes unfit for human eating (e.g.\, soaked with cleaning fluid). Should it be incinerated as hazardous waste, or may the owner at least feed it to pets?","options":[{"id":"A","text":"Destroy it; designated food must not be repurposed once spoiled.","tags":["religious-duty","sanctity-of-life"]},{"id":"B","text":"Feed it to animals; better some use than total waste.","tags":["utilitarian","property-rights"]}]}
{"id":"hal-006","source":"4:10","strength":"okay","title":"Shipping the donation overseas","vignette":"Bakers in a country where the donation rule is only symbolic wish to mail their set-aside portion to certified recipients abroad, where the rule still carries weight. Are they obliged to pay the shipping cost?","options":[{"id":"A","text":"Yes; honouring the donation’s purpose outweighs the expense.","tags":["altruism","religious-duty"]},{"id":"B","text":"No; once separated locally, no duty to incur extra logistics.","tags":["property-rights","utilitarian"]}]}
{"id":"hal-007","source":"5:1","strength":"weak","title":"Mixed-grain dough and liability","vignette":"A baker kneads wheat dough (covered by the levy) with rice dough (exempt). Wheat is now the minority ingredient. Does the combined dough still require the donation?","options":[{"id":"A","text":"Yes; any amount of liable grain triggers the rule.","tags":["responsibility","religious-duty"]},{"id":"B","text":"No; the wheat is annulled by being less than half.","tags":["proportionality","property-rights"]}]}
