{"id":"hal-001","source":"1:1","strength":"okay","title":"Unilateral Combination of Small Production Batches","vignette":"Two independent small food producers each have a batch of dough below the size requiring a mandatory quality control sample to be sent to a central lab. One producer, without informing the other, combines both batches, pushing the total quantity above the threshold. Must a sample now be taken that represents both original portions?","options":[{"id":"A","text":"Yes; combining the batches creates a joint liability for quality control testing on the merged product.","tags":["responsibility","collective-responsibility","quality-assurance","regulatory-compliance"]},{"id":"B","text":"No; each producer is only liable for their own initial batch. The unilateral combination doesn't change individual responsibility for pre-existing small batches.","tags":["property-rights","personal-agency","individual-liability","scope-of-work"]}]}
{"id":"hal-002","source":"1:2","strength":"okay","title":"Dividing a Production Batch After Processing to Avoid Mandatory Sampling","vignette":"A food production facility processes a large batch of dough, which would normally require a quality control sample to be set aside. After initial processing but before final packaging, they divide the large batch into many smaller individual units, each of which is below the sampling threshold. Is this a valid way to avoid sending a sample?","options":[{"id":"A","text":"Stratagem fails; the obligation to provide a sample was fixed when the large batch was initially processed.","tags":["responsibility","quality-standard","anti-circumvention","regulatory-intent"]},{"id":"B","text":"Stratagem works; the final size of the packaged units determines the sampling liability.","tags":["property-rights","utilitarianism","loophole-exploitation","technical-compliance"]}]}
{"id":"hal-003","source":"2:3","strength":"weak","title":"Accepting Processed Materials from an Unregulated Supplier","vignette":"A certified organic bakery buys a large batch of pre-kneaded dough from an external supplier who is not certified organic and therefore not subject to the same rigorous ingredient tracking and sample-submission rules. Must the bakery now treat this dough as if it's their own production and submit a quality/organic certification sample, or is the batch exempt because the initial processing was done by an unregulated party?","options":[{"id":"A","text":"Obligated once the certified bakery acquires it; ownership and intent to sell under their brand triggers the sampling/certification duty.","tags":["quality-assurance","brand-responsibility","supply-chain-integrity","consumer-trust"]},{"id":"B","text":"Exempt; the primary processing (kneading) was done by the unregulated supplier, so the obligation doesn't transfer to the purchaser for that stage.","tags":["property-rights","supplier-responsibility","scope-of-liability","technicality"]}]}
{"id":"hal-004","source":"3:7","strength":"weak","title":"Size of Mandatory Sample: Home-Based vs. Commercial Production","vignette":"Regulations require a sample of certain products to be set aside for quality testing, but the specific amount isn't strictly defined by the overarching regulation ("core law"). Should a small home-based artisan producer be required to submit a proportionally larger sample (e.g., 1/24th of their small batch) compared to a large industrial producer (e.g., 1/48th of their massive batch), or should there be a single, uniform percentage for all producers?","options":[{"id":"A","text":"Differentiate – a larger proportional sample from small producers, a smaller proportion from large-scale commercial ones, reflecting different risk or impact scales.","tags":["proportionality","risk-assessment","fairness","regulatory-flexibility"]},{"id":"B","text":"Uniform minimal percentage for all; treat everyone equally under the regulation, regardless of production scale.","tags":["equality","simplicity-in-regulation","standardization"]}]}
{"id":"hal-005","source":"4:9","strength":"weak","title":"Handling a Contaminated Quality Control Sample","vignette":"A mandatory quality control sample, set aside from a food production batch, becomes accidentally contaminated and is no longer suitable for the standard tests (e.g., "senior professional can't eat it"). May the producing company simply discard it with regular waste (e.g., "feed it to dogs"), or must it be disposed of according to specific protocols for hazardous or sensitive material (e.g., "burned")?","options":[{"id":"A","text":"Dispose of according to special protocols; the sample, though contaminated, still represents a regulated item and must not be improperly discarded.","tags":["regulatory-compliance","waste-management-protocol","sample-integrity","public-health-concern"]},{"id":"B","text":"Discard with regular waste; it's contaminated and unusable, so practical disposal is fine. Better than complete waste if it can be used for something like animal feed.","tags":["utilitarianism","waste-reduction","practicality","cost-effectiveness"]}]}
{"id":"hal-006","source":"4:10","strength":"okay","title":"Shipping Mandatory Samples from a Branch Office to Head Office Lab","vignette":"A company's branch office in a different region ("remote region") is required by internal policy to send quality control samples ("sample") to the main certified lab at Head Office ("head office"). Is the branch obligated to incur the extra shipping costs and logistical effort, or can they process/dispose of the samples locally if external lab testing is not a strict legal requirement in their region, only an internal company standard?","options":[{"id":"A","text":"Send them to Head Office; honoring the company's quality standard and centralized testing overrides inconvenience and cost.","tags":["altruism","corporate-policy","quality-standard","centralized-control"]},{"id":"B","text":"Handle/discard locally; no strict duty to incur shipping expenses if local regulations don't mandate external testing and it's only an internal standard not critical for safety.","tags":["property-rights","utilitarianism","cost-benefit-analysis","local-autonomy"]}]}
{"id":"hal-007","source":"5:1","strength":"weak","title":"Mixtures of Compliant and Non-Compliant Materials and Sampling Obligation","vignette":"A batch of standard ingredients ("barley dough," liable for sampling) is mixed with a batch of specialty ingredients that are normally exempt from sampling ("rice dough"). The standard ingredients now constitute less than the majority of the mixture. Does the entire mixture now require a sample to be sent for quality control based on the presence of any standard ingredients?","options":[{"id":"A","text":"Yes; any presence of standard, liable ingredients means the entire batch is now subject to sampling rules.","tags":["responsibility","quality-control","regulatory-scope","precautionary-principle"]},{"id":"B","text":"No; if the liable ingredients are below a certain threshold (e.g., majority) in the final mix, their effect is 'annulled' for sampling purposes. The batch is exempt.","tags":["proportionality","de-minimis-rule","material-composition","practical-exemption"]}]}
