{"id":"orl-001","source":"1:1","strength":"prime","title":"Doubtful Pre-Release Goods: Domestic vs. Imported","vignette":"A distributor imports new tech gadgets from a country with lax pre-release embargo rules. Within their own country (which has strict embargo rules for new tech until an official launch date), must the distributor treat gadgets of uncertain release status as still under embargo?","options":[{"id":"A","text":"Treat as embargoed within the strict jurisdiction; doubts are resolved towards restriction there.","tags":["regulatory-compliance","rule-of-law","precautionary-principle","local-laws-prevail"]},{"id":"B","text":"Permit sale/use; if there's doubt about its origin and it was permissible abroad, the leniency carries over.","tags":["property-rights","utilitarianism","free-trade","global-sourcing"]}]}
{"id":"orl-002","source":"1:2","strength":"prime","title":"Knowingly Selling Products Under Initial Use Restriction","vignette":"A software developer has created a new application. For the first three years (analogous to "orlah period"), as per a community charter they ascribed to, the software is meant for free, non-commercial use only to gather feedback, not for sale. Can the developer sell licenses in the third year to recoup development expenses?","options":[{"id":"A","text":"Forbidden — no commercial benefit may be derived during this initial non-commercial period.","tags":["ethical-commitment","community-charter","non-profit-phase","principle-adherence"]},{"id":"B","text":"Allowed if sold to users/entities not part of that specific community or not aware of the charter; only signatories are bound by the non-commercial clause.","tags":["property-rights","selective-compliance","market-segmentation","utilitarian-ethics"]}]}
{"id":"orl-003","source":"1:3","strength":"okay","title":"Restricted Asset Straddling Jurisdictional Borders","vignette":"A company's server farm (the "root" of a data asset) is in Country A, where data from new AI models is under a 3-year usage restriction ("orlah"). However, a data cable ("branches") extends into Country B, which has no such restriction. A user in Country B accesses and uses data processed from this AI model.","options":[{"id":"A","text":"Prohibit — the data's restricted status follows its origin and processing location in Country A.","tags":["data-sovereignty","origin-rules","intellectual-property","extraterritorial-effect"]},{"id":"B","text":"Permit — the status follows the point of access; usage in Country B is subject to Country B's laws only.","tags":["property-rights","rule-of-law","jurisdictional-shopping","lex-loci-solutionis"]}]}
{"id":"orl-004","source":"1:5","strength":"okay","title":"Assets with Uncertain Maturity/Restriction Period","vignette":"A company acquires a portfolio of patents from another firm. The documentation is incomplete, and it's unclear if some patents are still within an initial non-licensing period (e.g., "orlah" for new inventions) agreed to by the original inventor.","options":[{"id":"A","text":"Assume restricted (non-licensable) until proven clear for commercial use. Prioritize compliance.","tags":["due-diligence","responsibility","precautionary-principle","risk-aversion"]},{"id":"B","text":"Assume permitted for licensing unless clear evidence of restriction is found. Prioritize asset utilization.","tags":["property-rights","innocent-until-proven-restricted","asset-maximization"]}]}
{"id":"orl-005","source":"2:1","strength":"prime","title":"Restricted Items Mixed into a Large Commercial Batch","vignette":"One crate of apples from a test orchard (fruit not approved for sale yet - "orlah figs") accidentally falls into a shipment of 300 identical crates of approved, saleable apples.","options":[{"id":"A","text":"Condemn or recall the entire shipment — no de minimis exceptions for products under such significant restrictions.","tags":["consumer-safety","regulatory-absolutism","brand-integrity","zero-tolerance"]},{"id":"B","text":"Permit sale if the ratio of restricted to approved is extremely low (e.g., 1:200 or less); the restricted items are considered effectively 'nullified' by dilution.","tags":["proportionality","utilitarianism","de-minimis-rule","statistical-insignificance"]}]}
{"id":"orl-006","source":"2:3","strength":"weak","title":"Using Waste from Restricted Products for an Unrelated Purpose","vignette":"A research lab is testing a new type of tree whose wood is under a 3-year usage restriction ("orlah"). Can the lab burn the shells of nuts produced by these trees (which are also under restriction) as fuel for heating the lab, if the shells would otherwise be waste?","options":[{"id":"A","text":"Prohibit any benefit, including heat from burning waste byproducts of the restricted trees.","tags":["strict-adherence","no-benefit-rule","material-restriction","scope-of-prohibition"]},{"id":"B","text":"Permit after burning; the act of complete combustion transforms the material, and the heat is a secondary, indirect benefit from waste. Ashes lose restriction.","tags":["utilitarianism","waste-to-energy","transformation-of-substance","practicality"]}]}
{"id":"orl-007","source":"2:4","strength":"weak","title":"Using Restricted Plant Material for a Non-Consumptive Product","vignette":"A craftsman uses husks from a plant that is under a three-year use restriction ("orlah") to create a natural dye. May a garment dyed with this pigment be sold or used?","options":[{"id":"A","text":"Garment remains restricted — the benefit (color) from the restricted plant material continues in the final product.","tags":["taint-extends","indirect-benefit","material-sourcing-rules","continued-restriction"]},{"id":"B","text":"Garment permitted — the color is an intangible property, and the original plant material has been transformed. The direct benefit from the "orlah" source has ended.","tags":["property-rights","proportionality","transformation-of-materials","end-of-restriction-lifecycle"]}]}
{"id":"orl-008","source":"2:6","strength":"okay","title":"Feeding Restricted-Use Agricultural Products to Livestock","vignette":"A farmer grows a new type of grain that is not approved for human consumption for the first three years ("orlah dates"). Can the farmer feed this grain to their livestock during this period?","options":[{"id":"A","text":"Forbidden — feeding one’s own livestock is considered a personal benefit derived from the restricted product.","tags":["no-benefit-rule","indirect-personal-gain","scope-of-restriction","animal-feed-regulations"]},{"id":"B","text":"Permitted — only direct human consumption or sale for human use is banned; animal feed is a distinct, lower-grade use.","tags":["utilitarianism","property-rights","practical-use-of-surplus","distinction-of-use-categories"]}]}
{"id":"orl-009","source":"3:1","strength":"prime","title":"Status of Byproducts After Processing Restricted Materials","vignette":"After wood from trees under a 3-year use restriction ("orlah logs") is completely burned to ash, may the ash be used as a component in another product, like fertilizer?","options":[{"id":"A","text":"Yes; the prohibition ends once the material is fundamentally transformed (e.g., reduced to ash). The ash is a new substance.","tags":["rule-of-law","utilitarianism","material-transformation","lifecycle-end-of-restriction"]},{"id":"B","text":"No; any residual benefit or use derived from the originally restricted material is still barred. The origin taints the byproduct.","tags":["strict-adherence","no-benefit-rule","traceability-of-restriction","precautionary-principle"]}]}
{"id":"orl-010","source":"3:9","strength":"okay","title":"Retroactive 'Dilution' of a Restricted Substance Mixture","vignette":"A batch of industrial solvent was accidentally contaminated with a small amount of a restricted chemical ("orlah wine"), making the whole batch unusable as it exceeded the 1:200 impurity limit. Later, more of the pure, permitted solvent is added to the mixture, bringing the concentration of the restricted chemical below the 1:200 threshold. Does this subsequent addition 'fix' the batch and make it permissible to use?","options":[{"id":"A","text":"Yes; the later dilution retroactively meets the acceptable impurity ratio, rendering the batch usable.","tags":["utilitarianism","proportionality","remediation","practical-solution","end-state-compliance"]},{"id":"B","text":"No; the mixture became fully restricted the moment the impurity limit was initially exceeded. It cannot be 'un-restricted' by later dilution.","tags":["irreversibility-of-contamination","strict-compliance-timeline","procedural-violation","once-forbidden-always-forbidden"]}]}
