{"id": "bik-001", "source": "1:1", "strength": "okay", "title": "Eligibility of Product for National Award if Initial Work by Non-Citizen", "vignette": "A new innovative product was initially developed by a non-citizen inventor but was acquired and brought to market maturity by a citizen of Country X. Does this product qualify for Country X's prestigious \"National Innovation Award\" (analogous to bikkurim), which is typically for citizen-led innovations?", "options": [{"id": "A", "text": "Qualifies; the current citizen owner and their work to bring it to market fulfills the spirit of the national award.", "tags": ["tradition", "fairness", "property-rights"]}, {"id": "B", "text": "Disqualifies; the origin of the core idea/product with a non-citizen taints its eligibility for a strictly national award.", "tags": ["rule-of-law", "authority", "rule-of-law"]}]}
{"id": "bik-002", "source": "1:2", "strength": "okay", "title": "Eligibility of Product Sold to Foreign Entity then Reacquired", "vignette": "A product initially developed by a citizen of Country X was sold to a foreign company, then later repurchased by a company in Country X before its official public launch. Does this product qualify for Country X's \"National Innovation Award\"?", "options": [{"id": "A", "text": "Qualifies; the final ownership and launch by a citizen entity restores its eligibility for the national award.", "tags": ["tradition", "property-rights", "property-rights"]}, {"id": "B", "text": "Disqualifies; the interim foreign ownership breaks the chain of national contribution required for the award.", "tags": ["rule-of-law", "property-rights", "rule-of-law"]}]}
{"id": "bik-003", "source": "2:1", "strength": "prime", "title": "Who Presents for a Collaborative Project Award?", "vignette": "A research project was primarily executed by a lead researcher (analogous to \"sharecropper\") using resources and lab space provided by a host institution (analogous to \"landowner\"). The project wins a major award (the \"first fruits\"). Who should be the primary presenter or acceptor of the award?", "options": [{"id": "A", "text": "The lead researcher; they performed the core work and achieved the results.", "tags": ["responsibility", "fairness", "fairness"]}, {"id": "B", "text": "The head of the host institution; their provision of resources and ultimate ownership of the lab determines primary representation.", "tags": ["property-rights", "authority", "property-rights"]}]}
{"id": "bik-004", "source": "2:2", "strength": "okay", "title": "Eligibility of Joint Venture Product for National Award", "vignette": "A product was developed by a joint venture between a company from Country X and a foreign company. Does this product qualify for Country X's \"National Innovation Award\"?", "options": [{"id": "A", "text": "Qualifies; the citizen company's significant share and contribution suffice for eligibility.", "tags": ["authority", "collaboration", "fairness"]}, {"id": "B", "text": "Disqualifies; any foreign stake in the development or ownership disqualifies it from a strictly national award.", "tags": ["rule-of-law", "authority", "fairness"]}]}
{"id": "bik-005", "source": "3:1", "strength": "okay", "title": "Speech by a Repatriated Citizen Receiving National Award", "vignette": "A citizen of Country X who lived abroad for many years and then returned is now receiving a \"National Innovation Award\". Should their acceptance speech follow the standard formula emphasizing national heritage and collective achievement (\"which You gave our ancestors\"), or should it be a modified version acknowledging their personal journey and return?", "options": [{"id": "A", "text": "Standard formula; emphasizes their reintegration and shared national heritage.", "tags": ["authority", "authority", "tradition"]}, {"id": "B", "text": "Modified version; allows for acknowledgment of their unique personal story of return and contribution.", "tags": ["personal-agency", "integrity", "personal-agency"]}]}
{"id": "bik-006", "source": "3:3", "strength": "okay", "title": "Speech by a New Immigrant Receiving National Award", "vignette": "A recently naturalized citizen (a \"convert\") is part of a team receiving a \"National Innovation Award\". When it's their turn to speak, must they deliver a unique speech acknowledging their journey to citizenship and their new national identity, or should they use the standard communal declaration of achievement and belonging?", "options": [{"id": "A", "text": "Unique speech; allows them to reflect their individual journey and perspective as a new citizen.", "tags": ["personal-agency", "fairness", "fairness", "personal-agency"]}, {"id": "B", "text": "Standard declaration; emphasizes their full integration and unity with the national community.", "tags": ["collective-responsibility", "authority", "tradition", "authority"]}]}
{"id": "bik-007", "source": "3:4", "strength": "okay", "title": "Award Presenter with a Potential Conflict of Interest", "vignette": "A person designated to present their company's product for a prestigious ethics award (\"bikkurim basket\") is currently under a minor, unrelated investigation for a compliance breach (\"ritually impure\"). May they still formally submit the product (\"leave the basket\") at the award venue and depart, even if they cannot participate in the subsequent public ceremony (\"ascend the Mount\") due to the ongoing investigation?", "options": [{"id": "A", "text": "Yes; the product's submission can be formally completed even if the presenter's participation in the ceremony is restricted.", "tags": ["personal-agency", "integrity", "rule-of-law", "prudence"]}, {"id": "B", "text": "No; the presenter's compromised status (\"impurity\") invalidates or taints the entire submission.", "tags": ["rule-of-law", "integrity", "integrity", "integrity"]}]}
{"id": "bik-008", "source": "3:6", "strength": "okay", "title": "Award Acceptance by Non-Verbal Presenter", "vignette": "The lead designer of an award-winning product is non-verbal (e.g., \"deaf-mute\") and cannot deliver a standard oral acceptance speech. Should they use gestures, a sign language interpreter, or a pre-written statement read by another to fulfill the ceremonial obligation of acceptance?", "options": [{"id": "A", "text": "Yes; alternative communication methods suffice to convey the required intent and gratitude.", "tags": ["personal-agency", "fairness", "compassion", "rule-of-law"]}, {"id": "B", "text": "No; a formal verbal declaration by the awardee themselves is strictly mandated by the ceremony's tradition.", "tags": ["tradition", "legalism", "tradition"]}]}
{"id": "bik-009", "source": "3:2", "strength": "okay", "title": "Multiple Designations for a Special Contribution", "vignette": "A philanthropist makes a large pledge to a university, initially marking a specific block of shares in their portfolio for this purpose (\"ties a reed band\"). Must they also make a formal written declaration or sign a deed of gift when the shares are actually transferred (\"after picking it\")?", "options": [{"id": "A", "text": "Yes; both the initial earmarking and a final formal declaration/transfer are required for legal and procedural completeness.", "tags": ["due-process", "rule-of-law", "rule-of-law", "prudence"]}, {"id": "B", "text": "No; the initial, clear earmarking of the specific asset suffices to establish the intent and commitment.", "tags": ["personal-agency", "proportionality", "culpability", "trust"]}]}
