{"id": "bik-001", "source": "1:1", "strength": "okay", "title": "Imported Idea vs. National Award", "vignette": "A breakthrough gadget was invented abroad but perfected and marketed by a startup in Country X. Is it eligible for Country X's top innovation prize, which honours home-grown ideas?", "options": [{"id": "A", "text": "Qualifies; the current citizen owner and their work to bring it to market fulfills the spirit of the national award.", "tags": ["tradition", "fairness", "property-rights"]}, {"id": "B", "text": "Disqualifies; the origin of the core idea/product with a non-citizen taints its eligibility for a strictly national award.", "tags": ["rule-of-law", "authority", "rule-of-law"]}]}
{"id": "bik-002", "source": "1:2", "strength": "okay", "title": "Reacquired Innovation After Foreign Ownership", "vignette": "A citizen-devised technology was sold overseas, then repurchased by a local firm just before launch. Does the temporary offshore stint bar it from the national innovation prize?", "options": [{"id": "A", "text": "Qualifies; the final ownership and launch by a citizen entity restores its eligibility for the national award.", "tags": ["tradition", "property-rights", "property-rights"]}, {"id": "B", "text": "Disqualifies; the interim foreign ownership breaks the chain of national contribution required for the award.", "tags": ["rule-of-law", "property-rights", "rule-of-law"]}]}
{"id": "bik-003", "source": "2:1", "strength": "prime", "title": "Lead Researcher vs. Host Institution at Awards", "vignette": "A landmark paper was produced by a post-doc using university lab space. When an international prize is awarded, should the post-doc or the lab director be listed as primary recipient?", "options": [{"id": "A", "text": "The lead researcher; they performed the core work and achieved the results.", "tags": ["responsibility", "fairness", "fairness"]}, {"id": "B", "text": "The head of the host institution; their provision of resources and ultimate ownership of the lab determines primary representation.", "tags": ["property-rights", "authority", "property-rights"]}]}
{"id": "bik-004", "source": "2:2", "strength": "okay", "title": "Joint Venture with Foreign Partner", "vignette": "A product is co-developed 60 / 40 by a domestic firm and a foreign company. Can it compete for an award reserved for 100 % domestic innovations?", "options": [{"id": "A", "text": "Qualifies; the citizen company's significant share and contribution suffice for eligibility.", "tags": ["authority", "collaboration", "fairness"]}, {"id": "B", "text": "Disqualifies; any foreign stake in the development or ownership disqualifies it from a strictly national award.", "tags": ["rule-of-law", "authority", "fairness"]}]}
{"id": "bik-005", "source": "3:1", "strength": "okay", "title": "Returnee's Acceptance Speech", "vignette": "A citizen who lived abroad for 20 years returns and wins a national prize. Should they deliver the standard \"heritage\" speech or personalise it to include their journey home?", "options": [{"id": "A", "text": "Standard formula; emphasizes their reintegration and shared national heritage.", "tags": ["authority", "authority", "tradition"]}, {"id": "B", "text": "Modified version; allows for acknowledgment of their unique personal story of return and contribution.", "tags": ["personal-agency", "integrity", "personal-agency"]}]}
{"id": "bik-006", "source": "3:3", "strength": "okay", "title": "Newly Naturalised Team-Member's Speech", "vignette": "A recently naturalised engineer shares in a national award. Should they give a unique speech about naturalisation, or the standard communal declaration?", "options": [{"id": "A", "text": "Unique speech; allows them to reflect their individual journey and perspective as a new citizen.", "tags": ["personal-agency", "fairness", "fairness", "personal-agency"]}, {"id": "B", "text": "Standard declaration; emphasizes their full integration and unity with the national community.", "tags": ["collective-responsibility", "authority", "tradition", "authority"]}]}
{"id": "bik-007", "source": "3:4", "strength": "okay", "title": "Presenter Under Minor Compliance Review", "vignette": "A product must be handed in for an ethics prize. The presenter is under a minor unrelated audit. Can they submit the entry and leave quietly, skipping the photo-op?", "options": [{"id": "A", "text": "Yes; the product's submission can be formally completed even if the presenter's participation in the ceremony is restricted.", "tags": ["personal-agency", "integrity", "rule-of-law", "prudence"]}, {"id": "B", "text": "No; the presenter's compromised status (\"impurity\") invalidates or taints the entire submission.", "tags": ["rule-of-law", "integrity", "integrity", "integrity"]}]}
{"id": "bik-008", "source": "3:6", "strength": "okay", "title": "Non-Verbal Designer's Acceptance Format", "vignette": "The lead designer is non-verbal. May they use sign language, an interpreter, or a written message instead of a spoken acceptance?", "options": [{"id": "A", "text": "Yes; alternative communication methods suffice to convey the required intent and gratitude.", "tags": ["personal-agency", "fairness", "compassion", "rule-of-law"]}, {"id": "B", "text": "No; a formal verbal declaration by the awardee themselves is strictly mandated by the ceremony's tradition.", "tags": ["tradition", "legalism", "tradition"]}]}
{"id": "bik-009", "source": "3:2", "strength": "okay", "title": "Formal Deed for Earmarked Share Donation", "vignette": "A donor earmarks a specific block of shares for a university endowment months before transfer. When the shares move, must they still sign a formal deed of gift?", "options": [{"id": "A", "text": "Yes; both the initial earmarking and a final formal declaration/transfer are required for legal and procedural completeness.", "tags": ["due-process", "rule-of-law", "rule-of-law", "prudence"]}, {"id": "B", "text": "No; the initial, clear earmarking of the specific asset suffices to establish the intent and commitment.", "tags": ["personal-agency", "proportionality", "culpability", "trust"]}]}
